////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление информационной базы"
//
////////////////////////////////////////////////////////////////////////////////

// Снимает блокировку информационной файловой базы.
Процедура СнятьБлокировкуФайловойБазы() Экспорт
	Если Не БазоваяПодсистемаСервер.ИнформационнаяБазаФайловая() Тогда
		Возврат;
	КонецЕсли;

	// Зарезервировано для новых подсистем
КонецПроцедуры

Функция ВыполнитьОбновлениеИнформационнойБазы(ПриЗапускеКлиентскогоПриложения = Ложь, Перезапустить = Ложь, ВыполнятьОтложенныеОбработчики = Ложь) Экспорт
	ПараметрыОбновления	= Новый Структура;
	ПараметрыОбновления.Вставить("ИсключениеПриНевозможностиБлокировкиИБ",	Истина);
	ПараметрыОбновления.Вставить("ПриЗапускеКлиентскогоПриложения",			ПриЗапускеКлиентскогоПриложения);
	ПараметрыОбновления.Вставить("Перезапустить",							Перезапустить);
	ПараметрыОбновления.Вставить("УстановленнаяБлокировкаИБ",				Неопределено);
	ПараметрыОбновления.Вставить("ВФоне",									Ложь);
	ПараметрыОбновления.Вставить("ВыполнятьОтложенныеОбработчики",			ВыполнятьОтложенныеОбработчики);

	Попытка
		Результат	= ОбновлениеИБСервер.ВыполнитьОбновлениеИнформационнойБазы(ПараметрыОбновления);
	Исключение
		// Переход в режим открытия формы повторной синхронизации данных перед запуском
		// с двумя вариантами "Синхронизировать и продолжить" и "Продолжить".

		// Зарезервировано для новых подсистем

		ВызватьИсключение;
	КонецПопытки;

	Перезапустить	= ПараметрыОбновления.Перезапустить;

	Возврат Результат;
КонецФункции
