////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление информационной базы"
//
////////////////////////////////////////////////////////////////////////////////

// Снимает блокировку информационной файловой базы.
Процедура СнятьБлокировкуФайловойБазы() Экспорт
	Если Не БазоваяПодсистемаСервер.ИнформационнаяБазаФайловая() Тогда
		Возврат;
	КонецЕсли;

	// Зарезервировано для новых подсистем
КонецПроцедуры

Функция ВыполнитьОбновлениеИнформационнойБазы(ПриЗапускеКлиентскогоПриложения = Ложь, Перезапустить = Ложь, ВыполнятьОтложенныеОбработчики = Ложь) Экспорт
	ПараметрыОбновления	= Новый Структура;
	ПараметрыОбновления.Вставить("ИсключениеПриНевозможностиБлокировкиИБ",	Истина);
	ПараметрыОбновления.Вставить("ПриЗапускеКлиентскогоПриложения",			ПриЗапускеКлиентскогоПриложения);
	ПараметрыОбновления.Вставить("Перезапустить",							Перезапустить);
	ПараметрыОбновления.Вставить("УстановленнаяБлокировкаИБ",				Неопределено);
	ПараметрыОбновления.Вставить("ВФоне",									Ложь);
	ПараметрыОбновления.Вставить("ВыполнятьОтложенныеОбработчики",			ВыполнятьОтложенныеОбработчики);

	Результат			= ОбновлениеИБСервер.ВыполнитьОбновлениеИнформационнойБазы(ПараметрыОбновления);

	Перезапустить		= ПараметрыОбновления.Перезапустить;

	Возврат Результат;
КонецФункции
