
Процедура ПередНачаломРаботыСистемы(Параметры) Экспорт
	//зарезервировано для новых подсистем

	// Проверка минимальных прав на вход в программу.
	Параметры.Модули.Добавить(ПользователиКлиент);

	// Проверка блокировки информационной базы для обновления.
	Параметры.Модули.Добавить(ОбновлениеИБКлиент);

	// Проверка минимально допустимой версии платформы для запуска.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", БазоваяПодсистемаКлиент, 2));

	// Проверка необходимости восстановления связи с главным узлом.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", БазоваяПодсистемаКлиент, 3));

	//зарезервировано для новых подсистем

	// Проверка статуса обработчиков отложенного обновления.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", ОбновлениеИБКлиент, 2));

	// Загрузка/обновление параметров работы программы.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", ОбновлениеИБКлиент, 3));

	// Проверка авторизации пользователя.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", ПользователиКлиент, 2));

	//зарезервировано для новых подсистем

	// Обновление информационной базы.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", ОбновлениеИБКлиент, 4));

	// Обработка ключа запуска ВыполнитьОбновлениеИЗавершитьРаботу.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", ОбновлениеИБКлиент, 5));

	// Смена пароля при входе, если требуется.
	Параметры.Модули.Добавить(Новый Структура("Модуль, Номер", ПользователиКлиент, 3));
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
	//зарезервировано для новых подсистем

	МодульОбновлениеИБ = БазоваяПодсистемаКлиент.ОбщийМодуль("ОбновлениеИБКлиент");
	Параметры.Модули.Добавить(МодульОбновлениеИБ);

	//зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеНачалаРаботыСистемы() Экспорт
	БазоваяПодсистемаКлиент.ПослеНачалаРаботыСистемы();

	//зарезервировано для новых подсистем

	ОбновлениеИБКлиент.ПослеНачалаРаботыСистемы();
	ПользователиКлиент.ПослеНачалаРаботыСистемы();

	//зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОбработкеПараметровЗапуска(ПараметрыЗапуска, Отказ) Экспорт
	//зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, Предупреждения) Экспорт
	// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ОбработкаВыбораТабличногоДокумента(ФормаОтчета, Элемент, Область, СтандартнаяОбработка) Экспорт
	// зарезервировано для новых подсистем
КонецПроцедуры
