////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление информационной базы"
//
////////////////////////////////////////////////////////////////////////////////

// Проверить необходимость обновления информационной базы при смене версии конфигурации.
//
Функция НеобходимоОбновлениеИнформационнойБазы() Экспорт
	Если ОбновлениеИБСервер.НеобходимоВыполнитьОбновление(Метаданные.Версия, ОбновлениеИБСервер.ВерсияИБ(Метаданные.Имя)) Тогда
		Возврат Истина;
	КонецЕсли;

	Если Не ОбновлениеИБСервер.ВыполненаРегистрацияОтложенныхОбработчиковОбновления() Тогда
		Возврат Истина;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Запустить = ПараметрыСеанса.ПараметрыКлиентаНаСервере.Получить("ЗапуститьОбновлениеИнформационнойБазы");
	УстановитьПривилегированныйРежим(Ложь);

	Если Запустить <> Неопределено И ПользователиСервер.ЭтоПолноправныйПользователь(, Истина, Истина) Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
КонецФункции