////////////////////////////////////////////////////////////////////////////////
// Подсистема "Варианты отчетов"
//
////////////////////////////////////////////////////////////////////////////////

// Открывает форму дополнительного отчета с заданным вариантом.
//
// Параметры:
//   Ссылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка дополнительного отчета.
//   КлючВарианта - Строка - Имя варианта дополнительного отчета.
//
Процедура ПриПодключенииОтчета(ПараметрыОткрытия) Экспорт
	ВариантыОтчетовСервер.ПриПодключенииОтчета(ПараметрыОткрытия);
КонецПроцедуры

Функция ПараметрыВыбораТипа(Знач Тип, Знач ПараметрыНастройки) Экспорт
	Возврат ВариантыОтчетовСервер.ПараметрыВыбораТипа(Тип, ПараметрыНастройки);
КонецФункции
