
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ДляВнешнегоПользователя Тогда
		НастройкиВхода = ПользователиСерверПовтИсп.Настройки().ВнешниеПользователи;
	Иначе
		НастройкиВхода = ПользователиСерверПовтИсп.Настройки().Пользователи;
	КонецЕсли;

	МинимальнаяДлинаПароля = ПолучитьМинимальнуюДлинуПаролейПользователей();

	Если МинимальнаяДлинаПароля < НастройкиВхода.МинимальнаяДлинаПароля Тогда
		МинимальнаяДлинаПароля = НастройкиВхода.МинимальнаяДлинаПароля;
	КонецЕсли;

	Если МинимальнаяДлинаПароля <= 8 Тогда
		МинимальнаяДлинаПароля = 8;
	КонецЕсли;

	ПараметрыПароля	= ПользователиСервер.ПараметрыПароля(МинимальнаяДлинаПароля, Истина);

	НовыйПароль		= ПользователиСервер.СоздатьПароль(ПараметрыПароля);
КонецПроцедуры

#КонецОбласти
