////////////////////////////////////////////////////////////////////////////////
// Подсистема "Варианты отчетов"
//
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиОбновленияИнформационнойБазы

// Актуализирует кэш метаданных конфигурации: справочник ПредопределенныеВариантыОтчетов
//     и параметры вариантов отчетов в регистре.
Процедура ОперативноеОбновлениеОбщихДанныхКонфигурации(ПараметрыОбновления) Экспорт
	ОперативноеОбновлениеОбщихДанных("ОбщиеДанныеКонфигурации", ПараметрыОбновления.РазделенныеОбработчики);
КонецПроцедуры

// Заполняет ссылки предопределенных элементов справочника "Варианты отчетов".
Процедура ЗаполнитьСсылкиПредопределенных() Экспорт
	ПредставлениеПроцедуры = "Заполнить ссылки предопределенных вариантов отчетов";
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	// Составить таблицу замен старых ключей вариантов на актуальные.
	Изменения = ИзмененияКлючей();

	// Получить ссылки вариантов отчетов для замены ключей,
	// исключив из списка замен те варианты отчетов,
	// актуальные ключи которых уже зарегистрированы,
	// или старые ключи которых уже не заняты.
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	Изменения.Отчет КАК Отчет,
	            	  |	Изменения.СтароеИмяВарианта КАК СтароеИмяВарианта,
	            	  |	Изменения.АктуальноеИмяВарианта КАК АктуальноеИмяВарианта
	            	  |ПОМЕСТИТЬ втИзменения
	            	  |ИЗ
	            	  |	&Изменения КАК Изменения
	            	  |
	            	  |ИНДЕКСИРОВАТЬ ПО
	            	  |	СтароеИмяВарианта,
	            	  |	АктуальноеИмяВарианта
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	            	  |	ВариантыОтчетов.Ссылка КАК ВариантОтчета,
	            	  |	ВЫРАЗИТЬ(ВариантыОтчетов.Отчет КАК Справочник.ИдентификаторыОбъектовМетаданных) КАК ОтчетДляЗаменыКлючей,
	            	  |	ЕСТЬNULL(втИзменения.АктуальноеИмяВарианта, ВариантыОтчетов.КлючВарианта) КАК АктуальныйКлючВарианта
	            	  |ПОМЕСТИТЬ втАктуальные
	            	  |ИЗ
	            	  |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	            	  |		ЛЕВОЕ СОЕДИНЕНИЕ втИзменения КАК втИзменения
	            	  |		ПО ВариантыОтчетов.Отчет = втИзменения.Отчет
	            	  |			И ВариантыОтчетов.КлючВарианта = втИзменения.СтароеИмяВарианта
	            	  |ГДЕ
	            	  |	ВариантыОтчетов.Пользовательский = ЛОЖЬ
	            	  |	И ВариантыОтчетов.ТипОтчета = &ТипОтчета
	            	  |	И ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ
	            	  |	И ВариантыОтчетов.ПредопределенныйВариант = &ПустойПредопределенный
	            	  |
	            	  |ИНДЕКСИРОВАТЬ ПО
	            	  |	АктуальныйКлючВарианта,
	            	  |	ВариантОтчета
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ
	            	  |	втАктуальные.ВариантОтчета КАК ВариантОтчета,
	            	  |	ПредопределенныеВариантыОтчетов.Наименование КАК Наименование,
	            	  |	ПредопределенныеВариантыОтчетов.КлючВарианта КАК КлючВарианта,
	            	  |	ЕСТЬNULL(ПредопределенныеВариантыОтчетов.Ссылка, НЕОПРЕДЕЛЕНО) КАК ПредопределенныйВариант
	            	  |ИЗ
	            	  |	втАктуальные КАК втАктуальные
	            	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов КАК ПредопределенныеВариантыОтчетов
	            	  |		ПО втАктуальные.ОтчетДляЗаменыКлючей = ПредопределенныеВариантыОтчетов.Отчет
	            	  |			И втАктуальные.АктуальныйКлючВарианта = ПредопределенныеВариантыОтчетов.КлючВарианта";

	Запрос.УстановитьПараметр("Изменения", Изменения);
	Запрос.УстановитьПараметр("ТипОтчета", Перечисления.ТипыОтчетов.Внутренний); // Поддержка расширений не требуется.
	Запрос.УстановитьПараметр("ПустойПредопределенный", Справочники.ПредопределенныеВариантыОтчетов.ПустаяСсылка());

	// Заменить имена вариантов на ссылки.
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВариантОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ВариантОбъект.ДополнительныеСвойства.Вставить("ЗаполнениеПредопределенных", Истина);
		ВариантОбъект.ДополнительныеСвойства.Вставить("ИндексироватьСхему", Ложь);
		Если ЗначениеЗаполнено(Выборка.ПредопределенныйВариант) Тогда
			ЗаполнитьЗначенияСвойств(ВариантОбъект, Выборка, "Наименование, КлючВарианта, ПредопределенныйВариант");
			ВариантОбъект.Описание = "";
			ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);
		Иначе
			ВариантОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;

	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Завершение процедуры ""%1"".", ПредставлениеПроцедуры));
КонецПроцедуры

// Актуализирует данные справочника ВариантыОтчетов в части отчетов конфигурации.
Процедура ОперативноеОбновлениеРазделенныхДанныхКонфигурации() Экспорт
	ОперативноеОбновлениеРазделенныхДанных("РазделенныеДанныеКонфигурации");
КонецПроцедуры

// Уменьшает количество быстрых настроек в пользовательских вариантах отчетов до 2 шт.
Процедура СократитьКоличествоБыстрыхНастроек(ВходящиеПараметры = Неопределено) Экспорт
	ПредставлениеПроцедуры = "Сокращение количества быстрых настроек в отчетах";
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	// Чтение сведений от предыдущего запуска с ошибками.
	Параметры = БазоваяПодсистемаСервер.ХранилищеОбщихНастроекЗагрузить("СтандартныеПодсистемы.ВариантыОтчетов","СократитьКоличествоБыстрыхНастроек");
	Запрос = Новый Запрос;
	Если Параметры = Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ Ссылка, Отчет ИЗ Справочник.ВариантыОтчетов ГДЕ Пользовательский И ТипОтчета <> &Внешний";
		Запрос.УстановитьПараметр("Внешний", Перечисления.ТипыОтчетов.Внешний);
		НомерПопытки = 1;
	Иначе
		Запрос.Текст = "ВЫБРАТЬ Ссылка, Отчет ИЗ Справочник.ВариантыОтчетов ГДЕ Ссылка В (&ВариантыСОшибками)";
		Запрос.УстановитьПараметр("ВариантыСОшибками", Параметры.ВариантыСОшибками);
		НомерПопытки = Параметры.НомерПопытки + 1;
	КонецЕсли;
	ТаблицаОтчетов = Запрос.Выполнить().Выгрузить();

	Записано	= 0;
	Ошибок		= 0;
	КэшОтчетов	= Новый Соответствие;
	КэшФлажка	= Неопределено;
	ВариантыСОшибками = Новый Массив;

	Для Каждого СтрокаТаблицы Из ТаблицаОтчетов Цикл
		ОтчетОбъект = КэшОтчетов.Получить(СтрокаТаблицы.Отчет); // Чтение кэша.
		Если ОтчетОбъект = Неопределено Тогда // Запись в кэш.
			Подключение = ПодключитьОтчетОбъект(СтрокаТаблицы.Отчет, Истина);
			Если Подключение.Успех Тогда
				ОтчетОбъект		= Подключение.Объект;
				ОтчетМетаданные = Подключение.Метаданные;
				Если Не ОтчетПодключенКОсновнойФорме(ОтчетМетаданные, КэшФлажка) Тогда
					// Отчет не подключен к общей форме отчета.
					// Уменьшение количества быстрых настроек должно выполняться прикладным кодом.
					ОтчетОбъект = "";
				КонецЕсли;
			Иначе // Отчет не найден.
				ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, Подключение.ТекстОшибки, СтрокаТаблицы.Ссылка);
				ОтчетОбъект = "";
			КонецЕсли;
			КэшОтчетов.Вставить(СтрокаТаблицы.Отчет, ОтчетОбъект);
		КонецЕсли;
		Если ОтчетОбъект = "" Тогда
			Продолжить;
		КонецЕсли;

		ВариантОбъект = СтрокаТаблицы.Ссылка.ПолучитьОбъект();

		ИнформацияОбОшибке = Неопределено;
		Попытка
			ТребуетсяЗапись = УменьшитьКоличествоБыстрыхНастроек(ВариантОбъект, ОтчетОбъект);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ТребуетсяЗапись = Ложь;
		КонецПопытки;
		Если ИнформацияОбОшибке <> Неопределено Тогда // Возникла проблема.
			ТекстОшибки = СтрШаблон("Вариант ""%1"" отчета ""%2"":"
				+ Символы.ПС + "При уменьшении количества быстрых настроек пользовательского возникла ошибка:"
				+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке),
				ВариантОбъект.Ссылка, ВариантОбъект.КлючВарианта, ВариантОбъект.Отчет);
			ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки);
			ВариантыСОшибками.Добавить(ВариантОбъект.Ссылка);
			Ошибок = Ошибок + 1;
		КонецЕсли;

		Если ТребуетсяЗапись Тогда
			ВариантОбъект.ДополнительныеСвойства.Вставить("ИндексироватьСхему", Ложь);
			ВариантОбъект.ДополнительныеСвойства.Вставить("ОтчетОбъект", ОтчетОбъект);
			ВариантОбъект.ДополнительныеСвойства.Вставить("ЗаполнениеПредопределенных");
			ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);
			Записано = Записано + 1;
		КонецЕсли;
	КонецЦикла;

	Если Ошибок > 0 Тогда
		// Запись сведений для следующего запуска.
		Параметры = Новый Структура;
		Параметры.Вставить("НомерПопытки", НомерПопытки);
		Параметры.Вставить("ВариантыСОшибками", ВариантыСОшибками);

		БазоваяПодсистемаСервер.ХранилищеОбщихНастроекСохранить("СтандартныеПодсистемы.ВариантыОтчетов", "СократитьКоличествоБыстрыхНастроек", Параметры);
	ИначеЕсли НомерПопытки > 1 Тогда
		// Удаление сведений от предыдущих запусков.
		БазоваяПодсистемаСервер.ХранилищеОбщихНастроекУдалить("СтандартныеПодсистемы.ВариантыОтчетов", "СократитьКоличествоБыстрыхНастроек", ИмяПользователя());
	КонецЕсли;

	Текст = "Завершение процедуры ""%1"".";
	Если Записано <> Неопределено Тогда
		Текст = Текст + " Изменено %2 объектов.";
		ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон(Текст, ПредставлениеПроцедуры, Записано));
	Иначе
		ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон(Текст, ПредставлениеПроцедуры));
	КонецЕсли;

	Если Ошибок > 0 И НомерПопытки <= 30 Тогда
		// Следующий запуск должен состояться.
		ТекстОшибки = ПредставлениеПроцедуры + ":" + Символы.ПС + "Не удалось уменьшить количество быстрых настроек %1 отчетов.";
		ТекстОшибки = СтрШаблон(ТекстОшибки, Ошибок);

		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецПроцедуры

// Полное обновление индекса поиска предопределенных вариантов отчетов.
Процедура ОтложенноеОбновлениеОбщихДанныхКонфигурацииПолное(Параметры = Неопределено) Экспорт
	ОтложенноеОбновлениеДанных("ОбщиеДанныеКонфигурации", Истина);
КонецПроцедуры

// Полное обновление индекса поиска вариантов отчетов.
Процедура ОтложенноеОбновлениеРазделенныхДанныхКонфигурацииПолное(Параметры = Неопределено) Экспорт
	ОтложенноеОбновлениеДанных("РазделенныеДанныеКонфигурации", Истина);
КонецПроцедуры

#КонецОбласти

// Глобальные настройки подсистемы.
Функция ГлобальныеНастройки() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ВыводитьОтчетыВместоВариантов", Ложь);
	Результат.Вставить("ВыводитьОписания",              Истина);
	Результат.Вставить("РазрешеноИзменятьВарианты",     Истина);

	Результат.Вставить("Поиск", Новый Структура);
	Результат.Поиск.Вставить("ПодсказкаВвода", "Наименование, поле или автор отчета");

	Результат.Вставить("ДругиеОтчеты", Новый Структура);
	Результат.ДругиеОтчеты.Вставить("ЗакрыватьПослеВыбора", Истина);
	Результат.ДругиеОтчеты.Вставить("ПоказыватьФлажок", Ложь);

	Возврат Результат;
КонецФункции

// Глобальные клиентские настройки отчетов.
Функция ВыполнятьЗамеры() Экспорт
	Если БезопасныйРежим() <> Ложь Тогда
		Возврат Ложь;
	КонецЕсли;

	// зарезервировано для новых подсистем

	Возврат Ложь;
КонецФункции

Процедура ПриЗаполненииВсехПараметровРаботыРасширений() Экспорт
	Настройки = Новый Структура;
	Настройки.Вставить("Конфигурация",      Ложь);
	Настройки.Вставить("Расширения",        Истина);

	Настройки.Вставить("ОбщиеДанные",       Истина);
	Настройки.Вставить("РазделенныеДанные", Истина);
	Настройки.Вставить("Оперативное",       Истина);
	Настройки.Вставить("Отложенное",        Истина);
	Настройки.Вставить("Полное",            Истина);

	Обновить(Настройки);
КонецПроцедуры

// Актуализирует данные подсистемы с учетом режима работы программы.
//   Пример использования: после очистки хранилищ настроек.
//
// Параметры:
//   Настройки - Структура - Необязательный. Настройки обновления.
//       * Конфигурация - Булево - Необязательный. Обновлять кэши метаданных конфигурации.
//       * Расширения   - Булево - Необязательный. Обновлять кэши метаданных расширений.
//       * ОбщиеДанные       - Булево - Необязательный. Обновлять неразделенные данные.
//       * РазделенныеДанные - Булево - Необязательный. Обновлять разделенные данные.
//       * Оперативное - Булево - Необязательный. Оперативное обновление данных.
//       * Отложенное  - Булево - Необязательный. Отложенное обновление данных.
//       * Полное      - Булево - Необязательный. Не учитывать хеш-суммы при отложенном обновление данных.
//
Функция Обновить(Настройки = Неопределено) Экспорт
	Если Настройки = Неопределено Тогда
		Настройки = Новый Структура;
	КонецЕсли;

	ПоУмолчанию = Новый Структура("Конфигурация, Расширения, ОбщиеДанные, РазделенныеДанные, Оперативное, Отложенное, Полное");
	Если Настройки.Количество() < ПоУмолчанию.Количество() Тогда
		Если БазоваяПодсистемаСервер.ЭтоАвтономноеРабочееМесто() Тогда // АРМ.
			ПоУмолчанию.ОбщиеДанные       = Ложь;
			ПоУмолчанию.РазделенныеДанные = Истина;
		Иначе
			ПоУмолчанию.ОбщиеДанные       = Истина;
			ПоУмолчанию.РазделенныеДанные = Истина;
		КонецЕсли;
		ПоУмолчанию.Конфигурация = Истина;
		ПоУмолчанию.Расширения   = Истина;
		ПоУмолчанию.Оперативное  = Истина;
		ПоУмолчанию.Отложенное   = Ложь;
		ПоУмолчанию.Полное       = Ложь;
		БазоваяПодсистемаКлиентСервер.ДополнитьСтруктуру(Настройки, ПоУмолчанию, Ложь);
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("ЕстьИзменения", Ложь);

	Если Настройки.Оперативное Тогда
		Если Настройки.ОбщиеДанные Тогда
			Если Настройки.Конфигурация Тогда
				ПромежуточныйРезультат = ОперативноеОбновлениеОбщихДанных("ОбщиеДанныеКонфигурации", Неопределено);
				Результат.Вставить("Оперативное_ОбщиеДанные_Конфигурация", ПромежуточныйРезультат);
				Если ПромежуточныйРезультат <> Неопределено И ПромежуточныйРезультат.ЕстьИзменения Тогда
					Результат.ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;

			Если Настройки.Расширения Тогда
				ПромежуточныйРезультат = ОперативноеОбновлениеОбщихДанных("ОбщиеДанныеРасширений", Неопределено);
				Результат.Вставить("Оперативное_ОбщиеДанные_Расширения", ПромежуточныйРезультат);
				Если ПромежуточныйРезультат <> Неопределено И ПромежуточныйРезультат.ЕстьИзменения Тогда
					Результат.ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если Настройки.РазделенныеДанные Тогда
			Если Настройки.Конфигурация Тогда
				ПромежуточныйРезультат = ОперативноеОбновлениеРазделенныхДанных("РазделенныеДанныеКонфигурации");
				Результат.Вставить("Оперативное_РазделенныеДанные_Конфигурация", ПромежуточныйРезультат);
				Если ПромежуточныйРезультат <> Неопределено И ПромежуточныйРезультат.ЕстьИзменения Тогда
					Результат.ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;

			Если Настройки.Расширения Тогда
				ПромежуточныйРезультат = ОперативноеОбновлениеРазделенныхДанных("РазделенныеДанныеРасширений");
				Результат.Вставить("Оперативное_РазделенныеДанные_Расширения", ПромежуточныйРезультат);
				Если ПромежуточныйРезультат <> Неопределено И ПромежуточныйРезультат.ЕстьИзменения Тогда
					Результат.ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Настройки.Отложенное Тогда
		Если Настройки.ОбщиеДанные Тогда
			Если Настройки.Конфигурация Тогда
				ПромежуточныйРезультат = ОтложенноеОбновлениеДанных("ОбщиеДанныеКонфигурации", Настройки.Полное);
				Результат.Вставить("Отложенное_ОбщиеДанные_Конфигурация", ПромежуточныйРезультат);
				Если ПромежуточныйРезультат <> Неопределено И ПромежуточныйРезультат.ЕстьИзменения Тогда
					Результат.ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;

			Если Настройки.Расширения Тогда
				ПромежуточныйРезультат = ОтложенноеОбновлениеДанных("ОбщиеДанныеРасширений", Настройки.Полное);
				Результат.Вставить("Отложенное_ОбщиеДанные_Расширения", ПромежуточныйРезультат);
				Если ПромежуточныйРезультат <> Неопределено И ПромежуточныйРезультат.ЕстьИзменения Тогда
					Результат.ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если Настройки.РазделенныеДанные Тогда
			Если Настройки.Конфигурация Тогда
				ПромежуточныйРезультат = ОтложенноеОбновлениеДанных("РазделенныеДанныеКонфигурации", Настройки.Полное);
				Результат.Вставить("Отложенное_РазделенныеДанные_Конфигурация", ПромежуточныйРезультат);
				Если ПромежуточныйРезультат <> Неопределено И ПромежуточныйРезультат.ЕстьИзменения Тогда
					Результат.ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;

			Если Настройки.Расширения Тогда
				ПромежуточныйРезультат = ОтложенноеОбновлениеДанных("РазделенныеДанныеРасширений", Настройки.Полное);
				Результат.Вставить("Отложенное_РазделенныеДанные_Расширения", ПромежуточныйРезультат);
				Если ПромежуточныйРезультат <> Неопределено И ПромежуточныйРезультат.ЕстьИзменения Тогда
					Результат.ЕстьИзменения = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;
КонецФункции

// Актуализирует кэш метаданных конфигурации/подключенных расширений.
Функция ОперативноеОбновлениеОбщихДанных(Режим, РазделенныеОбработчики)
	////////////////////////////////////////////////////////////////////////////////
	// Выполняется только для предопределенных вариантов отчетов.
	// План обновления:

	ТаблицаЗамеров = Новый ТаблицаЗначений;
	ТаблицаЗамеров.Колонки.Добавить("СтароеИмя",				Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТаблицаЗамеров.Колонки.Добавить("АктуальноеИмя",			Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));
	ТаблицаЗамеров.Колонки.Добавить("АктуальноеНаименование",	Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(150)));

	Кэш = Новый Структура;
	Кэш.Вставить("Режим",					Режим);
	Кэш.Вставить("ОбновлятьКонфигурацию",	Режим = "ОбщиеДанныеКонфигурации");
	Кэш.Вставить("ОбновлятьРасширения",		Режим = "ОбщиеДанныеРасширений");
	Кэш.Вставить("РазделенныеОбработчики",	РазделенныеОбработчики);
	Кэш.Вставить("ЕстьИзменения",			Ложь);
	Кэш.Вставить("ЕстьВажныеИзменения",		Ложь);
	Кэш.Вставить("ДеревоВариантов",			ДеревоПредопределенных(?(Кэш.ОбновлятьКонфигурацию, "Внутренний", "Расширение")));
	Кэш.Вставить("ОбновлятьЗамеры",			Ложь); // зарезервировано для новых подсистем
	Кэш.Вставить("ТаблицаЗамеров",			ТаблицаЗамеров);
	Кэш.Вставить("Уточнение",				?(Кэш.Режим = "ОбщиеДанныеКонфигурации", "метаданные конфигурации", "метаданные расширений"));

	// План обновления:

	////////////////////////////////////////////////////////////////////////////////
	// 1. Заменить устаревшие ключи вариантов отчетов на актуальные.
	АктуализироватьКлючиПредопределенных(Кэш);

	////////////////////////////////////////////////////////////////////////////////
	// 2. Актуализировать предопределенные варианты отчетов и перезаписать
	//    константу, в которой хранятся привязки к функциональным опциям.
	ОбновитьНастройкиПредопределенных(Кэш);

	////////////////////////////////////////////////////////////////////////////////
	// 3. Установить пометку удаления вариантов удаленных отчетов.
	ПометитьНаУдалениеВариантыУдаленныхОтчетов(Кэш);

	////////////////////////////////////////////////////////////////////////////////
	// 4. Зарегистрировать ключевые операции.
	Если Кэш.ОбновлятьЗамеры Тогда
		// зарезервировано для новых подсистем
	КонецЕсли;

	////////////////////////////////////////////////////////////////////////////////
	// 5. Записать параметры в регистр.
	ЗаписатьПараметрыВариантовОтчетов(Кэш);

	////////////////////////////////////////////////////////////////////////////////
	// 6. Записать срез ключей вариантов отчетов расширений в регистр.
	ЗафиксироватьТекущуюВерсиюРасширений(Кэш);

	// Для платформы (очистка коллекции вручную для освобождение памяти от цикличных ссылок).
	Кэш.ДеревоВариантов.Колонки.Очистить();
	Кэш.ДеревоВариантов.Строки.Очистить();

	Возврат Кэш;
КонецФункции

// Актуализирует данные справочника ВариантыОтчетов.
Функция ОперативноеОбновлениеРазделенныхДанных(Режим)
	Кэш = Новый Структура;
	Кэш.Вставить("Режим",               Режим);
	Кэш.Вставить("ЕстьИзменения",       Ложь);
	Кэш.Вставить("ЕстьВажныеИзменения", Ложь);
	Кэш.Вставить("Уточнение",			НРег(ВариантыОтчетовКлиентСервер.ИмяВПредставление(Режим)));

	////////////////////////////////////////////////////////////////////////////////
	// План обновления:

	////////////////////////////////////////////////////////////////////////////////
	// 1. Актуализировать разделенные варианты отчетов.
	АктуализироватьСоставОбласти(Кэш);

	////////////////////////////////////////////////////////////////////////////////
	// 2. Установить пометку удаления вариантов удаленных отчетов.
	ПометитьНаУдалениеВариантыУдаленныхОтчетов(Кэш);

	Возврат Кэш;
КонецФункции

// Обновление индекса поиска предопределенных вариантов отчетов.
Функция ОтложенноеОбновлениеДанных(Режим, Полное)
	Кэш = Новый Структура;
	Кэш.Вставить("Режим",               Режим);
	Кэш.Вставить("ЕстьИзменения",       Ложь);
	Кэш.Вставить("ЕстьВажныеИзменения", Ложь);
	Кэш.Вставить("ОбщиеДанные",			Режим = "ОбщиеДанныеКонфигурации" Или Режим = "ОбщиеДанныеРасширений");
	Кэш.Вставить("Полное",				Полное);
	Кэш.Вставить("Уточнение",			НРег(ВариантыОтчетовКлиентСервер.ИмяВПредставление(Режим)));
	Кэш.Уточнение = Кэш.Уточнение + ", " + ?(Полное, "полное", "по изменениям");

	// План обновления:

	////////////////////////////////////////////////////////////////////////////////
	// 1. Обновить индекс поиска отчетов.
	ОбновитьИндексПоиска(Кэш);

	Возврат Кэш;
КонецФункции

// Формирует дерево настроек и размещения предопределенных вариантов отчетов.
//   Только для отчетов, подключенных к подсистеме.
//
// Возвращаемое значение:
//   ДеревоЗначений - Настройки предопределенных вариантов отчетов, подключенных к подсистеме.
//
//     Реквизиты для изменения:
//       * Включен              - Булево - Если Ложь, то вариант отчета не регистрируется в подсистеме.
//       * ВидимостьПоУмолчанию - Булево - Если Ложь, то вариант отчета по умолчанию скрыт в панели отчетов.
//       * Наименование         - Строка - Наименование варианта отчета.
//       * Описание             - Строка - Информация о варианте отчета.
//       * Размещение           - Соответствие - Настройки размещения варианта отчета в разделах.
//           ** Ключ     - ОбъектМетаданных - Подсистема, в которой размещается отчет или вариант отчета.
//           ** Значение - Строка           - Настройки размещения в подсистеме (группе).
//               ""        - Вывод отчета в подсистеме без специального выделение.
//               "Важный"  - Вывод отчета в подсистеме с выделением жирным шрифтом.
//               "СмТакже" - Вывод отчета в группе "См. также".
//       * ФункциональныеОпции - Массив из Строка - Имена функциональных опций варианта отчета.
//       * НастройкиДляПоиска  - Структура - Дополнительные настройки для поиска этого варианта отчета.
//           Эти настройки необходимо задавать только если СКД не используется или используется не в полном объеме.
//           Например, СКД может использоваться только для параметризации и получения данных,
//           а вывод выполняться в фиксированный макет табличного документа.
//           ** НаименованияПолей - Строка - Имена полей варианта отчета.
//           ** НаименованияПараметровИОтборов - Строка - Имена настроек варианта отчета.
//           ** КлючевыеСлова - Строка - Дополнительная терминология (в т.ч. специализированная или устаревшая).
//           Разделитель терминов: Символы.ПС.
//           ** ИменаМакетов - Строка - Используется вместо НаименованияПолей.
//               Имена макетов табличных или текстовых документов,
//               из которых требуется извлечь информацию о наименованиях полей.
//               Имена перечисляются через запятую.
//               К сожалению, в макетах отсутствует информация о связях полей и их представлений (которая есть в СКД),
//               поэтому для более точной работы механизма поиска рекомендуется заполнять НаименованияПолей, а не
//               ИменаМакетов.
//       * ФорматНастроекСКД - Булево - Отчет использует типовой формат хранения настроек на механике СКД,
//           а его основные формы поддерживают стандартную схему взаимодействия между формами (параметры и тип
//           возвращаемого значения).
//           Если Ложь, тогда для отчета отключаются проверки консистентности и некоторые механизмы, которые
//           рассчитывают на типовой формат.
//       * ОпределитьНастройкиФормы - Булево - Отчет имеет программный интерфейс для тесной интеграции с формой отчета,
//           в том числе может переопределять некоторые настройки формы и подписываться на ее события.
//           Если Истина и отчет подключен к общей форме ФормаОтчета,
//           тогда в модуле объекта отчета следует определить процедуру по шаблону:
//
//               // Настройки общей формы отчета подсистемы "Варианты отчетов".
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//               //       Неопределено когда вызов без контекста.
//               //   КлючВарианта - Строка, Неопределено - Имя предопределенного
//               //       или уникальный идентификатор пользовательского варианта отчета.
//               //       Неопределено когда вызов без контекста.
//               //   Настройки - Структура - см. возвращаемое значение
//               //       ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//               //
//               Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
//               	// Код процедуры.
//               КонецПроцедуры
//
//     Служебные реквизиты (только для чтения):
//       * Отчет               - <см. Справочники.ВариантыОтчетов.Реквизиты.Отчет> - Полное имя или ссылка на отчет.
//       * Метаданные          - ОбъектМетаданных: Отчет - Метаданные отчета.
//       * КлючВарианта        - Строка - Имя варианта отчета.
//       * ОписаниеПолучено    - Булево - Флажок что описание строки уже получено.
//           Описание получается методом ОписаниеВарианта().
//       * СистемнаяИнформация - Структура - Другая служебная информация.
//
Функция ДеревоПредопределенных(ФильтрПоТипуОтчетов = "Внутренний") Экспорт
	РеквизитыСправочника = Метаданные.Справочники.ВариантыОтчетов.Реквизиты;

	ДеревоВариантов = Новый ДеревоЗначений;
	ДеревоВариантов.Колонки.Добавить("Отчет",                РеквизитыСправочника.Отчет.Тип);
	ДеревоВариантов.Колонки.Добавить("Метаданные",           Новый ОписаниеТипов("ОбъектМетаданных"));
	ДеревоВариантов.Колонки.Добавить("ИспользуетСКД",        Новый ОписаниеТипов("Булево"));
	ДеревоВариантов.Колонки.Добавить("КлючВарианта",         РеквизитыСправочника.КлючВарианта.Тип);
	ДеревоВариантов.Колонки.Добавить("ОписаниеПолучено",     Новый ОписаниеТипов("Булево"));
	ДеревоВариантов.Колонки.Добавить("Включен",              Новый ОписаниеТипов("Булево"));
	ДеревоВариантов.Колонки.Добавить("ВидимостьПоУмолчанию", Новый ОписаниеТипов("Булево"));
	ДеревоВариантов.Колонки.Добавить("Наименование",         Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
	ДеревоВариантов.Колонки.Добавить("Описание",             Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
	ДеревоВариантов.Колонки.Добавить("Размещение",           Новый ОписаниеТипов("Соответствие"));
	ДеревоВариантов.Колонки.Добавить("НастройкиДляПоиска",   Новый ОписаниеТипов("Структура"));
	ДеревоВариантов.Колонки.Добавить("СистемнаяИнформация",  Новый ОписаниеТипов("Структура"));
	ДеревоВариантов.Колонки.Добавить("Тип",                  Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
	ДеревоВариантов.Колонки.Добавить("ЭтоВариант",           Новый ОписаниеТипов("Булево"));
	ДеревоВариантов.Колонки.Добавить("ФункциональныеОпции",  Новый ОписаниеТипов("Массив"));
	ДеревоВариантов.Колонки.Добавить("ГруппироватьПоОтчету", Новый ОписаниеТипов("Булево"));
	ДеревоВариантов.Колонки.Добавить("КлючЗамеров",          Новый ОписаниеТипов("Строка"));
	ДеревоВариантов.Колонки.Добавить("ОсновнойВариант");
	ДеревоВариантов.Колонки.Добавить("ФорматНастроекСКД",        Новый ОписаниеТипов("Булево"));
	ДеревоВариантов.Колонки.Добавить("ОпределитьНастройкиФормы", Новый ОписаниеТипов("Булево"));

	ГруппироватьПоОтчетам	= ГлобальныеНастройки().ВыводитьОтчетыВместоВариантов;
	РазрешеноИндексирование = Истина;
	// зарезервировано для новых подсистем

	ПодсистемыОтчетов		= РазмещениеОтчетовВПодсистемах();
	КэшФлажкаХранилища		= Неопределено;
	КэшФлажкаОсновнойФормы	= Неопределено;
	КэшФлажкаФормыНастроек	= Неопределено;
	Для Каждого ОтчетМетаданные Из Метаданные.Отчеты Цикл
		Если Не ОтчетПодключенКХранилищу(ОтчетМетаданные, КэшФлажкаХранилища) Тогда
			Продолжить;
		КонецЕсли;

		ОтчетСсылка	= Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(ОтчетМетаданные);
		ОтчетТип	= ВариантыОтчетовКлиентСервер.ТипОтчета(ОтчетСсылка, Истина);
		Если ФильтрПоТипуОтчетов <> Неопределено И ФильтрПоТипуОтчетов <> ОтчетТип Тогда
			Продолжить;
		КонецЕсли;

		ЕстьРеквизиты = (ОтчетМетаданные.Реквизиты.Количество() > 0);

		// Настройки.
		СтрокаОтчет							= ДеревоВариантов.Строки.Добавить();
		СтрокаОтчет.Отчет					= ОтчетСсылка;
		СтрокаОтчет.Метаданные				= ОтчетМетаданные;
		СтрокаОтчет.Включен					= Истина;
		СтрокаОтчет.ВидимостьПоУмолчанию	= Истина;
		СтрокаОтчет.Описание				= ОтчетМетаданные.Пояснение;
		СтрокаОтчет.Наименование			= ОтчетМетаданные.Представление();
		СтрокаОтчет.ОписаниеПолучено		= Истина;
		СтрокаОтчет.Тип						= ОтчетТип;
		СтрокаОтчет.ЭтоВариант				= Ложь;
		СтрокаОтчет.ГруппироватьПоОтчету	= ГруппироватьПоОтчетам;
		СтрокаОтчет.ИспользуетСКД			= (ОтчетМетаданные.ОсновнаяСхемаКомпоновкиДанных <> Неопределено);
		СтрокаОтчет.ФорматНастроекСКД		= СтрокаОтчет.ИспользуетСКД И Не ЕстьРеквизиты;

		// Подсистемы.
		Найденные = ПодсистемыОтчетов.НайтиСтроки(Новый Структура("ОтчетМетаданные", ОтчетМетаданные));
		Для Каждого СтрокаПодсистема Из Найденные Цикл
			СтрокаОтчет.Размещение.Вставить(СтрокаПодсистема.ПодсистемаМетаданные, "");
		КонецЦикла;

		// Поиск.
		СтрокаОтчет.НастройкиДляПоиска = Новый Структура("НаименованияПолей, НаименованияПараметровИОтборов, КлючевыеСлова, ИменаМакетов");

		// Предопределенные варианты.
		Если СтрокаОтчет.ИспользуетСКД Тогда
			ОтчетМенеджер		= Отчеты[ОтчетМетаданные.Имя];
			СхемаКД				= Неопределено;
			ВариантыНастроек	= Неопределено;
			Попытка
				СхемаКД = ОтчетМенеджер.ПолучитьМакет(ОтчетМетаданные.ОсновнаяСхемаКомпоновкиДанных.Имя);
			Исключение
				ТекстОшибки = "Не удалось прочитать схему отчета:";
				ТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Предупреждение, ТекстОшибки, ОтчетМетаданные);
			КонецПопытки;
			// Чтение настроек вариантов отчета из схемы.
			Если СхемаКД <> Неопределено Тогда
				Попытка
					ВариантыНастроек = СхемаКД.ВариантыНастроек;
				Исключение
					ТекстОшибки = "Не удалось прочитать список вариантов отчета:";
					ТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Предупреждение, ТекстОшибки, ОтчетМетаданные);
				КонецПопытки;
			КонецЕсли;
			// Чтение настроек вариантов отчета из модуля менеджера (если не получилось из схемы).
			Если ВариантыНастроек = Неопределено Тогда
				Попытка
					ВариантыНастроек = ОтчетМенеджер.ВариантыНастроек();
				Исключение
					ТекстОшибки = "Не удалось прочитать список вариантов отчета из модуля менеджера:";
					ТекстОшибки = ТекстОшибки + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки, ОтчетМетаданные);
				КонецПопытки;
			КонецЕсли;
			// Регистрация найденных вариантов.
			Если ВариантыНастроек <> Неопределено Тогда
				Для Каждого ВариантНастроекКД Из ВариантыНастроек Цикл
					Вариант					= СтрокаОтчет.Строки.Добавить();
					Вариант.Отчет			= СтрокаОтчет.Отчет;
					Вариант.КлючВарианта	= ВариантНастроекКД.Имя;
					Вариант.Наименование	= ВариантНастроекКД.Представление;
					Вариант.Тип				= ОтчетТип;
					Вариант.ЭтоВариант		= Истина;
					Если СтрокаОтчет.ОсновнойВариант = Неопределено Тогда
						СтрокаОтчет.ОсновнойВариант = Вариант;
					КонецЕсли;
					Если РазрешеноИндексирование И ТипЗнч(ВариантНастроекКД) = Тип("ВариантНастроекКомпоновкиДанных") Тогда
						Попытка
							Вариант.СистемнаяИнформация.Вставить("НастройкиКД", ВариантНастроекКД.Настройки);
						Исключение
							ТекстОшибки = СтрШаблон("Не удалось прочитать настройки варианта ""%1"":",
								Вариант.КлючВарианта)
								+ Символы.ПС
								+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
							ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Предупреждение, ТекстОшибки, ОтчетМетаданные);
						КонецПопытки;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

		// Сам отчет.
		Если СтрокаОтчет.ОсновнойВариант = Неопределено Тогда
			Вариант						= СтрокаОтчет.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(Вариант, СтрокаОтчет, "Отчет, Наименование");
			Вариант.КлючВарианта 		= "";
			Вариант.ЭтоВариант			= Истина;
			СтрокаОтчет.ОсновнойВариант = Вариант;
		КонецЕсли;

		// зарезервировано для новых подсистем
	КонецЦикла;

	// Механизмы расширения.
	Если ФильтрПоТипуОтчетов = Неопределено Или ФильтрПоТипуОтчетов = "Внутренний" Тогда
		НастройкиОтчета = ОписаниеОтчета(ДеревоВариантов, Метаданные.Отчеты.УниверсальныйОтчет);
		Метаданные.Отчеты.УниверсальныйОтчет.НастроитьВариантыОтчета(ДеревоВариантов, НастройкиОтчета);

		// Подключаемые обработчики подсистем БСП.
		ИнтеграцияПодсистемСервер.ПриНастройкеВариантовОтчетов(ДеревоВариантов);
	КонецЕсли;

	// Определение основных вариантов.
	Для Каждого СтрокаОтчет Из ДеревоВариантов.Строки Цикл
		Если СтрокаОтчет.ГруппироватьПоОтчету = Истина Тогда
			Если СтрокаОтчет.ОсновнойВариант = Неопределено Или Не СтрокаОтчет.ОсновнойВариант.Включен Тогда
				Для Каждого Вариант Из СтрокаОтчет.Строки Цикл
					ЗаполнитьОписаниеСтрокиВарианта(Вариант, СтрокаОтчет);
					Если Вариант.Включен Тогда
						СтрокаОтчет.ОсновнойВариант		= Вариант;
						Вариант.ВидимостьПоУмолчанию	= Истина;

						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			СтрокаОтчет.ОсновнойВариант = Неопределено;
		КонецЕсли;
	КонецЦикла;

	Возврат ДеревоВариантов;
КонецФункции

// Замена старых ключей вариантов отчетов на актуальные.
Процедура АктуализироватьКлючиПредопределенных(Кэш)
	ПредставлениеПроцедуры = СтрШаблон("Обновление ключей вариантов отчетов (%1)", Кэш.Уточнение);
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	// Составить таблицу замен старых ключей вариантов на актуальные.
	Изменения = ИзмененияКлючей();

	// Получить ссылки вариантов отчетов для замены ключей,
	//   исключив из списка замен те варианты отчетов,
	//   актуальные ключи которых уже зарегистрированы,
	//   или старые ключи которых уже не заняты.
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	Изменения.Отчет КАК Отчет,
	            	  |	Изменения.СтароеИмяВарианта КАК СтароеИмяВарианта,
	            	  |	Изменения.АктуальноеИмяВарианта КАК АктуальноеИмяВарианта
	            	  |ПОМЕСТИТЬ втИзменения
	            	  |ИЗ
	            	  |	&Изменения КАК Изменения
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ РАЗЛИЧНЫЕ
	            	  |	втИзменения.Отчет КАК Отчет,
	            	  |	втИзменения.АктуальноеИмяВарианта КАК АктуальноеИмяВарианта,
	            	  |	ВариантыОтчетовСтарые.Ссылка КАК Ссылка
	            	  |ИЗ
	            	  |	втИзменения КАК втИзменения
	            	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов КАК ВариантыОтчетовАктуальные
	            	  |		ПО втИзменения.Отчет = ВариантыОтчетовАктуальные.Отчет
	            	  |			И втИзменения.АктуальноеИмяВарианта = ВариантыОтчетовАктуальные.КлючВарианта
	            	  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов КАК ВариантыОтчетовСтарые
	            	  |		ПО втИзменения.Отчет = ВариантыОтчетовСтарые.Отчет
	            	  |			И втИзменения.СтароеИмяВарианта = ВариантыОтчетовСтарые.КлючВарианта
	            	  |ГДЕ
	            	  |	ВариантыОтчетовАктуальные.Ссылка ЕСТЬ NULL
	            	  |	И НЕ ВариантыОтчетовСтарые.Ссылка ЕСТЬ NULL";

	Если Кэш.Режим = "ОбщиеДанныеРасширений" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ПредопределенныеВариантыОтчетов", ".ПредопределенныеВариантыОтчетовРасширений");
	КонецЕсли;

	Запрос.УстановитьПараметр("Изменения", Изменения);

	// Заменить старые имена вариантов на актуальные.
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Кэш.ЕстьИзменения			= Истина;
		Кэш.ЕстьВажныеИзменения		= Истина;
		ВариантОбъект				= Выборка.Ссылка.ПолучитьОбъект();
		ВариантОбъект.КлючВарианта	= Выборка.АктуальноеИмяВарианта;
		ВариантОбъект.ДополнительныеСвойства.Вставить("ЗаполнениеПредопределенных");
		ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);
	КонецЦикла;

	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Завершение процедуры ""%1"".", ПредставлениеПроцедуры));
КонецПроцедуры

// Актуализация предопределенных вариантов отчетов.
Процедура ОбновитьНастройкиПредопределенных(Кэш)
	ПредставлениеПроцедуры = СтрШаблон("Обновление настроек предопределенных (%1)", Кэш.Уточнение);
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	РеквизитыВариантов = Метаданные.Справочники.ВариантыОтчетов.Реквизиты;

	ТаблицаФункциональныхОпций = Новый ТаблицаЗначений;
	ТаблицаФункциональныхОпций.Колонки.Добавить("Отчет",                   РеквизитыВариантов.Отчет.Тип);
	ТаблицаФункциональныхОпций.Колонки.Добавить("ПредопределенныйВариант", РеквизитыВариантов.ПредопределенныйВариант.Тип);
	ТаблицаФункциональныхОпций.Колонки.Добавить("ИмяФункциональнойОпции",  Новый ОписаниеТипов("Строка"));

	Кэш.Вставить("ТаблицаФункциональныхОпций", ТаблицаФункциональныхОпций);

	ОтчетыСНастройкамиСписок = Новый СписокЗначений;
	Кэш.Вставить("ОтчетыСНастройкамиСписок", ОтчетыСНастройкамиСписок);

	Кэш.ДеревоВариантов.Колонки.Добавить("НайденВБазеДанных",	Новый ОписаниеТипов("Булево"));
	Кэш.ДеревоВариантов.Колонки.Добавить("ВариантИзБазы",		Новый ОписаниеТипов("СтрокаТаблицыЗначений"));

	Если Кэш.Режим = "ОбщиеДанныеКонфигурации" Тогда
		Кэш.ДеревоВариантов.Колонки.Добавить("ВариантРодитель", Новый ОписаниеТипов("СправочникСсылка.ПредопределенныеВариантыОтчетов"));
		ТекстЗапроса = "ВЫБРАТЬ * ИЗ Справочник.ПредопределенныеВариантыОтчетов УПОРЯДОЧИТЬ ПО ПометкаУдаления";
		ПустаяСсылка = Справочники.ПредопределенныеВариантыОтчетов.ПустаяСсылка();
	ИначеЕсли Кэш.Режим = "ОбщиеДанныеРасширений" Тогда
		Кэш.ДеревоВариантов.Колонки.Добавить("ВариантРодитель", Новый ОписаниеТипов("СправочникСсылка.ПредопределенныеВариантыОтчетовРасширений"));
		ТекстЗапроса = "ВЫБРАТЬ * ИЗ Справочник.ПредопределенныеВариантыОтчетовРасширений УПОРЯДОЧИТЬ ПО ПометкаУдаления";
		ПустаяСсылка = Справочники.ПредопределенныеВариантыОтчетовРасширений.ПустаяСсылка();
	КонецЕсли;

	// Сопоставление информации из базы и из метаданных и пометка на удаление устаревших объектов из базы.
	ПоискВарианта					= Новый Структура("Отчет, КлючВарианта, НайденВБазеДанных, ЭтоВариант");
	ПоискВарианта.НайденВБазеДанных = Ложь;
	ПоискВарианта.ЭтоВариант        = Истина;
	Запрос			= Новый Запрос;
	Запрос.Текст	= ТекстЗапроса;
	ТаблицаПредопределенные = Запрос.Выполнить().Выгрузить();
	Для Каждого ВариантИзБазы Из ТаблицаПредопределенные Цикл
		ЗаполнитьЗначенияСвойств(ПоискВарианта, ВариантИзБазы, "Отчет, КлючВарианта");
		Найденные = Кэш.ДеревоВариантов.Строки.НайтиСтроки(ПоискВарианта, Истина);
		Если Найденные.Количество() = 0 Тогда
			Если ВариантИзБазы.ПометкаУдаления И ВариантИзБазы.Родитель = ПустаяСсылка Тогда
				Продолжить; // Действие не требуется.
			КонецЕсли;
			ВариантОбъект					= ВариантИзБазы.Ссылка.ПолучитьОбъект();
			ВариантОбъект.ПометкаУдаления	= Истина;
			ВариантОбъект.Родитель			= ПустаяСсылка;
			ВариантОбъект.ДополнительныеСвойства.Вставить("ЗаполнениеПредопределенных");
			ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);
			Кэш.ЕстьИзменения				= Истина;
			Кэш.ЕстьВажныеИзменения			= Истина;
		Иначе
			ОписаниеВарианта					= Найденные[0];
			ЗаполнитьОписаниеСтрокиВарианта(ОписаниеВарианта);
			ОписаниеВарианта.НайденВБазеДанных	= Истина;
			ОписаниеВарианта.ВариантИзБазы		= ВариантИзБазы;
		КонецЕсли;
	КонецЦикла;

	// Добавление/обновление информации в базе данных.
	Для Каждого ОписаниеОтчета Из Кэш.ДеревоВариантов.Строки Цикл
		ОсновнойВариантСсылка	= ПустаяСсылка;
		ОсновнойВариант			= ОписаниеОтчета.ОсновнойВариант;
		Если ТипЗнч(ОсновнойВариант) = Тип("СтрокаДереваЗначений") Тогда
			ЗаполнитьОписаниеСтрокиВарианта(ОсновнойВариант);
			ОсновнойВариант.ВариантРодитель	= ПустаяСсылка;
			ОсновнойВариантСсылка			= ОбновитьПредопределенный(Кэш, ОсновнойВариант); // Вариант без родителя.
		КонецЕсли;
		Если ОписаниеОтчета.ОпределитьНастройкиФормы Тогда
			ОтчетыСНастройкамиСписок.Добавить(ОписаниеОтчета.Отчет);
		КонецЕсли;
		Для Каждого ОписаниеВарианта Из ОписаниеОтчета.Строки Цикл
			ЗаполнитьОписаниеСтрокиВарианта(ОписаниеВарианта);
			Если ОписаниеВарианта = ОсновнойВариант Тогда
				ВариантСсылка = ОсновнойВариантСсылка;
			Иначе
				ОписаниеВарианта.ВариантРодитель = ОсновнойВариантСсылка;
				ВариантСсылка = ОбновитьПредопределенный(Кэш, ОписаниеВарианта);
			КонецЕсли;
			Для Каждого ИмяФункциональнойОпции Из ОписаниеВарианта.ФункциональныеОпции Цикл
				СвязьСФункциональнойОпцией							= ТаблицаФункциональныхОпций.Добавить();
				СвязьСФункциональнойОпцией.Отчет					= ОписаниеВарианта.Отчет;
				СвязьСФункциональнойОпцией.ПредопределенныйВариант	= ВариантСсылка;
				СвязьСФункциональнойОпцией.ИмяФункциональнойОпции	= ИмяФункциональнойОпции;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Завершение процедуры ""%1"".", ПредставлениеПроцедуры));
КонецПроцедуры

// Установка пометки удаления вариантов удаленных отчетов.
Процедура ПометитьНаУдалениеВариантыУдаленныхОтчетов(Кэш)
	ПредставлениеПроцедуры = СтрШаблон("Удаление вариантов удаленных отчетов (%1)", Кэш.Уточнение);
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ВариантыОтчетов.Ссылка КАК Ссылка
	            	  |ИЗ
	            	  |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	            	  |ГДЕ
	            	  |	ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ
	            	  |	И ВариантыОтчетов.Отчет = НЕОПРЕДЕЛЕНО
	            	  |	И ВариантыОтчетов.ТипОтчета = &ТипОтчета
	            	  |
	            	  |ОБЪЕДИНИТЬ ВСЕ
	            	  |
	            	  |ВЫБРАТЬ
	            	  |	ВариантыОтчетов.Ссылка
	            	  |ИЗ
	            	  |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	            	  |ГДЕ
	            	  |	ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ
	            	  |	И ВариантыОтчетов.Отчет ЕСТЬ NULL
	            	  |	И ВариантыОтчетов.ТипОтчета = &ТипОтчета
	            	  |
	            	  |ОБЪЕДИНИТЬ ВСЕ
	            	  |
	            	  |ВЫБРАТЬ
	            	  |	ВариантыОтчетов.Ссылка
	            	  |ИЗ
	            	  |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	            	  |ГДЕ
	            	  |	ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ
	            	  |	И ВариантыОтчетов.Отчет <> НЕОПРЕДЕЛЕНО
	            	  |	И ВариантыОтчетов.Отчет ЕСТЬ НЕ NULL
	            	  |	И ВариантыОтчетов.Отчет.ПометкаУдаления = ИСТИНА
	            	  |	И ВариантыОтчетов.ТипОтчета = &ТипОтчета";

	Если Кэш.Режим = "ОбщиеДанныеКонфигурации" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ВариантыОтчетов", ".ПредопределенныеВариантыОтчетов");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВариантыОтчетов.ТипОтчета = &ТипОтчета", "");
	ИначеЕсли Кэш.Режим = "ОбщиеДанныеРасширений" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ВариантыОтчетов", ".ПредопределенныеВариантыОтчетовРасширений");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ВариантыОтчетов.ТипОтчета = &ТипОтчета", "");
	ИначеЕсли Кэш.Режим = "РазделенныеДанныеКонфигурации" Тогда
		Запрос.УстановитьПараметр("ТипОтчета", Перечисления.ТипыОтчетов.Внутренний);
	ИначеЕсли Кэш.Режим = "РазделенныеДанныеРасширений" Тогда
		Запрос.УстановитьПараметр("ТипОтчета", Перечисления.ТипыОтчетов.Расширение);
	КонецЕсли;

	МассивСсылокВариантов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Для Каждого ВариантСсылка Из МассивСсылокВариантов Цикл
		Кэш.ЕстьИзменения				= Истина;
		Кэш.ЕстьВажныеИзменения			= Истина;
		ВариантОбъект					= ВариантСсылка.ПолучитьОбъект();
		ВариантОбъект.Заблокировать();
		ВариантОбъект.ПометкаУдаления	= Истина;
		ВариантОбъект.ДополнительныеСвойства.Вставить("ЗаполнениеПредопределенных");
		ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);
	КонецЦикла;

	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Завершение процедуры ""%1"".", ПредставлениеПроцедуры));
КонецПроцедуры

// Запись параметров вариантов отчетов в регистр.
//
// Значение параметра:
//   ХранилищеЗначения (Структура) - Кэшируемые параметры:
//       * ТаблицаФункциональныхОпций - ТаблицаЗначений - Имена опций и предопределенных вариантов отчетов.
//           ** Отчет - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Ссылка отчета.
//           ** ПредопределенныйВариант - СправочникСсылка.ПредопределенныеВариантыОтчетов - Ссылка варианта.
//           ** ИмяФункциональнойОпции - Строка - Имя ФО.
//       * ОтчетыСНастройками - Массив из СправочникСсылка.ИдентификаторыОбъектовМетаданных - Отчеты,
//           в модуле объекта которых размещены процедуры тесной интеграции с общей формой отчета.
//
Процедура ЗаписатьПараметрыВариантовОтчетов(Кэш)
	Если Кэш.Режим = "ОбщиеДанныеРасширений" И Не ЗначениеЗаполнено(ПараметрыСеанса.ВерсияРасширений) Тогда
		Возврат; // Обновление не требуется.
	КонецЕсли;
	ПредставлениеПроцедуры = "Запись неразделенного кэша в регистр";
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	Кэш.ТаблицаФункциональныхОпций.Сортировать("Отчет, ПредопределенныйВариант, ИмяФункциональнойОпции");
	Кэш.ОтчетыСНастройкамиСписок.СортироватьПоЗначению();

	НовоеЗначение = Новый Структура;
	НовоеЗначение.Вставить("ТаблицаФункциональныхОпций",	Кэш.ТаблицаФункциональныхОпций);
	НовоеЗначение.Вставить("ОтчетыСНастройками",			Кэш.ОтчетыСНастройкамиСписок.ВыгрузитьЗначения());

	ПолноеИмяПодсистемы = "СтандартныеПодсистемы.ВариантыОтчетов";

	Если Кэш.Режим = "ОбщиеДанныеКонфигурации" Тогда
		СтароеЗначение = РегистрыСведений.ПараметрыРаботыПрограммы.ПараметрРаботыПрограммы(ПолноеИмяПодсистемы);
		Если БазоваяПодсистемаСервер.ЗначениеВСтрокуXML(НовоеЗначение) <> БазоваяПодсистемаСервер.ЗначениеВСтрокуXML(СтароеЗначение) Тогда
			РегистрыСведений.ПараметрыРаботыПрограммы.УстановитьПараметрРаботыПрограммы(ПолноеИмяПодсистемы, НовоеЗначение);
		КонецЕсли;
	ИначеЕсли Кэш.Режим = "ОбщиеДанныеРасширений" Тогда
		РегистрыСведений.ПараметрыРаботыВерсийРасширений.УстановитьПараметрРаботыРасширения(ПолноеИмяПодсистемы, НовоеЗначение, Ложь);
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Завершение процедуры ""%1"".", ПредставлениеПроцедуры));
КонецПроцедуры

// Запись регистра ПредопределенныеВариантыОтчетовВерсийРасширений.
//
// Сохраняемое значение:
//   ХранилищеЗначения (Структура) - Кэшируемые параметры:
//       * ТаблицаФункциональныхОпций - ТаблицаЗначений - Имена опций и предопределенных вариантов отчетов.
//           ** Отчет - СправочникСсылка.ИдентификаторыОбъектовРасширений - Ссылка отчета.
//           ** ПредопределенныйВариант - СправочникСсылка.ПредопределенныеВариантыОтчетовРасширений - Ссылка варианта.
//           ** ИмяФункциональнойОпции - Строка - Имя ФО.
//       * ОтчетыСНастройками - Массив из СправочникСсылка.ИдентификаторыОбъектовРасширений - Отчеты,
//           в модуле объекта которых размещены процедуры тесной интеграции с общей формой отчета.
//
Процедура ЗафиксироватьТекущуюВерсиюРасширений(Кэш)
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.ВерсияРасширений) Тогда
		Возврат; // Обновление не требуется.
	КонецЕсли;

	ПредставлениеПроцедуры = "Запись регистра версий расширений";
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ПредопределенныеРасширений.Ссылка КАК Вариант,
	            	  |	ПредопределенныеРасширений.Отчет КАК Отчет,
	            	  |	ПредопределенныеРасширений.КлючВарианта КАК КлючВарианта
	            	  |ИЗ
	            	  |	Справочник.ПредопределенныеВариантыОтчетовРасширений КАК ПредопределенныеРасширений
	            	  |ГДЕ
	            	  |	ПредопределенныеРасширений.ПометкаУдаления = ЛОЖЬ";

	Таблица		= Запрос.Выполнить().Выгрузить();
	Измерения	= Новый Структура("ВерсияРасширений", ПараметрыСеанса.ВерсияРасширений);
	Ресурсы		= Новый Структура;
	Набор		= РегистрыСведений.ПредопределенныеВариантыОтчетовВерсийРасширений.Набор(Таблица, Измерения, Ресурсы, Истина);
	ОбновлениеИБСервер.ЗаписатьНаборЗаписей(Набор, Истина);

	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Завершение процедуры ""%1"".", ПредставлениеПроцедуры));
КонецПроцедуры

// Приводит разделенные данные в соответствие с неразделенными данными.
Процедура АктуализироватьСоставОбласти(Кэш)
	ПредставлениеПроцедуры = СтрШаблон("Обновление вариантов отчетов (%1)", Кэш.Уточнение);
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	// Обновление сведений предопределенных вариантов.
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ПредопределенныеКонфигурации.Ссылка КАК ПредопределенныйВариант,
	            	  |	ПредопределенныеКонфигурации.Наименование КАК Наименование,
	            	  |	ПредопределенныеКонфигурации.Отчет КАК Отчет,
	            	  |	ПредопределенныеКонфигурации.ГруппироватьПоОтчету КАК ГруппироватьПоОтчету,
	            	  |	ПредопределенныеКонфигурации.КлючВарианта КАК КлючВарианта,
	            	  |	ПредопределенныеКонфигурации.ВидимостьПоУмолчанию КАК ВидимостьПоУмолчанию,
	            	  |	ПредопределенныеКонфигурации.Родитель КАК Родитель
	            	  |ПОМЕСТИТЬ втПредопределенные
	            	  |ИЗ
	            	  |	Справочник.ПредопределенныеВариантыОтчетов КАК ПредопределенныеКонфигурации
	            	  |ГДЕ
	            	  |	ПредопределенныеКонфигурации.ПометкаУдаления = ЛОЖЬ
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ
	            	  |	ВариантыОтчетов.Ссылка КАК Ссылка,
	            	  |	ВариантыОтчетов.ПометкаУдаления КАК ПометкаУдаления,
	            	  |	ВариантыОтчетов.Отчет КАК Отчет,
	            	  |	ВариантыОтчетов.ТипОтчета КАК ТипОтчета,
	            	  |	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
	            	  |	ВариантыОтчетов.Наименование КАК Наименование,
	            	  |	ВариантыОтчетов.ПредопределенныйВариант КАК ПредопределенныйВариант,
	            	  |	ВариантыОтчетов.ВидимостьПоУмолчанию КАК ВидимостьПоУмолчанию,
	            	  |	ВариантыОтчетов.Родитель КАК Родитель,
	            	  |	ВариантыОтчетов.ВидимостьПоУмолчаниюПереопределена КАК ВидимостьПоУмолчаниюПереопределена
	            	  |ПОМЕСТИТЬ втВариантыОтчетов
	            	  |ИЗ
	            	  |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	            	  |ГДЕ
	            	  |	НЕ(НЕ ВариантыОтчетов.ТипОтчета = &ТипОтчета
	            	  |				И НЕ ТИПЗНАЧЕНИЯ(ВариантыОтчетов.Отчет) = &ТипРеквизитаОтчет)
	            	  |	И ВариантыОтчетов.Пользовательский = ЛОЖЬ
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ
	            	  |	ВЫБОР
	            	  |		КОГДА втПредопределенные.ПредопределенныйВариант ЕСТЬ NULL
	            	  |			ТОГДА ИСТИНА
	            	  |		ИНАЧЕ ЛОЖЬ
	            	  |	КОНЕЦ КАК УстановитьПометкуУдаления,
	            	  |	ВЫБОР
	            	  |		КОГДА втВариантыОтчетов.Ссылка ЕСТЬ NULL
	            	  |			ТОГДА ИСТИНА
	            	  |		ИНАЧЕ ЛОЖЬ
	            	  |	КОНЕЦ КАК СоздатьНовый,
	            	  |	втПредопределенные.ПредопределенныйВариант КАК ПредопределенныйВариант,
	            	  |	втПредопределенные.Наименование КАК Наименование,
	            	  |	втПредопределенные.Отчет КАК Отчет,
	            	  |	втПредопределенные.КлючВарианта КАК КлючВарианта,
	            	  |	втПредопределенные.ГруппироватьПоОтчету КАК ГруппироватьПоОтчету,
	            	  |	ВЫБОР
	            	  |		КОГДА втПредопределенные.Родитель = &ПустаяСсылкаВарианта
	            	  |			ТОГДА НЕОПРЕДЕЛЕНО
	            	  |		ИНАЧЕ втПредопределенные.Родитель
	            	  |	КОНЕЦ КАК ПредопределенныйВариантРодитель,
	            	  |	ВЫБОР
	            	  |		КОГДА втВариантыОтчетов.ВидимостьПоУмолчаниюПереопределена
	            	  |			ТОГДА втВариантыОтчетов.ВидимостьПоУмолчанию
	            	  |		ИНАЧЕ втВариантыОтчетов.ВидимостьПоУмолчанию
	            	  |	КОНЕЦ КАК ВидимостьПоУмолчанию,
	            	  |	втВариантыОтчетов.Ссылка КАК РеквизитСсылка,
	            	  |	втВариантыОтчетов.Родитель КАК РеквизитРодитель,
	            	  |	втВариантыОтчетов.Отчет КАК РеквизитОтчет,
	            	  |	втВариантыОтчетов.КлючВарианта КАК РеквизитКлючВарианта,
	            	  |	втВариантыОтчетов.Наименование КАК РеквизитНаименование,
	            	  |	втВариантыОтчетов.ПредопределенныйВариант КАК РеквизитПредопределенныйВариант,
	            	  |	втВариантыОтчетов.ПометкаУдаления КАК РеквизитПометкаУдаления,
	            	  |	втВариантыОтчетов.ВидимостьПоУмолчанию КАК РеквизитВидимостьПоУмолчанию
	            	  |ИЗ
	            	  |	втВариантыОтчетов КАК втВариантыОтчетов
	            	  |		ПОЛНОЕ СОЕДИНЕНИЕ втПредопределенные КАК втПредопределенные
	            	  |		ПО втВариантыОтчетов.ПредопределенныйВариант = втПредопределенные.ПредопределенныйВариант";

	Если Кэш.Режим = "РазделенныеДанныеКонфигурации" Тогда
		Запрос.УстановитьПараметр("ТипОтчета",				Перечисления.ТипыОтчетов.Внутренний);
		Запрос.УстановитьПараметр("ТипРеквизитаОтчет",		Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных"));
		Запрос.УстановитьПараметр("ПустаяСсылкаВарианта",	Справочники.ПредопределенныеВариантыОтчетов.ПустаяСсылка());
	ИначеЕсли Кэш.Режим = "РазделенныеДанныеРасширений" Тогда
		Запрос.УстановитьПараметр("ТипОтчета",				Перечисления.ТипыОтчетов.Расширение);
		Запрос.УстановитьПараметр("ТипРеквизитаОтчет",		Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений"));
		Запрос.УстановитьПараметр("ПустаяСсылкаВарианта",	Справочники.ПредопределенныеВариантыОтчетовРасширений.ПустаяСсылка());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ПредопределенныеВариантыОтчетов", ".ПредопределенныеВариантыОтчетовРасширений");
	КонецЕсли;

	Кэш.Вставить("ПустаяСсылка",					Справочники.ВариантыОтчетов.ПустаяСсылка());
	Кэш.Вставить("ПоискРодителей",					Новый Соответствие);
	Кэш.Вставить("ОбработанныеПредопределенные",	Новый Массив);
	Кэш.Вставить("ОсновныеВарианты",				Новый ТаблицаЗначений);
	Кэш.ОсновныеВарианты.Колонки.Добавить("Отчет",		Метаданные.Справочники.ВариантыОтчетов.Реквизиты.Отчет.Тип);
	Кэш.ОсновныеВарианты.Колонки.Добавить("Вариант",	Новый ОписаниеТипов("СправочникСсылка.ВариантыОтчетов"));

	Шаблоны = Новый Структура;
	Шаблоны.Вставить("УстановкаПометкиУдаления", Новый Структура);
	Шаблоны.УстановкаПометкиУдаления.Вставить("Родитель", Кэш.ПустаяСсылка);
	Шаблоны.УстановкаПометкиУдаления.Вставить("ПометкаУдаления", Истина);
	Шаблоны.Вставить("НовыеДанные", Новый Структура("ПометкаУдаления, Родитель, Наименование, Отчет, КлючВарианта, ПредопределенныйВариант, ВидимостьПоУмолчанию"));

	СводнаяТаблицаПредопределенных = Запрос.Выполнить().Выгрузить();
	СводнаяТаблицаПредопределенных.Колонки.Добавить("Обработана",	Новый ОписаниеТипов("Булево"));
	СводнаяТаблицаПредопределенных.Колонки.Добавить("Родитель",		Новый ОписаниеТипов("СправочникСсылка.ВариантыОтчетов"));

	// Обновление основных предопределенных вариантов (без родителя).
	Поиск		= Новый Структура("ПредопределенныйВариантРодитель, УстановитьПометкуУдаления", Неопределено, Ложь);
	Найденные	= СводнаяТаблицаПредопределенных.НайтиСтроки(Поиск);
	Для Каждого СтрокаТаблицы Из Найденные Цикл
		Если СтрокаТаблицы.Обработана Тогда
			Продолжить;
		КонецЕсли;
		Если Кэш.ОбработанныеПредопределенные.Найти(СтрокаТаблицы.ПредопределенныйВариант) <> Неопределено Тогда
			СтрокаТаблицы.УстановитьПометкуУдаления = Истина;
		КонецЕсли;

		СтрокаТаблицы.Родитель = Кэш.ПустаяСсылка;
		ОбновитьРазделенныйПредопределенный(Кэш, Шаблоны, СтрокаТаблицы);

		Если Не СтрокаТаблицы.УстановитьПометкуУдаления И СтрокаТаблицы.ГруппироватьПоОтчету И Кэш.ПоискРодителей.Получить(СтрокаТаблицы.Отчет) = Неопределено Тогда
			Кэш.ПоискРодителей.Вставить(СтрокаТаблицы.Отчет, СтрокаТаблицы.РеквизитСсылка);
			ОсновнойВариант			= Кэш.ОсновныеВарианты.Добавить();
			ОсновнойВариант.Отчет   = СтрокаТаблицы.Отчет;
			ОсновнойВариант.Вариант = СтрокаТаблицы.РеквизитСсылка;
		КонецЕсли;
	КонецЦикла;

	// Обновление всех оставшихся предопределенных вариантов (подчиненных).
	СводнаяТаблицаПредопределенных.Сортировать("УстановитьПометкуУдаления Возр");
	Для Каждого СтрокаТаблицы Из СводнаяТаблицаПредопределенных Цикл
		Если СтрокаТаблицы.Обработана Тогда
			Продолжить;
		КонецЕсли;
		Если Кэш.ОбработанныеПредопределенные.Найти(СтрокаТаблицы.ПредопределенныйВариант) <> Неопределено Тогда
			СтрокаТаблицы.УстановитьПометкуУдаления = Истина;
		КонецЕсли;
		Если СтрокаТаблицы.УстановитьПометкуУдаления Тогда
			РодительСсылка = Кэш.ПустаяСсылка;
		Иначе
			РодительСсылка = Кэш.ПоискРодителей.Получить(СтрокаТаблицы.Отчет);
		КонецЕсли;

		СтрокаТаблицы.Родитель = РодительСсылка;
		ОбновитьРазделенныйПредопределенный(Кэш, Шаблоны, СтрокаТаблицы);
	КонецЦикла;

	// Обновление родителей пользовательских вариантов.
	Запрос			= Новый Запрос;
	Запрос.Текст	= "ВЫБРАТЬ
	            	  |	ОсновныеВариантыОтчетов.Отчет КАК Отчет,
	            	  |	ОсновныеВариантыОтчетов.Вариант КАК Вариант
	            	  |ПОМЕСТИТЬ втОсновные
	            	  |ИЗ
	            	  |	&ОсновныеВариантыОтчетов КАК ОсновныеВариантыОтчетов
	            	  |;
	            	  |
	            	  |////////////////////////////////////////////////////////////////////////////////
	            	  |ВЫБРАТЬ
	            	  |	ВариантыОтчетов.Ссылка КАК Ссылка,
	            	  |	втОсновные.Вариант КАК Родитель
	            	  |ИЗ
	            	  |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОсновные КАК втОсновные
	            	  |		ПО ВариантыОтчетов.Отчет = втОсновные.Отчет
	            	  |			И ВариантыОтчетов.Родитель <> втОсновные.Вариант
	            	  |			И ВариантыОтчетов.Родитель.Родитель <> втОсновные.Вариант
	            	  |			И ВариантыОтчетов.Ссылка <> втОсновные.Вариант
	            	  |ГДЕ
	            	  |	ВариантыОтчетов.Пользовательский
	            	  |
	            	  |ОБЪЕДИНИТЬ ВСЕ
	            	  |
	            	  |ВЫБРАТЬ
	            	  |	ВариантыОтчетов.Ссылка,
	            	  |	втОсновные.Вариант
	            	  |ИЗ
	            	  |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОсновные КАК втОсновные
	            	  |		ПО ВариантыОтчетов.Отчет = втОсновные.Отчет
	            	  |			И ВариантыОтчетов.Родитель <> втОсновные.Вариант
	            	  |			И ВариантыОтчетов.Родитель.Родитель <> втОсновные.Вариант
	            	  |			И ВариантыОтчетов.Ссылка <> втОсновные.Вариант
	            	  |ГДЕ
	            	  |	НЕ ВариантыОтчетов.ПометкаУдаления";

	Запрос.УстановитьПараметр("ОсновныеВариантыОтчетов", Кэш.ОсновныеВарианты);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Кэш.ЕстьИзменения		= Истина;
		ВариантОбъект			= Выборка.Ссылка.ПолучитьОбъект();
		ВариантОбъект.Родитель	= Выборка.Родитель;
		ВариантОбъект.Заблокировать();
		ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);
	КонецЦикла;

	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Завершение процедуры ""%1"".", ПредставлениеПроцедуры));
КонецПроцедуры

// Обновление индекса поиска отчетов.
Процедура ОбновитьИндексПоиска(Кэш)
	ПредставлениеПроцедуры = СтрШаблон("Обновление индекса поиска (%1)", Кэш.Уточнение);
	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,, СтрШаблон("Запуск процедуры ""%1"".", ПредставлениеПроцедуры));

	Запрос = Новый Запрос;
	Если Кэш.ОбщиеДанные Тогда
		Поиск = Новый Структура("Отчет, КлючВарианта, ЭтоВариант", , , Истина);
		Если Кэш.Режим = "ОбщиеДанныеКонфигурации" Тогда
			ДеревоВариантов = ДеревоПредопределенных("Внутренний");
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПредопределенныеВариантыОтчетов.Ссылка КАК Ссылка,
			               |	ПредопределенныеВариантыОтчетов.Отчет КАК Отчет
			               |ИЗ
			               |	Справочник.ПредопределенныеВариантыОтчетов КАК ПредопределенныеВариантыОтчетов
			               |ГДЕ
			               |	ПредопределенныеВариантыОтчетов.ПометкаУдаления = ЛОЖЬ";
		ИначеЕсли Кэш.Режим = "ОбщиеДанныеРасширений" Тогда
			ДеревоВариантов = ДеревоПредопределенных("Расширение");
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПредопределенныеВариантыОтчетовВерсийРасширений.Вариант КАК Ссылка,
			               |	ПредопределенныеВариантыОтчетовВерсийРасширений.Отчет КАК Отчет
			               |ИЗ
			               |	РегистрСведений.ПредопределенныеВариантыОтчетовВерсийРасширений КАК ПредопределенныеВариантыОтчетовВерсийРасширений
			               |ГДЕ
			               |	ПредопределенныеВариантыОтчетовВерсийРасширений.ВерсияРасширений = &ВерсияРасширений
			               |	И ПредопределенныеВариантыОтчетовВерсийРасширений.Вариант <> &ПустаяСсылка";
			Запрос.УстановитьПараметр("ВерсияРасширений", ПараметрыСеанса.ВерсияРасширений);
			Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.ПредопределенныеВариантыОтчетовРасширений.ПустаяСсылка());
		КонецЕсли;
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВариантыОтчетов.Ссылка КАК Ссылка,
		               |	ВариантыОтчетов.Отчет КАК Отчет
		               |ИЗ
		               |	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
		               |ГДЕ
		               |	ВариантыОтчетов.Пользовательский
		               |	И ВариантыОтчетов.ТипОтчета = &ТипОтчета
		               |	И ВариантыОтчетов.Отчет В(&ДоступныеОтчеты)";
		Запрос.УстановитьПараметр("ДоступныеОтчеты", ВариантыОтчетовСеверПовтИсп.ДоступныеОтчеты(Ложь));
		Если Кэш.Режим = "РазделенныеДанныеКонфигурации" Тогда
			Запрос.УстановитьПараметр("ТипОтчета", Перечисления.ТипыОтчетов.Внутренний);
		ИначеЕсли Кэш.Режим = "РазделенныеДанныеРасширений" Тогда
			Запрос.УстановитьПараметр("ТипОтчета", Перечисления.ТипыОтчетов.Расширение);
		КонецЕсли;
	КонецЕсли;

	КэшОтчетов = Новый Соответствие;
	СтарыеСведения = Новый Структура("ХешНастроек, НаименованияПолей, НаименованияПараметровИОтборов, КлючевыеСлова");

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОтчетОбъект = КэшОтчетов.Получить(Выборка.Отчет); // Чтение кэша.
		Если ОтчетОбъект = "" Тогда
			Продолжить; // Отчет не подключен, ошибка зарегистрирована ранее.
		КонецЕсли;

		ВариантОбъект = Выборка.Ссылка.ПолучитьОбъект();

		Если Кэш.ОбщиеДанные Тогда
			ЗаполнитьЗначенияСвойств(Поиск, ВариантОбъект, "Отчет, КлючВарианта");
			Найденные = ДеревоВариантов.Строки.НайтиСтроки(Поиск, Истина);
			Если Найденные.Количество() = 0 Тогда
				ТекстОшибки = СтрШаблон("Вариант ""%1"" не найден для отчета ""%2""",  ВариантОбъект.КлючВарианта, ВариантОбъект.Отчет);
				ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки, ВариантОбъект.Ссылка);

				Продолжить; // Возникла проблема.
			КонецЕсли;

			ОписаниеВарианта = Найденные[0];
			СтрокаОтчет = ОписаниеВарианта.Родитель;
			ЗаполнитьОписаниеСтрокиВарианта(ОписаниеВарианта, СтрокаОтчет);

			// Если вариант отключен, то и в поиске он не участвует.
			Если Не ОписаниеВарианта.Включен Тогда
				Продолжить; // Заполнение не требуется.
			КонецЕсли;

			НастройкиКД = БазоваяПодсистемаКлиентСервер.СвойствоСтруктуры(ОписаниеВарианта.СистемнаяИнформация, "НастройкиКД");
			ВариантОбъект.ДополнительныеСвойства.Вставить("НастройкиКД", НастройкиКД);
			ВариантОбъект.ДополнительныеСвойства.Вставить("НастройкиДляПоиска", ОписаниеВарианта.НастройкиДляПоиска);
		КонецЕсли;

		ВариантОбъект.ДополнительныеСвойства.Вставить("ОтчетОбъект", ОтчетОбъект);

		ЗаполнитьЗначенияСвойств(СтарыеСведения, ВариантОбъект);
		ВариантОбъект.НаименованияПолей					= "";
		ВариантОбъект.НаименованияПараметровИОтборов	= "";
		ВариантОбъект.КлючевыеСлова						= "";
		Если Кэш.Полное Тогда // Переиндексировать принудительно, без проверки хеш-суммы.
			ВариантОбъект.ДополнительныеСвойства.Вставить("ИндексироватьСхему", Истина);
		КонецЕсли;
		СхемаПроиндексирована = ПроиндексироватьСодержимоеСхемы(ВариантОбъект);
		Если СхемаПроиндексирована И ИзменилисьНастройкиПоиска(ВариантОбъект, СтарыеСведения) Тогда
			Если Кэш.ОбщиеДанные Тогда
				ВариантОбъект.ДополнительныеСвойства.Вставить("ЗаполнениеПредопределенных");
				ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);
			Иначе
				ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);
			КонецЕсли;
			Кэш.ЕстьИзменения = Истина;
		КонецЕсли;

		// Сохранение инициализированного объекта в кэш.
		Если ОтчетОбъект = Неопределено Тогда
			ОтчетОбъект = ВариантОбъект.ДополнительныеСвойства.ОтчетОбъект;
			Если ОтчетОбъект = Неопределено Тогда
				ОтчетОбъект = ""; // Отчет не был подключен, регистрация пустой строки для пропуска других вариантов.
			КонецЕсли;
			КэшОтчетов.Вставить(Выборка.Отчет, ОтчетОбъект);
		КонецЕсли;
	КонецЦикла;

	// Для платформы (очистка коллекции вручную для освобождение памяти от цикличных ссылок).
	Если Кэш.ОбщиеДанные Тогда
		ДеревоВариантов.Колонки.Очистить();
		ДеревоВариантов.Строки.Очистить();
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Варианты отчетов", УровеньЖурналаРегистрации.Информация,,,СтрШаблон("Завершение процедуры ""%1"".", ПредставлениеПроцедуры));
КонецПроцедуры

// Формирует таблицу размещения отчетов по подсистемам конфигурации.
//
// Параметры:
//   Результат          - Неопределено - Используется для рекурсии.
//   ПодсистемаРодитель - Неопределено - Используется для рекурсии.
//
// Возвращаемое значение:
//   Результат - ТаблицаЗначений - Настройки размещения отчетов по подсистемам.
//       * ОтчетМетаданные      - ОбъектМетаданных: Отчет.
//       * ОтчетПолноеИмя       - Строка.
//       * ПодсистемаМетаданные - ОбъектМетаданных: Подсистема.
//       * ПодсистемаПолноеИмя  - Строка.
//
Функция РазмещениеОтчетовВПодсистемах(Результат = Неопределено, ПодсистемаРодитель = Неопределено)
	Если Результат = Неопределено Тогда
		ПолноеИмяОписаниеТипов = Метаданные.Справочники.ИдентификаторыОбъектовМетаданных.Реквизиты.ПолноеИмя.Тип;

		Результат = Новый ТаблицаЗначений;
		Результат.Колонки.Добавить("ОтчетМетаданные",      Новый ОписаниеТипов("ОбъектМетаданных"));
		Результат.Колонки.Добавить("ОтчетПолноеИмя",       ПолноеИмяОписаниеТипов);
		Результат.Колонки.Добавить("ПодсистемаМетаданные", Новый ОписаниеТипов("ОбъектМетаданных"));
		Результат.Колонки.Добавить("ПодсистемаПолноеИмя",  ПолноеИмяОписаниеТипов);

		Результат.Индексы.Добавить("ОтчетПолноеИмя");

		ПодсистемаРодитель = Метаданные;
	КонецЕсли;

	// Перебор вложенных подсистем родителя.
	Для Каждого ПодсистемаМетаданные Из ПодсистемаРодитель.Подсистемы Цикл
		Если Не ПодсистемаМетаданные.ВключатьВКомандныйИнтерфейс Тогда
			Продолжить;
		КонецЕсли;

		// Состав подсистемы
		Для Каждого ОтчетМетаданные Из ПодсистемаМетаданные.Состав Цикл
			Если Не Метаданные.Отчеты.Содержит(ОтчетМетаданные) Тогда
				Продолжить;
			КонецЕсли;

			СтрокаТаблицы						= Результат.Добавить();
			СтрокаТаблицы.ОтчетМетаданные		= ОтчетМетаданные;
			СтрокаТаблицы.ОтчетПолноеИмя		= ОтчетМетаданные.ПолноеИмя();
			СтрокаТаблицы.ПодсистемаМетаданные	= ПодсистемаМетаданные;
			СтрокаТаблицы.ПодсистемаПолноеИмя	= ПодсистемаМетаданные.ПолноеИмя();
		КонецЦикла;

		РазмещениеОтчетовВПодсистемах(Результат, ПодсистемаМетаданные);
	КонецЦикла;

	Возврат Результат;
КонецФункции

// Определяет подключен-ли отчет к хранилищу вариантов отчетов.
Функция ОтчетПодключенКХранилищу(ОтчетМетаданные, ПоУмолчаниюВсеПодключены = Неопределено) Экспорт
	ХранилищеМетаданные = ОтчетМетаданные.ХранилищеВариантов;
	Если ХранилищеМетаданные = Неопределено Тогда
		Если ПоУмолчаниюВсеПодключены = Неопределено Тогда
			ПоУмолчаниюВсеПодключены = (Метаданные.ХранилищеВариантовОтчетов <> Неопределено И Метаданные.ХранилищеВариантовОтчетов.Имя = "ХранилищеВариантовОтчетов");
		КонецЕсли;

		ОтчетПодключен = ПоУмолчаниюВсеПодключены;
	Иначе
		ОтчетПодключен = (ХранилищеМетаданные = Метаданные.ХранилищаНастроек.ХранилищеВариантовОтчетов);
	КонецЕсли;

	Возврат ОтчетПодключен;
КонецФункции

// Запись в журнал регистрации.
Процедура ЗаписатьВЖурнал(Уровень, Сообщение, ВариантОтчета = Неопределено) Экспорт
	Если ТипЗнч(ВариантОтчета) = Тип("ОбъектМетаданных") Тогда
		ОбъектМетаданных = ВариантОтчета;
		Данные = ОбъектМетаданных.Представление();
	Иначе
		ОбъектМетаданных = Метаданные.Справочники.ВариантыОтчетов;
		Данные = ВариантОтчета;
	КонецЕсли;
	ЗаписьЖурналаРегистрации("Варианты отчетов", Уровень, ОбъектМетаданных, Данные, Сообщение);
КонецПроцедуры

// Заполняет описание настроек для строки варианта отчета если оно еще не заполнено.
//
// Параметры:
//   СтрокаВариант - СтрокаДерева - Описание настроек варианта отчета.
//   СтрокаОтчет   - СтрокаДерева - Необязательный. Описание настроек отчета.
//
Процедура ЗаполнитьОписаниеСтрокиВарианта(СтрокаВариант, СтрокаОтчет = Неопределено) Экспорт
	Если СтрокаВариант.ОписаниеПолучено Тогда
		Возврат;
	КонецЕсли;

	Если СтрокаОтчет = Неопределено Тогда
		СтрокаОтчет = СтрокаВариант.Родитель;
	КонецЕсли;

	// Флажок изменения настроек
	СтрокаВариант.ОписаниеПолучено = Истина;

	// Копирование настроек отчета.
	ЗаполнитьЗначенияСвойств(СтрокаВариант, СтрокаОтчет, "Включен, ВидимостьПоУмолчанию, ГруппироватьПоОтчету");

	Если СтрокаВариант = СтрокаОтчет.ОсновнойВариант Тогда
		// Вариант "по умолчанию".
		СтрокаВариант.Описание				= СтрокаОтчет.Описание;
		СтрокаВариант.ВидимостьПоУмолчанию	= Истина;
	Иначе
		// Предопределенный вариант.
		Если СтрокаВариант.ГруппироватьПоОтчету Тогда
			СтрокаВариант.ВидимостьПоУмолчанию = Ложь;
		КонецЕсли;
	КонецЕсли;

	СтрокаВариант.Размещение			= БазоваяПодсистемаКлиентСервер.СкопироватьСоответствие(СтрокаОтчет.Размещение);
	СтрокаВариант.ФункциональныеОпции	= БазоваяПодсистемаКлиентСервер.СкопироватьМассив(СтрокаОтчет.ФункциональныеОпции);
	СтрокаВариант.НастройкиДляПоиска	= БазоваяПодсистемаКлиентСервер.СкопироватьСтруктуру(СтрокаОтчет.НастройкиДляПоиска);
	СтрокаВариант.КлючЗамеров			= БазоваяПодсистемаСервер.СократитьСтрокуКонтрольнойСуммой("Отчет." + СтрокаОтчет.Метаданные.Имя  + "." + СтрокаВариант.КлючВарианта, 135);
КонецПроцедуры

// Возвращает настройки указанного отчета. Используется для настройки размещения и общих параметров отчета
// в ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
// Параметры:
//   Настройки - Коллекция - используется для описания настроек отчетов и вариантов.
//                           Передается "как есть" из процедуры НастроитьВариантыОтчета.
//   Отчет - ОбъектМетаданных, СправочникСсылка.ИдентификаторыОбъектовМетаданных - метаданные или ссылка отчета.
//
// Возвращаемое значение:
//   СтрокаДереваЗначений - настройки отчета и настройки "по умолчанию" для вариантов этого отчета.
//     Полученное значение можно использовать в функции ОписаниеВарианта для получения настроек варианта.
//     Реквизиты для изменения:
//       * Включен              - Булево - Если Ложь, то вариант отчета не регистрируется в подсистеме.
//       * ВидимостьПоУмолчанию - Булево - Если Ложь, то вариант отчета по умолчанию скрыт в панели отчетов.
//       * Размещение           - Соответствие - Настройки размещения варианта отчета в разделах.
//           ** Ключ     - ОбъектМетаданных - Подсистема, в которой размещается отчет или вариант отчета.
//           ** Значение - Строка           - Настройки размещения в подсистеме (группе).
//               *** ""        - Вывод отчета в подсистеме без специального выделение.
//               *** "Важный"  - Вывод отчета в подсистеме с выделением жирным шрифтом.
//               *** "СмТакже" - Вывод отчета в группе "См. также".
//       * ФункциональныеОпции - Массив из Строка - Имена функциональных опций варианта отчета.
//       * НастройкиДляПоиска  - Структура - Дополнительные настройки для поиска этого варианта отчета.
//           Эти настройки необходимо задавать только если СКД не используется или используется не в полном объеме.
//           Например, СКД может использоваться только для параметризации и получения данных,
//           а вывод выполняться в фиксированный макет табличного документа.
//           ** НаименованияПолей - Строка - Имена полей варианта отчета.
//           ** НаименованияПараметровИОтборов - Строка - Имена настроек варианта отчета.
//           ** КлючевыеСлова - Строка - Дополнительная терминология (в т.ч. специализированная или устаревшая).
//           Разделитель терминов: Символы.ПС.
//           ** ИменаМакетов - Строка - Используется вместо НаименованияПолей.
//               Имена макетов табличных или текстовых документов,
//               из которых требуется извлечь информацию о наименованиях полей.
//               Имена перечисляются через запятую.
//               К сожалению, в макетах отсутствует информация о связях полей и их представлений (которая есть в СКД),
//               поэтому для более точной работы механизма поиска рекомендуется заполнять НаименованияПолей, а не
//               ИменаМакетов.
//       * ФорматНастроекСКД - Булево - Отчет использует типовой формат хранения настроек на механике СКД,
//           а его основные формы поддерживают стандартную схему взаимодействия между формами (параметры и тип
//           возвращаемого значения).
//           Если Ложь, тогда для отчета отключаются проверки консистентности и некоторые механизмы, которые
//           рассчитывают на типовой формат.
//       * ОпределитьНастройкиФормы - Булево - Отчет имеет программный интерфейс для тесной интеграции с формой отчета,
//           в том числе может переопределять некоторые настройки формы и подписываться на ее события.
//           Если Истина и отчет подключен к общей форме ФормаОтчета,
//           тогда в модуле объекта отчета следует определить процедуру по шаблону:
//
//               // Настройки общей формы отчета подсистемы "Варианты отчетов".
//               //
//               // Параметры:
//               //   Форма - УправляемаяФорма, Неопределено - Форма отчета или форма настроек отчета.
//               //       Неопределено когда вызов без контекста.
//               //   КлючВарианта - Строка, Неопределено - Имя предопределенного
//               //       или уникальный идентификатор пользовательского варианта отчета.
//               //       Неопределено когда вызов без контекста.
//               //   Настройки - Структура - см. возвращаемое значение
//               //       ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//               //
//               Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
//               	// Код процедуры.
//               КонецПроцедуры
//
//     Служебные реквизиты (только для чтения):
//       * Отчет               - <см. Справочники.ВариантыОтчетов.Реквизиты.Отчет> - Полное имя или ссылка на отчет.
//       * Метаданные          - ОбъектМетаданных: Отчет - Метаданные отчета.
//       * КлючВарианта        - Строка - Имя варианта отчета.
//       * ОписаниеПолучено    - Булево - Флажок что описание строки уже получено.
//           Описание получается методом ОписаниеВарианта().
//       * СистемнаяИнформация - Структура - Другая служебная информация.
//
Функция ОписаниеОтчета(Настройки, Отчет) Экспорт
	ЭтоМетаданные = (ТипЗнч(Отчет) = Тип("ОбъектМетаданных"));
	Если ЭтоМетаданные Тогда
		СтрокаОтчет = Настройки.Строки.Найти(Отчет, "Метаданные", Ложь);
	Иначе
		СтрокаОтчет = Настройки.Строки.Найти(Отчет, "Отчет", Ложь);
	КонецЕсли;

	Если СтрокаОтчет = Неопределено Тогда
		ВызватьИсключение СтрШаблон("Ошибка получения описания отчета ""%1"": он не подключен к подсистеме ""%2"".
			|Проверьте свойство ""Хранилище вариантов"" в свойствах отчета.",
			Строка(Отчет),
			"Варианты отчетов");
	КонецЕсли;

	Возврат СтрокаОтчет;
КонецФункции

// Формирует таблицу замен старых ключей вариантов на актуальные.
//
// Возвращаемое значение:
//   ТаблицаЗначений - Таблица изменений имен вариантов. Колонки:
//       * ОтчетМетаданные - ОбъектМетаданных: Отчет - Метаданные отчета, в схеме которого изменилось имя варианта.
//       * СтароеИмяВарианта - Строка - Старое имя варианта, до изменения.
//       * АктуальноеИмяВарианта - Строка - Текущее (последнее актуальное) имя варианта.
//       * Отчет - СправочникСсылка.ИдентификаторыОбъектовМетаданных, Строка - Ссылка или имя отчета,
//
Функция ИзмененияКлючей()
	РеквизитыВариантов = Метаданные.Справочники.ВариантыОтчетов.Реквизиты;

	Изменения = Новый ТаблицаЗначений;
	Изменения.Колонки.Добавить("Отчет",                 Новый ОписаниеТипов("ОбъектМетаданных"));
	Изменения.Колонки.Добавить("СтароеИмяВарианта",     РеквизитыВариантов.КлючВарианта.Тип);
	Изменения.Колонки.Добавить("АктуальноеИмяВарианта", РеквизитыВариантов.КлючВарианта.Тип);

	Изменения.Колонки.Отчет.Имя = "ОтчетМетаданные";
	Изменения.Колонки.Добавить("Отчет", РеквизитыВариантов.Отчет.Тип);

	// Проверить корректность замен.
	Для Каждого Изменение Из Изменения Цикл
		Изменение.Отчет	= Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(Изменение.ОтчетМетаданные);
		Найденные		= Изменения.НайтиСтроки(Новый Структура("ОтчетМетаданные, СтароеИмяВарианта", Изменение.ОтчетМетаданные, Изменение.АктуальноеИмяВарианта));
		Если Найденные.Количество() > 0 Тогда
			Конфликт = Найденные[0];
			ВызватьИсключение СтрШаблон("Ошибка регистрации изменений имени варианта отчета ""%1"":
				|Актуальное имя варианта ""%2"" (старое имя ""%3"")
				|также числится как старое имя ""%4"" (актуальное имя ""%5"").",
				Строка(Изменение.Отчет),
				Изменение.АктуальноеИмяВарианта,
				Изменение.СтароеИмяВарианта,
				Конфликт.СтароеИмяВарианта,
				Конфликт.АктуальноеИмяВарианта);
		КонецЕсли;
		Найденные = Изменения.НайтиСтроки(Новый Структура("ОтчетМетаданные, СтароеИмяВарианта", Изменение.ОтчетМетаданные, Изменение.СтароеИмяВарианта));
		Если Найденные.Количество() > 2 Тогда
			Конфликт = Найденные[1];
			ВызватьИсключение СтрШаблон("Ошибка регистрации изменений имени варианта отчета ""%1"":
				|Старое имя варианта ""%2"" (актуальное имя ""%3"")
				|также числится как старое имя
				|варианта отчета ""%4"" (актуальное имя ""%5"").",
				Строка(Изменение.Отчет),
				Изменение.СтароеИмяВарианта,
				Изменение.АктуальноеИмяВарианта,
				Строка(Конфликт.ОтчетМетаданные.Представление()),
				Конфликт.АктуальноеИмяВарианта);
		КонецЕсли;
	КонецЦикла;

	Возврат Изменения;
КонецФункции

// Записывает настройки варианта в данные справочника.
Функция ОбновитьПредопределенный(Кэш, ОписаниеВарианта)
	ВариантИзБазы = ОписаниеВарианта.ВариантИзБазы;
	Если Кэш.ОбновлятьЗамеры Тогда
		// зарезервировано для новых подсистем
	КонецЕсли;
	Если ОписаниеВарианта.НайденВБазеДанных Тогда
		Если ИзменилисьКлючевыеНастройкиПредопределенного(ОписаниеВарианта, ВариантИзБазы) Тогда
			Кэш.ЕстьВажныеИзменения = Истина; // Перезапись ключевых настроек (потребуется обновление разделенных данных).
		ИначеЕсли ИзменилисьВторостепенныеНастройкиПредопределенного(ОписаниеВарианта, ВариантИзБазы) Тогда
			// Перезапись без обновления разделенных данных.
		Иначе
			Возврат ВариантИзБазы.Ссылка;
		КонецЕсли;

		ВариантОбъект = ОписаниеВарианта.ВариантИзБазы.Ссылка.ПолучитьОбъект();
		ВариантОбъект.Размещение.Очистить();
		Если ВариантОбъект.ПометкаУдаления Тогда
			ВариантОбъект.ПометкаУдаления = Ложь;
		КонецЕсли;
	Иначе
		Кэш.ЕстьВажныеИзменения = Истина; // Регистрация нового (потребуется обновление разделенных данных).
		Если Кэш.Режим = "ОбщиеДанныеКонфигурации" Тогда
			ВариантОбъект = Справочники.ПредопределенныеВариантыОтчетов.СоздатьЭлемент();
		ИначеЕсли Кэш.Режим = "ОбщиеДанныеРасширений" Тогда
			ВариантОбъект = Справочники.ПредопределенныеВариантыОтчетовРасширений.СоздатьЭлемент();
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьЗначенияСвойств(ВариантОбъект, ОписаниеВарианта, "Отчет, КлючВарианта, Наименование, Включен, ВидимостьПоУмолчанию, Описание, ГруппироватьПоОтчету");

	ВариантОбъект.Родитель = ОписаниеВарианта.ВариантРодитель;

	Для Каждого КлючИЗначение Из ОписаниеВарианта.Размещение Цикл
		СсылкаПодсистемы = Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(КлючИЗначение.Ключ);
		Если ТипЗнч(СсылкаПодсистемы) = Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРазмещения			= ВариантОбъект.Размещение.Добавить();
		СтрокаРазмещения.Подсистема	= СсылкаПодсистемы;
		СтрокаРазмещения.Важный		= (НРег(КлючИЗначение.Значение) = НРег("Важный"));
		СтрокаРазмещения.СмТакже	= (НРег(КлючИЗначение.Значение) = НРег("СмТакже"));
	КонецЦикла;

	Если Кэш.ОбновлятьЗамеры Тогда
		ВариантОбъект.КлючЗамеров = ОписаниеВарианта.КлючЗамеров;
	КонецЕсли;

	Кэш.ЕстьИзменения = Истина;
	ВариантОбъект.ДополнительныеСвойства.Вставить("ЗаполнениеПредопределенных");
	ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);

	Возврат ВариантОбъект.Ссылка;
КонецФункции

// Обновляет предопределенные данные в разделенном режиме.
Процедура ОбновитьРазделенныйПредопределенный(Кэш, Шаблоны, СтрокаТаблицы)
	Если СтрокаТаблицы.Обработана Тогда
		Возврат;
	КонецЕсли;

	СтрокаТаблицы.Обработана = Истина;

	Если СтрокаТаблицы.УстановитьПометкуУдаления Тогда // Пометить к удалению.
		Если СовпадаютЗначенияСвойств(Шаблоны.УстановкаПометкиУдаления, СтрокаТаблицы, "Реквизит") Тогда
			Возврат; // Уже помечен.
		КонецЕсли;
		ВариантОбъект = СтрокаТаблицы.РеквизитСсылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ВариантОбъект, Шаблоны.УстановкаПометкиУдаления);
	Иначе
		Если СтрокаТаблицы.ГруппироватьПоОтчету И Не ЗначениеЗаполнено(СтрокаТаблицы.ПредопределенныйВариантРодитель) Тогда
			СтрокаТаблицы.Родитель = Кэш.ПустаяСсылка;
		КонецЕсли;
		Кэш.ОбработанныеПредопределенные.Добавить(СтрокаТаблицы.ПредопределенныйВариант);
		ЗаполнитьЗначенияСвойств(Шаблоны.НовыеДанные, СтрокаТаблицы);
		Шаблоны.НовыеДанные.ПометкаУдаления = Ложь;
		Если СтрокаТаблицы.СоздатьНовый Тогда // Добавить.
			ВариантОбъект							= Справочники.ВариантыОтчетов.СоздатьЭлемент();
			ВариантОбъект.ПредопределенныйВариант	= СтрокаТаблицы.ПредопределенныйВариант;
			ВариантОбъект.Пользовательский			= Ложь;
		Иначе // Обновить (если есть изменения).
			Если СовпадаютЗначенияСвойств(Шаблоны.НовыеДанные, СтрокаТаблицы, "Реквизит") Тогда
				Возврат; // Изменений нет.
			КонецЕсли;
			// Перенос пользовательских настроек.
			ЗаменитьКлючиПользовательскихНастроек(Шаблоны.НовыеДанные, СтрокаТаблицы);
			ВариантОбъект = СтрокаТаблицы.РеквизитСсылка.ПолучитьОбъект();
		КонецЕсли;
		Если ВариантОбъект.ВидимостьПоУмолчаниюПереопределена Тогда
			ИсключаяСвойства = "ВидимостьПоУмолчанию";
		Иначе
			ИсключаяСвойства = Неопределено;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ВариантОбъект, Шаблоны.НовыеДанные, , ИсключаяСвойства);
		ТипОтчетаСтрокой = ВариантыОтчетовКлиентСервер.ТипОтчетаСтрокой(Неопределено, ВариантОбъект.Отчет);
		ВариантОбъект.ТипОтчета = Перечисления.ТипыОтчетов[ТипОтчетаСтрокой];
	КонецЕсли;

	Кэш.ЕстьИзменения = Истина;
	ВариантОбъект.Заблокировать();
	ОбновлениеИБСервер.ЗаписатьОбъект(ВариантОбъект);

	СтрокаТаблицы.РеквизитСсылка = ВариантОбъект.Ссылка;
КонецПроцедуры

Функция ПроиндексироватьСодержимоеСхемы(ВариантОбъект) Экспорт
	ДополнительныеСвойства	= ВариантОбъект.ДополнительныеСвойства;
	ТребуетсяЗапись			= Ложь;

	// В некоторых случаях заранее известно что настройки уже проиндексированы.
	ИндексироватьСхему		= БазоваяПодсистемаКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ИндексироватьСхему");
	Если ИндексироватьСхему = Ложь Тогда
		Возврат ТребуетсяЗапись; // Заполнение не требуется.
	КонецЕсли;
	ПроверятьХеш = Истина;
	Если ИндексироватьСхему = Истина Тогда
		ПроверятьХеш = Ложь;
	КонецЕсли;

	// Механика ручного индексирования из данных варианта.
	ЗаполнитьПоля		= Лев(ВариантОбъект.НаименованияПолей, 1) <> "#";
	ЗаполнитьФильтры	= Лев(ВариантОбъект.НаименованияПараметровИОтборов, 1) <> "#";
	Если Не ЗаполнитьПоля И Не ЗаполнитьФильтры Тогда
		Возврат ТребуетсяЗапись; // Заполнение не требуется.
	КонецЕсли;

	// Получение объекта отчета, настроек СКД и варианта.
	ЭтоПредопределенный = (ТипЗнч(ВариантОбъект) = Тип("СправочникОбъект.ПредопределенныеВариантыОтчетов")) Или ТипЗнч(ВариантОбъект) = Тип("СправочникОбъект.ПредопределенныеВариантыОтчетовРасширений") Или Не ВариантОбъект.Пользовательский;

	// Предустановленные настройки поиска.
	НастройкиДляПоиска = БазоваяПодсистемаКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "НастройкиДляПоиска");
	Если НастройкиДляПоиска <> Неопределено Тогда
		Если ЗаполнитьПоля И ЗначениеЗаполнено(НастройкиДляПоиска.НаименованияПолей) Тогда
			ВариантОбъект.НаименованияПолей	= "#" + СокрЛП(НастройкиДляПоиска.НаименованияПолей);
			ЗаполнитьПоля					= Ложь;
			ТребуетсяЗапись					= Истина;
		КонецЕсли;
		Если ЗаполнитьФильтры И ЗначениеЗаполнено(НастройкиДляПоиска.НаименованияПараметровИОтборов) Тогда
			ВариантОбъект.НаименованияПараметровИОтборов	= "#" + СокрЛП(НастройкиДляПоиска.НаименованияПараметровИОтборов);
			ЗаполнитьФильтры								= Ложь;
			ТребуетсяЗапись									= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(НастройкиДляПоиска.КлючевыеСлова) Тогда
			ВариантОбъект.КлючевыеСлова	= "#" + СокрЛП(НастройкиДляПоиска.КлючевыеСлова);
			ТребуетсяЗапись				= Истина;
		КонецЕсли;
		Если Не ЗаполнитьПоля И Не ЗаполнитьФильтры Тогда
			Возврат ТребуетсяЗапись; // Заполнение выполнено - объект надо записать.
		КонецЕсли;
	КонецЕсли;

	// В некоторых сценариях объект может быть уже закэширован в дополнительных свойствах.
	ОтчетОбъект = БазоваяПодсистемаКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ОтчетОбъект");

	// Когда объект отчета не закэширован - подключение отчета штатным способом.
	Если ОтчетОбъект = Неопределено Тогда
		Подключение = ПодключитьОтчетОбъект(ВариантОбъект.Отчет, Ложь);
		Если Подключение.Успех Тогда
			ОтчетОбъект = Подключение.Объект;
		Иначе
			ОтчетОбъект = "";
			ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, Подключение.ТекстОшибки, ВариантОбъект.Ссылка);
		КонецЕсли;
		ДополнительныеСвойства.Вставить("ОтчетОбъект", ОтчетОбъект);
	КонецЕсли;
	Если ОтчетОбъект = "" Тогда
		Возврат ТребуетсяЗапись; // Возникла проблема при подключении отчета.
	КонецЕсли;

	// Извлечение текстов макетов возможно только после получения объекта отчета.
	Если ЗаполнитьПоля И НастройкиДляПоиска <> Неопределено И ЗначениеЗаполнено(НастройкиДляПоиска.ИменаМакетов) Тогда
		ВариантОбъект.НаименованияПолей	= "#" + ИзвлечьТекстМакета(ОтчетОбъект, НастройкиДляПоиска.ИменаМакетов);
		ТребуетсяЗапись					= истина;
		ЗаполнитьПоля					= Ложь;
		Если Не ЗаполнитьПоля И Не ЗаполнитьФильтры Тогда
			Возврат ТребуетсяЗапись; // Заполнение выполнено - объект надо записать.
		КонецЕсли;
	КонецЕсли;

	// Схема компоновки, на основании которой будет выполняться отчет.
	СхемаКД = ОтчетОбъект.СхемаКомпоновкиДанных;

	// Если отчет не на СКД, следовательно представления не заполняются или заполняются прикладными механизмами.
	Если СхемаКД = Неопределено Тогда
		ТекстОшибки = СтрШаблон("Для варианта ""%1"" отчета ""%2"" не заполнены настройки поиска:
			|Наименования полей или Наименования параметров и отборов.",
			ВариантОбъект.КлючВарианта,
			ВариантОбъект.Отчет);
		Если ЭтоПредопределенный Тогда
			ТекстОшибки = ТекстОшибки;
			Уровень = ?(ВариантОбъект.Размещение.Количество() > 0, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
			ЗаписатьВЖурнал(Уровень, ТекстОшибки, ВариантОбъект.Ссылка);
		Иначе
			ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Информация, ТекстОшибки, ВариантОбъект.Ссылка);
		КонецЕсли;
		Возврат ТребуетсяЗапись; // Возникла проблема.
	КонецЕсли;

	// Чтение настроек из переданных параметров.
	НастройкиКД = БазоваяПодсистемаКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "НастройкиКД");

	// Чтение настроек из схемы.
	Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
		ВариантНастроекКД = СхемаКД.ВариантыНастроек.Найти(ВариантОбъект.КлючВарианта);
		Если ВариантНастроекКД <> Неопределено Тогда
			НастройкиКД = ВариантНастроекКД.Настройки;
		КонецЕсли;
	КонецЕсли;

	// Чтение настроек из данных варианта.
	Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных")
		И ТипЗнч(ВариантОбъект) = Тип("СправочникОбъект.ВариантыОтчетов") Тогда
		Попытка
			НастройкиКД = ВариантОбъект.Настройки.Получить();
		Исключение
			ШаблонСообщения = "Не удалось прочитать настройки пользовательского варианта отчета:
				|%1";
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, ТекстСообщения, ВариантОбъект.Ссылка);

			Возврат ТребуетсяЗапись; // Возникла проблема.
		КонецПопытки;
	КонецЕсли;

	// Последняя проверка.
	Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
		Если ТипЗнч(ВариантОбъект) = Тип("СправочникОбъект.ПредопределенныеВариантыОтчетов") Или ТипЗнч(ВариантОбъект) = Тип("СправочникОбъект.ПредопределенныеВариантыОтчетовРасширений") Тогда
			ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, СтрШаблон("Не удалось прочитать настройки предопределенного варианта отчета ""%1"".", ВариантОбъект.КлючЗамеров), ВариантОбъект.Ссылка);
		КонецЕсли;
		Возврат ТребуетсяЗапись; // Возникла проблема.
	КонецЕсли;

	ХешЭтихНастроек = БазоваяПодсистемаСервер.КонтрольнаяСуммаСтрокой(БазоваяПодсистемаСервер.ЗначениеВСтрокуXML(НастройкиКД));
	Если ПроверятьХеш И ВариантОбъект.ХешНастроек = ХешЭтихНастроек Тогда
		Возврат ТребуетсяЗапись; // Настройки не изменились.
	КонецЕсли;
	ТребуетсяЗапись				= истина;
	ВариантОбъект.ХешНастроек	= ХешЭтихНастроек;

	// Описывает связь настроек компоновки данных и схемы компоновки данных.
	КомпоновщикНастроекКД = ОтчетОбъект.КомпоновщикНастроек;

	// Выполняет инициализацию компоновщика и его настроек (Настройки) источником доступных настроек.
	КомпоновщикНастроекКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));

	// Загружает настройки в компоновщик и сбрасывает пользовательские настройки.
	ВариантыОтчетовКлиентСервер.ЗагрузитьНастройки(КомпоновщикНастроекКД, НастройкиКД);

	Если ЗаполнитьПоля Тогда
		// Преобразование всех настроек автоматической группировки в наборы полей.
		//   См. "АвтоВыбранноеПолеКомпоновкиДанных", "АвтоПолеГруппировкиКомпоновкиДанных",
		//   "АвтоЭлементПорядкаКомпоновкиДанных" в синтакс-помощнике.
		КомпоновщикНастроекКД.РазвернутьАвтоПоля();

		ВариантОбъект.НаименованияПолей = СформироватьПредставленияПолей(КомпоновщикНастроекКД);
	КонецЕсли;

	Если ЗаполнитьФильтры Тогда
		ВариантОбъект.НаименованияПараметровИОтборов = СформироватьПредставленияПараметровИОтборов(КомпоновщикНастроекКД);
	КонецЕсли;

	Возврат ТребуетсяЗапись;
КонецФункции

// Определяет изменились ли настройки поиска предопределенного варианта отчета.
Функция ИзменилисьНастройкиПоиска(ВариантИзБазы, СтарыеСведения)
	Если ВариантИзБазы.ХешНастроек <> СтарыеСведения.ХешНастроек
		Или ВариантИзБазы.НаименованияПолей <> СтарыеСведения.НаименованияПолей
		Или ВариантИзБазы.НаименованияПараметровИОтборов <> СтарыеСведения.НаименованияПараметровИОтборов
		Или ВариантИзБазы.КлючевыеСлова <> СтарыеСведения.КлючевыеСлова Тогда

		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Определяет изменились ли ключевые настройки предопределенного варианта отчета.
Функция ИзменилисьКлючевыеНастройкиПредопределенного(ОписаниеВарианта, ВариантИзБазы)
	Если ВариантИзБазы.ПометкаУдаления = Истина // Описание получено => требуется снять пометку удаления.
		Или ВариантИзБазы.Наименование <> ОписаниеВарианта.Наименование
		Или ВариантИзБазы.Родитель <> ОписаниеВарианта.ВариантРодитель
		Или ВариантИзБазы.ВидимостьПоУмолчанию <> ОписаниеВарианта.ВидимостьПоУмолчанию Тогда

		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Определяет изменились ли второстепенные настройки предопределенного варианта отчета.
Функция ИзменилисьВторостепенныеНастройкиПредопределенного(ОписаниеВарианта, ВариантИзБазы)
	// Шапка
	Если ВариантИзБазы.Включен <> ОписаниеВарианта.Включен
		Или ВариантИзБазы.Описание <> ОписаниеВарианта.Описание
		Или ВариантИзБазы.КлючЗамеров <> ОписаниеВарианта.КлючЗамеров
		Или ВариантИзБазы.ГруппироватьПоОтчету <> ОписаниеВарианта.ГруппироватьПоОтчету Тогда

		Возврат Истина;
	КонецЕсли;

	// Таблица "Размещение"
	ТаблицаРазмещения = ВариантИзБазы.Размещение;
	Если ТаблицаРазмещения.Количество() <> ОписаниеВарианта.Размещение.Количество() Тогда
		Возврат Истина;
	КонецЕсли;

	Для Каждого КлючИЗначение Из ОписаниеВарианта.Размещение Цикл
		Подсистема = Справочники.ИдентификаторыОбъектовМетаданных.ИдентификаторОбъектаМетаданных(КлючИЗначение.Ключ);
		Если ТипЗнч(Подсистема) = Тип("Строка") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРазмещения = ТаблицаРазмещения.Найти(Подсистема, "Подсистема");
		Если СтрокаРазмещения = Неопределено
			Или СтрокаРазмещения.Важный <> (НРег(КлючИЗначение.Значение) = НРег("Важный"))
			Или СтрокаРазмещения.СмТакже <> (НРег(КлючИЗначение.Значение) = НРег("СмТакже")) Тогда

			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;
КонецФункции

// Возвращает Истина если совпадают значения свойств Структуры и Коллекции с Префиксом.
Функция СовпадаютЗначенияСвойств(Структура, Коллекция, ПрефиксВКоллекции = "")
	Для Каждого КлючИЗначение Из Структура Цикл
		Если Коллекция[ПрефиксВКоллекции + КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;
КонецФункции

// Перенос пользовательских настроек варианта из соответствующего хранилища.
Процедура ЗаменитьКлючиПользовательскихНастроек(СтарыйВариант, АктуальныйВариант)
	Если СтарыйВариант.КлючВарианта = АктуальныйВариант.КлючВарианта
		Или Не ЗначениеЗаполнено(СтарыйВариант.КлючВарианта)
		Или Не ЗначениеЗаполнено(АктуальныйВариант.КлючВарианта)
		Или ТипЗнч(АктуальныйВариант.Отчет) <> Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда

		Возврат;
	КонецЕсли;

	ОтчетПолноеИмя		= АктуальныйВариант.Отчет.ПолноеИмя;
	СтарыйКлючОбъекта	= ОтчетПолноеИмя +"/"+ СтарыйВариант.КлючВарианта;
	НовыйКлючОбъекта	= ОтчетПолноеИмя +"/"+ АктуальныйВариант.КлючВарианта;

	Отбор				= Новый Структура("КлючОбъекта", СтарыйКлючОбъекта);
	ВыборкаХранилища	= ХранилищеПользовательскихНастроекОтчетов.Выбрать(Отбор);
	ОшибокЧтенияПодряд	= 0;
	Пока Истина Цикл
		// Чтение настроек из хранилища по старому ключу.
		Попытка
			ЭлементВыборкиПолучен	= ВыборкаХранилища.Следующий();
			ОшибокЧтенияПодряд		= 0;
		Исключение
			ЭлементВыборкиПолучен	= Неопределено;
			ОшибокЧтенияПодряд		= ОшибокЧтенияПодряд + 1;
			ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка,
				"В процессе выборки вариантов отчетов из стандартного хранилища возникла ошибка:"
					+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
				СтарыйВариант.Ссылка);
		КонецПопытки;

		Если ЭлементВыборкиПолучен = Ложь Тогда
			Прервать;
		ИначеЕсли ЭлементВыборкиПолучен = Неопределено Тогда
			Если ОшибокЧтенияПодряд > 100 Тогда
				Прервать;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;

		// Чтение описания настроек.
		ОписаниеНастроек = ХранилищеПользовательскихНастроекОтчетов.ПолучитьОписание(ВыборкаХранилища.КлючОбъекта, ВыборкаХранилища.КлючНастроек, ВыборкаХранилища.Пользователь);

		// Запись настроек в хранилище по новому ключу.
		ХранилищеПользовательскихНастроекОтчетов.Сохранить(НовыйКлючОбъекта, ВыборкаХранилища.КлючНастроек, ВыборкаХранилища.Настройки, ОписаниеНастроек, ВыборкаХранилища.Пользователь);
	КонецЦикла;

	// Очистка старых настроек хранилища.
	ХранилищеПользовательскихНастроекОтчетов.Удалить(СтарыйКлючОбъекта, Неопределено, Неопределено);
КонецПроцедуры

// Получает объект отчета по ссылке варианта отчета.
//
// Параметры:
//   СсылкаОтчета -
//     - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Ссылка отчета конфигурации.
//     - СправочникСсылка.ИдентификаторыОбъектовРасширений - Ссылка отчета расширения.
//     - Произвольный - Ссылка дополнительного или внешнего отчета.
//
// Возвращаемое значение:
//   Структура - Параметры отчета, в том числе Объект отчета.
//       * Объект      - ОтчетОбъект.<Имя отчета>, ВнешнийОтчет - Объект отчета.
//       * Имя         - Строка           - Имя объекта отчета.
//       * ПолноеИмя   - Строка           - Полное имя объекта отчета.
//       * Метаданные  - ОбъектМетаданных - Объект метаданных отчета.
//       * Ссылка      - Произвольный     - Ссылка отчета.
//       * Успех       - Булево           - Истина если удалось подключить отчет.
//       * ТекстОшибки - Строка           - Текст ошибки.
//
// Места использования:
//   РассылкаОтчетов.ИнициализироватьОтчет().
//
Функция ПодключитьОтчетОбъект(СсылкаОтчета, ПолучатьМетаданные)
	Результат = Новый Структура("Объект, Имя, ПолноеИмя, Метаданные, Ссылка, ТекстОшибки");
	Результат.Вставить("Успех", Ложь);

	Если СсылкаОтчета = Неопределено Тогда
		Результат.ТекстОшибки = СтрШаблон("В методе ""%1"" не указан параметр ""%2"".", "ПодключитьОтчетОбъект", "СсылкаОтчета");

		Возврат Результат;
	Иначе
		Результат.Ссылка = СсылкаОтчета;
	КонецЕсли;

	Если ТипЗнч(Результат.Ссылка) = Тип("Строка") Тогда
		Результат.ТекстОшибки = СтрШаблон("Отчет ""%1"" записан как внешний и не может быть подключен из программы", Результат.Ссылка);

		Возврат Результат;
	КонецЕсли;

	Если ТипЗнч(Результат.Ссылка) = Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных")
	 Или ТипЗнч(Результат.Ссылка) = Тип("СправочникСсылка.ИдентификаторыОбъектовРасширений") Тогда

		Результат.Метаданные = Справочники.ИдентификаторыОбъектовМетаданных.ОбъектМетаданныхПоИдентификатору(Результат.Ссылка, Истина);

		Если ТипЗнч(Результат.Метаданные) <> Тип("ОбъектМетаданных") Тогда
			Результат.ТекстОшибки = СтрШаблон("Отчет ""%1"" не найден в программе", Результат.Имя);

			Возврат Результат;
		КонецЕсли;
		Результат.Имя		= Результат.Метаданные.Имя;
		Результат.Объект	= Отчеты[Результат.Имя].Создать();
		Результат.Успех	= Истина;
	Иначе
		// Зарезервировано для новых подсистем
	КонецЕсли;

	Если Результат.Успех И ПолучатьМетаданные Тогда
		Результат.ПолноеИмя = Результат.Метаданные.ПолноеИмя();
	КонецЕсли;

	Возврат Результат;
КонецФункции

// Извлекает текстовую информацию из макета.
Функция ИзвлечьТекстМакета(ОтчетОбъект, ИменаМакетов)
	ИзвлеченныйТекст = "";
	Если ТипЗнч(ИменаМакетов) = Тип("Строка") Тогда
		ИменаМакетов = СтрРазделить(ИменаМакетов, ",", Ложь);
	КонецЕсли;
	Для Каждого ИмяМакета Из ИменаМакетов Цикл
		Макет = ОтчетОбъект.ПолучитьМакет(СокрЛП(ИмяМакета));
		Если ТипЗнч(Макет) = Тип("ТабличныйДокумент") Тогда
			Низ					= Макет.ВысотаТаблицы;
			Право				= Макет.ШиринаТаблицы;
			ПроверенныеЯчейки	= Новый Соответствие;
			Для НомерКолонки = 1 По Право Цикл
				Для НомерСтроки = 1 По Низ Цикл
					Ячейка = Макет.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
					Если ПроверенныеЯчейки.Получить(Ячейка.Имя) = Неопределено Тогда
						ПроверенныеЯчейки.Вставить(Ячейка.Имя, Истина);
						Если ТипЗнч(Ячейка) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
							ТекстОбласти = СокрЛП(Ячейка.Текст);
							Если ТекстОбласти <> "" Тогда
								ИзвлеченныйТекст = ИзвлеченныйТекст + Символы.ПС + ТекстОбласти;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		ИначеЕсли ТипЗнч(Макет) = Тип("ТекстовыйДокумент") Тогда
			ИзвлеченныйТекст = ИзвлеченныйТекст + Символы.ПС + СокрЛП(Макет.ПолучитьТекст());
		КонецЕсли;
	КонецЦикла;
	ИзвлеченныйТекст = СокрЛ(ИзвлеченныйТекст);

	Возврат ИзвлеченныйТекст;
КонецФункции

// Представления группировок и полей из СКД.
Функция СформироватьПредставленияПолей(КомпоновщикНастроекКД)
	Результат = Новый Массив;

	ДополнитьМассивИзСтрокиСРазделителями(Результат, Строка(КомпоновщикНастроекКД.Настройки.Выбор));

	МассивКоллекций = Новый Массив;
	МассивКоллекций.Добавить(КомпоновщикНастроекКД.Настройки.Структура);
	Пока МассивКоллекций.Количество() > 0 Цикл
		Коллекция = МассивКоллекций[0];
		МассивКоллекций.Удалить(0);

		Для Каждого Настройка Из Коллекция Цикл
			Если ТипЗнч(Настройка) = Тип("НастройкиВложенногоОбъектаКомпоновкиДанных") Тогда
				Если Не Настройка.Использование Тогда
					Продолжить;
				КонецЕсли;
				Настройка = Настройка.Настройки;
			КонецЕсли;

			ДополнитьМассивИзСтрокиСРазделителями(Результат, Строка(Настройка.Выбор));

			Если ТипЗнч(Настройка) = Тип("НастройкиКомпоновкиДанных") Тогда
				МассивКоллекций.Добавить(Настройка.Структура);
			ИначеЕсли ТипЗнч(Настройка) = Тип("ГруппировкаКомпоновкиДанных") Тогда
				Если Не Настройка.Использование Тогда
					Продолжить;
				КонецЕсли;
				МассивКоллекций.Добавить(Настройка.Структура);
			ИначеЕсли ТипЗнч(Настройка) = Тип("ТаблицаКомпоновкиДанных") Тогда
				Если Не Настройка.Использование Тогда
					Продолжить;
				КонецЕсли;
				МассивКоллекций.Добавить(Настройка.Строки);
			ИначеЕсли ТипЗнч(Настройка) = Тип("ГруппировкаТаблицыКомпоновкиДанных") Тогда
				Если Не Настройка.Использование Тогда
					Продолжить;
				КонецЕсли;
				МассивКоллекций.Добавить(Настройка.Структура);
			ИначеЕсли ТипЗнч(Настройка) = Тип("ДиаграммаКомпоновкиДанных") Тогда
				Если Не Настройка.Использование Тогда
					Продолжить;
				КонецЕсли;
				МассивКоллекций.Добавить(Настройка.Серии);
				МассивКоллекций.Добавить(Настройка.Точки);
			ИначеЕсли ТипЗнч(Настройка) = Тип("ГруппировкаДиаграммыКомпоновкиДанных") Тогда
				Если Не Настройка.Использование Тогда
					Продолжить;
				КонецЕсли;
				МассивКоллекций.Добавить(Настройка.Структура);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат СтрСоединить(Результат, Символы.ПС);
КонецФункции

// Представления параметров и отборов из СКД.
Функция СформироватьПредставленияПараметровИОтборов(КомпоновщикНастроекКД)
	Результат = Новый Массив;

	НастройкиКД = КомпоновщикНастроекКД.Настройки;

	Режимы = РежимОтображенияЭлементаНастройкиКомпоновкиДанных;

	Для Каждого ПользовательскаяНастройка Из КомпоновщикНастроекКД.ПользовательскиеНастройки.Элементы Цикл
		ТипНастройки = ТипЗнч(ПользовательскаяНастройка);
		Если ТипНастройки = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ЭтоОтбор = Ложь;
		ИначеЕсли ТипНастройки = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЭтоОтбор = Истина;
		Иначе
			Продолжить;
		КонецЕсли;

		Если ПользовательскаяНастройка.РежимОтображения = Режимы.Недоступный Тогда
			Продолжить;
		КонецЕсли;

		Идентификатор = ПользовательскаяНастройка.ИдентификаторПользовательскойНастройки;

		ОбщаяНастройка = ВариантыОтчетовКлиентСервер.ПолучитьОбъектПоПользовательскомуИдентификатору(НастройкиКД, Идентификатор);
		Если ОбщаяНастройка = Неопределено Тогда
			Продолжить;
		ИначеЕсли ПользовательскаяНастройка.РежимОтображения = Режимы.Авто И ОбщаяНастройка.РежимОтображения <> Режимы.БыстрыйДоступ Тогда
			Продолжить;
		КонецЕсли;

		СтруктураПредставлений = Новый Структура("Представление, ПредставлениеПользовательскойНастройки", "", "");
		ЗаполнитьЗначенияСвойств(СтруктураПредставлений, ОбщаяНастройка);
		Если ЗначениеЗаполнено(СтруктураПредставлений.ПредставлениеПользовательскойНастройки) Тогда
			ЭлементЗаголовок = СтруктураПредставлений.ПредставлениеПользовательскойНастройки;
		ИначеЕсли ЗначениеЗаполнено(СтруктураПредставлений.Представление) Тогда
			ЭлементЗаголовок = СтруктураПредставлений.Представление;
		Иначе
			ДоступнаяНастройка = ВариантыОтчетовКлиентСервер.НайтиДоступнуюНастройку(НастройкиКД, ОбщаяНастройка);
			Если ДоступнаяНастройка <> Неопределено И ЗначениеЗаполнено(ДоступнаяНастройка.Заголовок) Тогда
				ЭлементЗаголовок = ДоступнаяНастройка.Заголовок;
			Иначе
				ЭлементЗаголовок = Строка(?(ЭтоОтбор, ОбщаяНастройка.ЛевоеЗначение, ОбщаяНастройка.Параметр));
			КонецЕсли;
		КонецЕсли;

		ЭлементЗаголовок = СокрЛП(ЭлементЗаголовок);
		Если ЭлементЗаголовок <> "" И Результат.Найти(ЭлементЗаголовок) = Неопределено Тогда
			Результат.Добавить(ЭлементЗаголовок);
		КонецЕсли;
	КонецЦикла;

	Возврат СтрСоединить(Результат, Символы.ПС);
КонецФункции

// Добавляет в Массив элементы из СтрокаСРазделителями, если их там нет.
Процедура ДополнитьМассивИзСтрокиСРазделителями(Массив, СтрокаСРазделителями)
	СтрокаСРазделителями = СокрЛП(СтрокаСРазделителями);
	Если СтрокаСРазделителями = "" Тогда
		Возврат;
	КонецЕсли;
	Позиция = СтрНайти(СтрокаСРазделителями, ",");
	Пока Позиция > 0 Цикл
		Подстрока = СокрП(Лев(СтрокаСРазделителями, Позиция - 1));
		Если Подстрока <> "" И Массив.Найти(Подстрока) = Неопределено Тогда
			Массив.Добавить(Подстрока);
		КонецЕсли;
		СтрокаСРазделителями = СокрЛ(Сред(СтрокаСРазделителями, Позиция + 1));
		Позиция = СтрНайти(СтрокаСРазделителями, ",");
	КонецЦикла;
	Если СтрокаСРазделителями <> "" И Массив.Найти(СтрокаСРазделителями) = Неопределено Тогда
		Массив.Добавить(СтрокаСРазделителями);
	КонецЕсли;
КонецПроцедуры

// Определяет подключен-ли отчет к общей форме отчета.
Функция ОтчетПодключенКОсновнойФорме(ОтчетМетаданные, ПоУмолчаниюВсеПодключены = Неопределено) Экспорт
	ФормаМетаданные = ОтчетМетаданные.ОсновнаяФорма;
	Если ФормаМетаданные = Неопределено Тогда
		Если ПоУмолчаниюВсеПодключены = Неопределено Тогда
			ПоУмолчаниюВсеПодключены = Истина;
		КонецЕсли;
		ОтчетПодключен = ПоУмолчаниюВсеПодключены;
	Иначе
		ОтчетПодключен = (ФормаМетаданные = Метаданные.ОбщиеФормы.ФормаОтчета);
	КонецЕсли;

	Возврат ОтчетПодключен;
КонецФункции

Функция УменьшитьКоличествоБыстрыхНастроек(ВариантОбъект, ОтчетОбъект)
	Перем НастройкиКД, ЭтоПредопределенный;

	Если ВариантОбъект = Неопределено Тогда
		Возврат Ложь; // Варианта нет в базе. Заполнение не требуется.
	КонецЕсли;

	// Схема компоновки, на основании которой будет выполняться отчет.
	СхемаКД = ОтчетОбъект.СхемаКомпоновкиДанных;
	Если СхемаКД = Неопределено Тогда
		Возврат Ложь; // Отчет не на СКД. Заполнение не требуется.
	КонецЕсли;

	// Чтение настроек из данных варианта.
	НастройкиКД = ВариантОбъект.Настройки.Получить();
	Если ТипЗнч(НастройкиКД) <> Тип("НастройкиКомпоновкиДанных") Тогда
		ТекстОшибки = СтрШаблон("Обнаружены пустые настройки пользовательского варианта ""%1"" отчета ""%2"".",  ВариантОбъект.КлючВарианта, ВариантОбъект.Отчет);
		ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Ошибка, ТекстОшибки, ВариантОбъект.Ссылка);
		Возврат Ложь; // Возникла проблема.
	КонецЕсли;

	// Описывает связь настроек компоновки данных и схемы компоновки данных.
	КомпоновщикНастроекКД = ОтчетОбъект.КомпоновщикНастроек;

	// Выполняет инициализацию компоновщика и его настроек (Настройки) источником доступных настроек.
	КомпоновщикНастроекКД.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКД));

	// Загружает настройки в компоновщик и сбрасывает пользовательские настройки.
	ВариантыОтчетовКлиентСервер.ЗагрузитьНастройки(КомпоновщикНастроекКД, НастройкиКД);

	УсловияВывода = Новый Структура;
	УсловияВывода.Вставить("ТолькоПользовательские", Истина);
	УсловияВывода.Вставить("ТолькоБыстрые",          Истина);
	УсловияВывода.Вставить("ИдентификаторТекущегоУзлаКД", Неопределено);

	НастройкиОтчета = НастройкиФормыОтчета(ВариантОбъект.Отчет, ВариантОбъект.КлючВарианта, ОтчетОбъект);

	Информация			= РасширеннаяИнформацияОНастройках(КомпоновщикНастроекКД, НастройкиОтчета, ОтчетОбъект, УсловияВывода);
	БыстрыеНастройки	= Информация.ПользовательскиеНастройки.Скопировать(Новый Структура("ВыводРазрешен, Быстрая", Истина, Истина));
	Если БыстрыеНастройки.Количество() <= 2 Тогда
		Возврат Ложь; // Уменьшение количества не требуется.
	КонецЕсли;

	Исключаемые = БыстрыеНастройки.НайтиСтроки(Новый Структура("ТипЭлементов", "СтандартныйПериод"));
	Для Каждого СтрокаТаблицы Из Исключаемые Цикл
		БыстрыеНастройки.Удалить(СтрокаТаблицы);
	КонецЦикла;

	Потрачено = Исключаемые.Количество();
	Для Каждого СтрокаТаблицы Из БыстрыеНастройки Цикл
		Если Потрачено < 2 Тогда
			Потрачено = Потрачено + 1;
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы.НастройкаВариантаКД.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	КонецЦикла;

	ВариантОбъект.Настройки = Новый ХранилищеЗначения(КомпоновщикНастроекКД.Настройки);

	Возврат Истина;
КонецФункции

Функция НастройкиФормыОтчета(ОтчетСсылка, КлючВарианта, ОтчетОбъект) Экспорт
	НастройкиОтчета		= ВариантыОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию();
	ОтчетыСНастройками	= ВариантыОтчетовСеверПовтИсп.Параметры().ОтчетыСНастройками;
	Если ОтчетыСНастройками.Найти(ОтчетСсылка) = Неопределено Тогда
		Возврат НастройкиОтчета;
	КонецЕсли;
	Если ОтчетОбъект = Неопределено Тогда
		Подключение = ПодключитьОтчетОбъект(ОтчетСсылка, Ложь);
		Если Подключение.Успех Тогда
			ОтчетОбъект = Подключение.Объект;
		Иначе
			Текст = СтрШаблон("Не удалось получить настройки отчета ""%1"":" + Символы.ПС + Подключение.ТекстОшибки, ОтчетСсылка);
			ЗаписатьВЖурнал(УровеньЖурналаРегистрации.Информация, Текст, ОтчетСсылка);

			Возврат НастройкиОтчета;
		КонецЕсли;
	КонецЕсли;

	ОтчетОбъект.ОпределитьНастройкиФормы(Неопределено, КлючВарианта, НастройкиОтчета);
	Если Не ГлобальныеНастройки().РазрешеноИзменятьВарианты Тогда
		НастройкиОтчета.РазрешеноИзменятьВарианты = Ложь;
	КонецЕсли;

	Возврат НастройкиОтчета;
КонецФункции

#Область Отчеты

Функция РасширеннаяИнформацияОНастройках(КомпоновщикНастроекКД, НастройкиОтчета, ОтчетОбъектИлиПолноеИмя, УсловияВывода = Неопределено) Экспорт
	НастройкиКД					= КомпоновщикНастроекКД.Настройки;
	ПользовательскиеНастройкиКД = КомпоновщикНастроекКД.ПользовательскиеНастройки;

	ДополнительныеНастройкиЭлементов = БазоваяПодсистемаКлиентСервер.СвойствоСтруктуры(ПользовательскиеНастройкиКД.ДополнительныеСвойства, "ЭлементыФормы");
	Если ДополнительныеНастройкиЭлементов = Неопределено Тогда
		ДополнительныеНастройкиЭлементов = Новый Соответствие;
	КонецЕсли;

	Информация = Новый Структура;
	Информация.Вставить("ТолькоПользовательские", Ложь);
	Информация.Вставить("ТолькоБыстрые", Ложь);
	Информация.Вставить("ИдентификаторТекущегоУзлаКД", Неопределено);
	Если УсловияВывода <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Информация, УсловияВывода);
	КонецЕсли;

	Информация.Вставить("НастройкиКД", НастройкиКД);

	Информация.Вставить("НастройкиОтчета",           НастройкиОтчета);
	Информация.Вставить("ОтчетОбъектИлиПолноеИмя",   ОтчетОбъектИлиПолноеИмя);
	Информация.Вставить("ДеревоВарианта",            ДеревоВарианта());
	Информация.Вставить("НастройкиВарианта",         ТаблицаНастроекВарианта());
	Информация.Вставить("ПользовательскиеНастройки", ТаблицаПользовательскихНастроек());

	Информация.Вставить("ОтключаемыеСвязи", Новый Массив);
	Информация.Вставить("Связи", Новый Структура);
	Информация.Связи.Вставить("ПоТипу",             ТаблицаСвязейПоТипу());
	Информация.Связи.Вставить("ПараметровВыбора",   ТаблицаСвязейПараметровВыбора());
	Информация.Связи.Вставить("ОбъектовМетаданных", ТаблицаСвязейОбъектовМетаданных(НастройкиОтчета, Информация.ОтчетОбъектИлиПолноеИмя));

	Информация.Вставить("ДополнительныеНастройкиЭлементов",   ДополнительныеНастройкиЭлементов);
	Информация.Вставить("СоответствиеИменОбъектовМетаданных", Новый Соответствие);
	Информация.Вставить("Поиск", Новый Структура);
	Информация.Поиск.Вставить("НастройкиВариантаПоПолюКД", Новый Соответствие);
	Информация.Поиск.Вставить("ПользовательскиеНастройки", Новый Соответствие);
	Информация.Вставить("ЕстьБыстрыеНастройки", Ложь);
	Информация.Вставить("ЕстьОбычныеНастройки", Ложь);
	Информация.Вставить("ЕстьНесуществующиеПоля", Ложь);

	Информация.Вставить("ЕстьВложенныеОтчеты", Ложь);
	Информация.Вставить("ЕстьВложенныеОтборы", Ложь);
	Информация.Вставить("ЕстьВложенноеОформление", Ложь);
	Информация.Вставить("ЕстьВложенныеПоля", Ложь);
	Информация.Вставить("ЕстьВложенныеСортировки", Ложь);

	Для Каждого ПользовательскаяНастройкаКД Из ПользовательскиеНастройкиКД.Элементы Цикл
		СвойстваНастройки								= Информация.ПользовательскиеНастройки.Добавить();
		СвойстваНастройки.ПользовательскаяНастройкаКД	= ПользовательскаяНастройкаКД;
		СвойстваНастройки.Идентификатор					= ПользовательскаяНастройкаКД.ИдентификаторПользовательскойНастройки;
		СвойстваНастройки.ИндексВКоллекции				= ПользовательскиеНастройкиКД.Элементы.Индекс(ПользовательскаяНастройкаКД);
		СвойстваНастройки.ИдентификаторКД				= ПользовательскиеНастройкиКД.ПолучитьИдентификаторПоОбъекту(ПользовательскаяНастройкаКД);
		СвойстваНастройки.Тип							= ВариантыОтчетовКлиентСервер.ТипНастройкиСтрокой(ТипЗнч(ПользовательскаяНастройкаКД));
		Информация.Поиск.ПользовательскиеНастройки.Вставить(СвойстваНастройки.Идентификатор, СвойстваНастройки);
	КонецЦикла;

	СтрокаДерева			= ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, НастройкиКД, Информация.ДеревоВарианта.Строки, "Отчет");
	СтрокаДерева.Глобальная = Истина;
	Информация.Вставить("ДеревоВариантаКорневаяСтрока", СтрокаДерева);
	Если Информация.ИдентификаторТекущегоУзлаКД = Неопределено Тогда
		Информация.ИдентификаторТекущегоУзлаКД = СтрокаДерева.ИдентификаторКД;
		Если Не Информация.ТолькоПользовательские Тогда
			СтрокаДерева.ВыводРазрешен = Истина;
		КонецЕсли;
	КонецЕсли;

	ЗарегистрироватьНастройкиВарианта(НастройкиКД, Информация);

	ЗарегистрироватьСвязиОтВедущих(Информация);

	Возврат Информация;
КонецФункции

Функция ДеревоВарианта()
	Результат = Новый ДеревоЗначений;

	// Узлы СКД.
	Результат.Колонки.Добавить("УзелКД");
	Результат.Колонки.Добавить("ДоступнаяНастройкаКД");
	Результат.Колонки.Добавить("ПользовательскаяНастройкаКД");

	// Прикладная структура.
	Результат.Колонки.Добавить("ПользовательскаяНастройка");

	// Поиск этой настройки в узле.
	Результат.Колонки.Добавить("ИдентификаторКД");

	// Связь с узлами СКД.
	Результат.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));

	// Тип настройки.
	Результат.Колонки.Добавить("Тип", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Подтип", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Состояние", Новый ОписаниеТипов("Строка"));

	Результат.Колонки.Добавить("ЕстьСтруктура", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ЕстьПоляИОформление", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Глобальная", Новый ОписаниеТипов("Булево"));

	// Содержимое настройки.
	Результат.Колонки.Добавить("СодержитОтборы", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СодержитПоля", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СодержитСортировки", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СодержитУсловноеОформление", Новый ОписаниеТипов("Булево"));

	// Вывод.
	Результат.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПредставлениеПоУмолчанию", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Заголовок", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВыводРазрешен", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ВыводитьТолькоФлажок", Новый ОписаниеТипов("Булево"));

	Возврат Результат;
КонецФункции

Функция ТаблицаНастроекВарианта()
	Результат = Новый ДеревоЗначений;

	// Узлы СКД.
	Результат.Колонки.Добавить("ЭлементКД");
	Результат.Колонки.Добавить("ДоступнаяНастройкаКД");
	Результат.Колонки.Добавить("ПользовательскаяНастройкаКД");

	// Прикладная структура.
	Результат.Колонки.Добавить("СтрокаДерева");
	Результат.Колонки.Добавить("ПользовательскаяНастройка");
	Результат.Колонки.Добавить("Владелец");
	Результат.Колонки.Добавить("Глобальная", Новый ОписаниеТипов("Булево"));

	// Поиск этой настройки в узле.
	Результат.Колонки.Добавить("ИмяКоллекции", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдентификаторКД");

	// Связь с узлами СКД.
	Результат.Колонки.Добавить("Идентификатор",			Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдентификаторЭлемента",	Новый ОписаниеТипов("Строка"));

	// Описание настройки.
	Результат.Колонки.Добавить("Тип",		Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Подтип",	Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Состояние",	Новый ОписаниеТипов("Строка"));

	Результат.Колонки.Добавить("ПолеКД");
	Результат.Колонки.Добавить("Значение");
	Результат.Колонки.Добавить("ВидСравнения");
	Результат.Колонки.Добавить("ВводСписком", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ИнформацияОТипах");
	Результат.Колонки.Добавить("ФормаВыбора", Новый ОписаниеТипов("Строка"));

	Результат.Колонки.Добавить("ОтмеченныеЗначения");
	Результат.Колонки.Добавить("ПараметрыВыбора");

	Результат.Колонки.Добавить("СвязьПоТипу");
	Результат.Колонки.Добавить("СвязиПараметровВыбора");
	Результат.Колонки.Добавить("СвязиПоМетаданным");
	Результат.Колонки.Добавить("ОграничениеТипа");

	// API
	Результат.Колонки.Добавить("ОписаниеТипов");
	Результат.Колонки.Добавить("ЗначенияДляВыбора");
	Результат.Колонки.Добавить("ЗапросЗначенийВыбора");
	Результат.Колонки.Добавить("СписокЗначенийПереопределен",           Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("БыстрыйВыбор",                          Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ОграничиватьВыборУказаннымиЗначениями", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СобытиеПриИзменении",					Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Ширина",								Новый ОписаниеТипов("Число"));
	Результат.Колонки.Добавить("ВыводитьВГруппеОсновныхНастроек",		Новый ОписаниеТипов("Булево"));

	// Вывод.
	Результат.Колонки.Добавить("ПредставлениеПоУмолчанию",	Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Представление",				Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВыводРазрешен",				Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ВыводитьФлажок",			Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ВыборГруппИЭлементов");
	Результат.Колонки.Добавить("ВыводитьТолькоФлажок",		Новый ОписаниеТипов("Булево"));

	Возврат Результат;
КонецФункции

Функция ТаблицаПользовательскихНастроек()
	Результат = Новый ТаблицаЗначений;

	// Узлы СКД.
	Результат.Колонки.Добавить("УзелКД");
	Результат.Колонки.Добавить("НастройкаВариантаКД");
	Результат.Колонки.Добавить("ПользовательскаяНастройкаКД");
	Результат.Колонки.Добавить("ДоступнаяНастройкаКД");

	// Прикладная структура.
	Результат.Колонки.Добавить("СтрокаДерева");
	Результат.Колонки.Добавить("НастройкаВарианта");

	// Поиск этой настройки в узле.
	Результат.Колонки.Добавить("ИдентификаторКД");
	Результат.Колонки.Добавить("ИндексВКоллекции", Новый ОписаниеТипов("Число"));

	// Связь с узлами СКД.
	Результат.Колонки.Добавить("Идентификатор",			Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ИдентификаторЭлемента",	Новый ОписаниеТипов("Строка"));

	// Описание настройки.
	Результат.Колонки.Добавить("Тип",		Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Подтип",	Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Состояние",	Новый ОписаниеТипов("Строка"));

	Результат.Колонки.Добавить("ПолеКД");
	Результат.Колонки.Добавить("Значение");
	Результат.Колонки.Добавить("ВидСравнения");
	Результат.Колонки.Добавить("ВводСписком", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ИнформацияОТипах");

	Результат.Колонки.Добавить("ОтмеченныеЗначения");
	Результат.Колонки.Добавить("ПараметрыВыбора");

	// API
	Результат.Колонки.Добавить("ОписаниеТипов");
	Результат.Колонки.Добавить("ЗначенияДляВыбора");
	Результат.Колонки.Добавить("ЗапросЗначенийВыбора");
	Результат.Колонки.Добавить("БыстрыйВыбор",                          Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ОграничиватьВыборУказаннымиЗначениями", Новый ОписаниеТипов("Булево"));

	// Вывод.
	Результат.Колонки.Добавить("ПредставлениеПоУмолчанию",	Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Представление",				Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("Быстрая",					Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Обычная",					Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ВыводРазрешен",				Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ВыводитьФлажок",			Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ВыводитьТолькоФлажок",		Новый ОписаниеТипов("Булево"));

	Результат.Колонки.Добавить("ТипЭлементов", Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ВыборГруппИЭлементов");

	// Дополнительные свойства.
	Результат.Колонки.Добавить("Дополнительно", Новый ОписаниеТипов("Структура"));

	Возврат Результат;
КонецФункции

Функция ТаблицаСвязейПоТипу()
	// Связи из СКД.
	ТаблицаСвязейПоТипу = Новый ТаблицаЗначений;
	ТаблицаСвязейПоТипу.Колонки.Добавить("Ведущий");
	ТаблицаСвязейПоТипу.Колонки.Добавить("ВедущийПолеКД");
	ТаблицаСвязейПоТипу.Колонки.Добавить("Подчиненный");
	ТаблицаСвязейПоТипу.Колонки.Добавить("ПодчиненныйИмяПараметра");

	Возврат ТаблицаСвязейПоТипу;
КонецФункции

Функция ТаблицаСвязейПараметровВыбора()
	ТаблицаСвязейПараметровВыбора = Новый ТаблицаЗначений;
	ТаблицаСвязейПараметровВыбора.Колонки.Добавить("Ведущий");
	ТаблицаСвязейПараметровВыбора.Колонки.Добавить("ВедущийПолеКД");
	ТаблицаСвязейПараметровВыбора.Колонки.Добавить("Подчиненный");
	ТаблицаСвязейПараметровВыбора.Колонки.Добавить("ПодчиненныйИмяПараметра");
	ТаблицаСвязейПараметровВыбора.Колонки.Добавить("Действие");

	Возврат ТаблицаСвязейПараметровВыбора;
КонецФункции

Функция ТаблицаСвязейОбъектовМетаданных(НастройкиОтчета, ОтчетОбъектИлиПолноеИмя)
	// Связи из метаданных.
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВедущийТип",          Новый ОписаниеТипов("Тип"));
	Результат.Колонки.Добавить("ПодчиненныйТип",      Новый ОписаниеТипов("Тип"));
	Результат.Колонки.Добавить("ПодчиненныйРеквизит", Новый ОписаниеТипов("Строка"));

	// Механизмы расширения.
	Если НастройкиОтчета.События.ДополнитьСвязиОбъектовМетаданных Тогда // ... можно переопределить локально для отчета.
		ОтчетОбъект(ОтчетОбъектИлиПолноеИмя).ДополнитьСвязиОбъектовМетаданных(Результат);
	КонецЕсли;

	Результат.Колонки.Добавить("ЕстьВедущие",			Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ЕстьПодчиненные",		Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("Ведущие",				Новый ОписаниеТипов("Массив"));
	Результат.Колонки.Добавить("Подчиненные",			Новый ОписаниеТипов("Массив"));
	Результат.Колонки.Добавить("ВедущийПолноеИмя",		Новый ОписаниеТипов("Строка"));
	Результат.Колонки.Добавить("ПодчиненныйПолноеИмя",	Новый ОписаниеТипов("Строка"));

	Возврат Результат;
КонецФункции

Функция ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, УзелКД, НаборСтрокДерева, Подтип = "")
	СтрокаДерева		= НаборСтрокДерева.Добавить();
	СтрокаДерева.УзелКД = УзелКД;
	СтрокаДерева.Тип	= ВариантыОтчетовКлиентСервер.ТипНастройкиСтрокой(ТипЗнч(УзелКД));
	СтрокаДерева.Подтип = Подтип;
	Если СтрокаДерева.Тип <> "Настройки" Тогда
		СтрокаДерева.Идентификатор = УзелКД.ИдентификаторПользовательскойНастройки;
	КонецЕсли;

	СтрокаДерева.ИдентификаторКД = НастройкиКД.ПолучитьИдентификаторПоОбъекту(УзелКД);
	СтрокаДерева.Глобальная = (Подтип = "Отчет");

	Если СтрокаДерева.Тип = "Настройки" Тогда
		СтрокаДерева.ЕстьСтруктура			= Истина;
		СтрокаДерева.ЕстьПоляИОформление	= Истина;
	ИначеЕсли СтрокаДерева.Тип = "Группировка" Или СтрокаДерева.Тип = "ГруппировкаДиаграммы" Или СтрокаДерева.Тип = "ГруппировкаТаблицы" Тогда
		СтрокаДерева.ЕстьСтруктура			= Истина;
		СтрокаДерева.ЕстьПоляИОформление	= Истина;
	ИначеЕсли СтрокаДерева.Тип = "Таблица" Тогда
		СтрокаДерева.ЕстьПоляИОформление	= Истина;
	ИначеЕсли СтрокаДерева.Тип = "Диаграмма" Тогда
		СтрокаДерева.ЕстьПоляИОформление	= Истина;
	ИначеЕсли СтрокаДерева.Тип = "НастройкиВложенногоОбъекта" Тогда
		СтрокаДерева.ДоступнаяНастройкаКД	= НастройкиКД.ДоступныеОбъекты.Элементы.Найти(УзелКД.ИдентификаторОбъекта);
	ИначеЕсли СтрокаДерева.Тип = "КоллекцияЭлементовСтруктурыТаблицы" Или СтрокаДерева.Тип = "КоллекцияЭлементовСтруктурыДиаграммы" Тогда
		// см. далее.
	Иначе
		Возврат СтрокаДерева;
	КонецЕсли;

	ЗаполнитьПредставлениеИСостояниеНастройки(СтрокаДерева, СтрокаДерева.УзелКД, Неопределено, СтрокаДерева.ДоступнаяНастройкаКД);

	Если СтрокаДерева.ЕстьПоляИОформление Тогда
		СтрокаДерева.Заголовок					= ЗаголовокИзПараметровВывода(УзелКД.ПараметрыВывода);
		СтрокаДерева.СодержитПоля               = НастройкиКД.НаличиеВыбораУЭлемента(УзелКД);
		СтрокаДерева.СодержитУсловноеОформление = НастройкиКД.НаличиеУсловногоОформленияУЭлемента(УзелКД);
	КонецЕсли;

	Если Не Информация.ТолькоБыстрые Тогда
		СтрокаДерева.ВыводРазрешен = (СтрокаДерева.ИдентификаторКД = Информация.ИдентификаторТекущегоУзлаКД);
	КонецЕсли;

	Если ТипЗнч(СтрокаДерева.Идентификатор) = Тип("Строка") И Не ПустаяСтрока(СтрокаДерева.Идентификатор) Тогда
		СвойстваНастройки = Информация.Поиск.ПользовательскиеНастройки.Получить(СтрокаДерева.Идентификатор);
		Если СвойстваНастройки <> Неопределено Тогда
			СтрокаДерева.ПользовательскаяНастройка   = СвойстваНастройки;
			СтрокаДерева.ПользовательскаяНастройкаКД = СвойстваНастройки.ПользовательскаяНастройкаКД;
			ЗарегистрироватьПользовательскуюНастройку(Информация, СвойстваНастройки, СтрокаДерева, Неопределено);
			Если ЗначениеЗаполнено(СтрокаДерева.Заголовок) Тогда
				СвойстваНастройки.Представление = СтрокаДерева.Заголовок;
			КонецЕсли;
			Если Информация.ТолькоПользовательские Тогда
				СтрокаДерева.ВыводРазрешен	= СвойстваНастройки.ВыводРазрешен;
				СтрокаДерева.Состояние		= СвойстваНастройки.Состояние;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если СтрокаДерева.ЕстьСтруктура Тогда
		Для Каждого ВложенныйЭлемент Из УзелКД.Структура Цикл
			ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, ВложенныйЭлемент, СтрокаДерева.Строки);
		КонецЦикла;
		СтрокаДерева.СодержитОтборы     = НастройкиКД.НаличиеОтбораУЭлемента(УзелКД);
		СтрокаДерева.СодержитСортировки = НастройкиКД.НаличиеПорядкаУЭлемента(УзелКД);
	КонецЕсли;

	Если СтрокаДерева.Тип = "Таблица" Тогда
		ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, УзелКД.Строки, СтрокаДерева.Строки, "ТаблицаСтроки");
		ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, УзелКД.Колонки, СтрокаДерева.Строки, "ТаблицаКолонки");
	ИначеЕсли СтрокаДерева.Тип = "Диаграмма" Тогда
		ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, УзелКД.Точки, СтрокаДерева.Строки, "ДиаграммаТочки");
		ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, УзелКД.Серии, СтрокаДерева.Строки, "ДиаграммаСерии");
	ИначеЕсли СтрокаДерева.Тип = "КоллекцияЭлементовСтруктурыТаблицы"
		Или СтрокаДерева.Тип = "КоллекцияЭлементовСтруктурыДиаграммы" Тогда
		Для Каждого ВложенныйЭлемент Из УзелКД Цикл
			ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, ВложенныйЭлемент, СтрокаДерева.Строки);
		КонецЦикла;
	ИначеЕсли СтрокаДерева.Тип = "НастройкиВложенногоОбъекта" Тогда
		Информация.ЕстьВложенныеОтчеты = Истина;
		ЗарегистрироватьУзелДереваВарианта(Информация, НастройкиКД, УзелКД.Настройки, СтрокаДерева.Строки);
	КонецЕсли;

	Если Не СтрокаДерева.Глобальная Тогда
		Если СтрокаДерева.СодержитПоля Тогда
			Информация.ЕстьВложенныеПоля = Истина;
		КонецЕсли;
		Если СтрокаДерева.СодержитУсловноеОформление Тогда
			Информация.ЕстьВложенноеОформление = Истина;
		КонецЕсли;
		Если СтрокаДерева.СодержитОтборы Тогда
			Информация.ЕстьВложенныеОтборы = Истина;
		КонецЕсли;
		Если СтрокаДерева.СодержитСортировки Тогда
			Информация.ЕстьВложенныеСортировки = Истина;
		КонецЕсли;
	КонецЕсли;

	Возврат СтрокаДерева;
КонецФункции

Процедура ЗарегистрироватьНастройкиВарианта(НастройкиКД, Информация)
	ДеревоВарианта		= Информация.ДеревоВарианта;
	НастройкиВарианта	= Информация.НастройкиВарианта;

	Найденные = ДеревоВарианта.Строки.НайтиСтроки(Новый Структура("ЕстьСтруктура", Истина), Истина);
	Для Каждого СтрокаДерева Из Найденные Цикл
		ЗарегистрироватьУзелНастроек(НастройкиКД, Информация, СтрокаДерева, "Отбор");
		ЗарегистрироватьУзелНастроек(НастройкиКД, Информация, СтрокаДерева, "Порядок");
		ЗарегистрироватьУзелНастроек(НастройкиКД, Информация, СтрокаДерева, "Структура");
	КонецЦикла;

	Найденные = ДеревоВарианта.Строки.НайтиСтроки(Новый Структура("ЕстьПоляИОформление", Истина), Истина);
	Для Каждого СтрокаДерева Из Найденные Цикл
		ЗарегистрироватьУзелНастроек(НастройкиКД, Информация, СтрокаДерева, "Выбор");
		ЗарегистрироватьУзелНастроек(НастройкиКД, Информация, СтрокаДерева, "УсловноеОформление");
		ЗарегистрироватьУзелНастроек(НастройкиКД, Информация, СтрокаДерева, "ПараметрыВывода");
	КонецЦикла;
	
	Найденные = ДеревоВарианта.Строки.НайтиСтроки(Новый Структура("Тип", "Настройки"), Истина);
	Для Каждого СтрокаДерева Из Найденные Цикл
		ЗарегистрироватьУзелНастроек(НастройкиКД, Информация, СтрокаДерева, "ПараметрыДанных");
	КонецЦикла;
КонецПроцедуры

Процедура ЗарегистрироватьСвязиОтВедущих(Информация)
	Связи = Информация.Связи;

	// Регистрация связи параметров выбора (динамическая связь, отключаемая флажком Использование).
	Найденные = Связи.ОбъектовМетаданных.НайтиСтроки(Новый Структура("ЕстьПодчиненные, ЕстьВедущие", Истина, Истина));
	Для Каждого СвязьПоМетаданным Из Найденные Цикл
		Для Каждого Ведущий Из СвязьПоМетаданным.Ведущие Цикл
			Для Каждого Подчиненный Из СвязьПоМетаданным.Подчиненные Цикл
				Если Ведущий.ВыводРазрешен Тогда // Отключаемая связь.
					ОписаниеСвязи = Новый Структура;
					ОписаниеСвязи.Вставить("ТипСвязи",                "ПоМетаданным");
					ОписаниеСвязи.Вставить("Ведущий",                 Ведущий);
					ОписаниеСвязи.Вставить("Подчиненный",             Подчиненный);
					ОписаниеСвязи.Вставить("ВедущийТип",              СвязьПоМетаданным.ВедущийТип);
					ОписаниеСвязи.Вставить("ПодчиненныйТип",          СвязьПоМетаданным.ПодчиненныйТип);
					ОписаниеСвязи.Вставить("ПодчиненныйИмяПараметра", СвязьПоМетаданным.ПодчиненныйРеквизит);
					Информация.ОтключаемыеСвязи.Добавить(ОписаниеСвязи);
					Подчиненный.СвязиПоМетаданным.Добавить(ОписаниеСвязи);
				Иначе // Фиксированный параметр выбора.
					Подчиненный.ПараметрыВыбора.Добавить(Новый ПараметрВыбора(СвязьПоМетаданным.ПодчиненныйРеквизит, Ведущий.Значение));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	// Связи по типу.
	Для Каждого СвязьПоТипу Из Связи.ПоТипу Цикл
		Ведущий = Информация.Поиск.НастройкиВариантаПоПолюКД.Получить(СвязьПоТипу.ВедущийПолеКД);
		Если Ведущий = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Подчиненный = СвязьПоТипу.Подчиненный;
		Если Ведущий.ВыводРазрешен Тогда // Отключаемая связь.
			ОписаниеСвязи = Новый Структура;
			ОписаниеСвязи.Вставить("ТипСвязи",                "ПоТипу");
			ОписаниеСвязи.Вставить("Ведущий",                 Ведущий);
			ОписаниеСвязи.Вставить("Подчиненный",             Подчиненный);
			ОписаниеСвязи.Вставить("ПодчиненныйИмяПараметра", СвязьПоТипу.ПодчиненныйИмяПараметра);
			Информация.ОтключаемыеСвязи.Добавить(ОписаниеСвязи);
			Подчиненный.СвязьПоТипу = ОписаниеСвязи;
		Иначе // Фиксированное ограничения типа.
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(Ведущий.Значение));
			Подчиненный.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
		КонецЕсли;
	КонецЦикла;

	// Связи параметров выбора.
	Для Каждого СвязьПараметровВыбора Из Связи.ПараметровВыбора Цикл
		Ведущий     = СвязьПараметровВыбора.Ведущий;
		Подчиненный = СвязьПараметровВыбора.Подчиненный;
		Если Ведущий = Неопределено Тогда
			ЛучшийВариант = 99;
			Найденные = Информация.НастройкиВарианта.Строки.НайтиСтроки(Новый Структура("ПолеКД", СвязьПараметровВыбора.ВедущийПолеКД), Истина);
			Для Каждого ПотенциальныйРодитель Из Найденные Цикл
				Если ПотенциальныйРодитель.Тип <> "ЭлементОтбора" И ПотенциальныйРодитель.Тип <> "ЗначениеПараметраНастроек" Тогда
					Продолжить;
				КонецЕсли;
				Если ПотенциальныйРодитель.Родитель = Подчиненный.Родитель Тогда // Элементы в одной группе.
					Если Не ПустаяСтрока(ПотенциальныйРодитель.ИдентификаторЭлемента) Тогда // Ведущий выведен в пользовательские.
						Ведущий			= ПотенциальныйРодитель;
						ЛучшийВариант	= 0;
						Прервать; // Самый лучший вариант.
					Иначе
						Ведущий			= ПотенциальныйРодитель;
						ЛучшийВариант	= 1;
					КонецЕсли;
				ИначеЕсли ЛучшийВариант > 2 И ПотенциальныйРодитель.Владелец = Подчиненный.Владелец Тогда // Элементы в одной коллекции.
					Если Не ПустаяСтрока(ПотенциальныйРодитель.ИдентификаторЭлемента) Тогда // Ведущий выведен в пользовательские.
						Если ЛучшийВариант > 2 Тогда
							Ведущий			= ПотенциальныйРодитель;
							ЛучшийВариант	= 2;
						КонецЕсли;
					Иначе
						Если ЛучшийВариант > 3 Тогда
							Ведущий			= ПотенциальныйРодитель;
							ЛучшийВариант	= 3;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ЛучшийВариант > 4 И ПотенциальныйРодитель.СтрокаДерева = Подчиненный.СтрокаДерева Тогда // Элементы в одном узле.
					Если Не ПустаяСтрока(ПотенциальныйРодитель.ИдентификаторЭлемента) Тогда // Ведущий выведен в пользовательские.
						Если ЛучшийВариант > 4 Тогда
							Ведущий			= ПотенциальныйРодитель;
							ЛучшийВариант	= 4;
						КонецЕсли;
					Иначе
						Если ЛучшийВариант > 5 Тогда
							Ведущий			= ПотенциальныйРодитель;
							ЛучшийВариант	= 5;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ЛучшийВариант > 6 Тогда
					Ведущий			= ПотенциальныйРодитель;
					ЛучшийВариант	= 6;
				КонецЕсли;
			КонецЦикла;
			Если Ведущий = Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если Ведущий.ВыводРазрешен Тогда // Отключаемая связь.
			ОписаниеСвязи = Новый Структура;
			ОписаниеСвязи.Вставить("ТипСвязи",      			"ПараметровВыбора");
			ОписаниеСвязи.Вставить("Ведущий",       			Ведущий);
			ОписаниеСвязи.Вставить("Подчиненный",				Подчиненный);
			ОписаниеСвязи.Вставить("ПодчиненныйИмяПараметра",	СвязьПараметровВыбора.ПодчиненныйИмяПараметра);
			ОписаниеСвязи.Вставить("ПодчиненныйДействие",		СвязьПараметровВыбора.Действие);
			Информация.ОтключаемыеСвязи.Добавить(ОписаниеСвязи);
			Подчиненный.СвязиПараметровВыбора.Добавить(ОписаниеСвязи);
		Иначе // Фиксированный параметр выбора.
			Если ТипЗнч(Ведущий.Значение) = Тип("ПолеКомпоновкиДанных") Тогда
				Продолжить; // Расширенная работа с отборами по полю компоновки данных не поддерживается.
			КонецЕсли;
			Попытка
				ЗначениеЗаполнено = ЗначениеЗаполнено(Ведущий.Значение);
			Исключение
				ЗначениеЗаполнено = Истина;
			КонецПопытки;
			Если Не ЗначениеЗаполнено Тогда
				Продолжить;
			КонецЕсли;
			Подчиненный.ПараметрыВыбора.Добавить(Новый ПараметрВыбора(СвязьПараметровВыбора.ПодчиненныйИмяПараметра, Ведущий.Значение));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗарегистрироватьУзелНастроек(НастройкиКД, Информация, СтрокаДерева, ИмяКоллекции, НаборЭлементов = Неопределено, Родитель = Неопределено, Владелец = Неопределено)
	УзелКД = СтрокаДерева.УзелКД[ИмяКоллекции];

	Владелец				= Информация.НастройкиВарианта.Строки.Добавить();
	Владелец.СтрокаДерева	= СтрокаДерева;
	Если ИмяКоллекции <> "ПараметрыДанных" И ИмяКоллекции <> "ПараметрыВывода" Тогда
		Владелец.Идентификатор = УзелКД.ИдентификаторПользовательскойНастройки;
	КонецЕсли;
	Владелец.Тип           = ВариантыОтчетовКлиентСервер.ТипНастройкиСтрокой(ТипЗнч(УзелКД));
	Владелец.ИмяКоллекции  = ИмяКоллекции;
	Владелец.Глобальная    = СтрокаДерева.Глобальная;
	Владелец.ЭлементКД     = УзелКД;
	Владелец.ВыводРазрешен = Не Информация.ТолькоБыстрые И СтрокаДерева.ВыводРазрешен;

	Если ТипЗнч(Владелец.Идентификатор) = Тип("Строка") И Не ПустаяСтрока(Владелец.Идентификатор) Тогда
		СвойстваНастройки = Информация.Поиск.ПользовательскиеНастройки.Получить(Владелец.Идентификатор);
		Если СвойстваНастройки <> Неопределено Тогда
			Владелец.ПользовательскаяНастройка = СвойстваНастройки;
			ЗарегистрироватьПользовательскуюНастройку(Информация, СвойстваНастройки, Неопределено, Владелец);
			СвойстваНастройки.ПараметрыВыбора = Новый Массив;
			Владелец.ПараметрыВыбора          = Новый Массив;
			Владелец.СвязиПараметровВыбора    = Новый Массив;
			Владелец.СвязиПоМетаданным        = Новый Массив;
			Если Информация.ТолькоПользовательские Тогда
				Владелец.ВыводРазрешен = СвойстваНастройки.ВыводРазрешен;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если Владелец.ВыводРазрешен Тогда
		Если Владелец.ПользовательскаяНастройка = Неопределено Тогда
			ЗаполнитьПредставлениеИСостояниеНастройки(Владелец, Владелец.ЭлементКД, Неопределено, Неопределено);
		Иначе
			ЗаполнитьЗначенияСвойств(Владелец, Владелец.ПользовательскаяНастройка, "Представление, ВыводитьТолькоФлажок");
		КонецЕсли;
	КонецЕсли;

	Если ИмяКоллекции = "Отбор" Или ИмяКоллекции = "ПараметрыДанных" Или ИмяКоллекции = "ПараметрыВывода" Или ИмяКоллекции = "УсловноеОформление" Тогда
		ЗарегистрироватьЭлементыНастроек(Информация, УзелКД, УзелКД.Элементы, Владелец, Владелец);
	ИначеЕсли Не Информация.ТолькоБыстрые И (ИмяКоллекции = "Порядок" Или ИмяКоллекции = "Выбор") Тогда
		ЗарегистрироватьЭлементыНастроек(Информация, УзелКД, УзелКД.Элементы, Владелец, Владелец);
	КонецЕсли;
КонецПроцедуры

Процедура ЗарегистрироватьЭлементыНастроек(Информация, УзелКД, НаборЭлементов, Владелец, Родитель)
	ЕстьНеПомеченные	= Ложь;
	ЕстьПомеченные		= Ложь;

	Для Каждого ЭлементКД Из НаборЭлементов Цикл
		НастройкаВарианта					= Родитель.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(НастройкаВарианта, Владелец, "СтрокаДерева, ИмяКоллекции, Глобальная");
		НастройкаВарианта.Тип				= ВариантыОтчетовКлиентСервер.ТипНастройкиСтрокой(ТипЗнч(ЭлементКД));
		НастройкаВарианта.ИдентификаторКД	= УзелКД.ПолучитьИдентификаторПоОбъекту(ЭлементКД);
		НастройкаВарианта.Владелец			= Владелец;
		НастройкаВарианта.ЭлементКД			= ЭлементКД;
		НастройкаВарианта.ВыводРазрешен		= Не Информация.ТолькоБыстрые И Владелец.ВыводРазрешен;
		НастройкаВарианта.ВыводитьФлажок	= Истина;

		Если НастройкаВарианта.Тип = "АвтоЭлементПорядка"
			Или НастройкаВарианта.Тип = "АвтоВыбранноеПоле"
			Или НастройкаВарианта.Тип = "ГруппаВыбранныхПолей" Тогда

			// Действие не требуется.
		ИначеЕсли НастройкаВарианта.Тип = "ЭлементПорядка" Тогда
			НастройкаВарианта.Значение				= ЭлементКД.ТипУпорядочивания;
			НастройкаВарианта.ПолеКД				= ЭлементКД.Поле;
			НастройкаВарианта.ДоступнаяНастройкаКД	= УзелКД.ДоступныеПоляПорядка.НайтиПоле(ЭлементКД.Поле);
			Если НастройкаВарианта.ДоступнаяНастройкаКД = Неопределено Тогда
				НастройкаВарианта.Состояние = "ПометкаУдаления";
			КонецЕсли;
		ИначеЕсли НастройкаВарианта.Тип = "ВыбранноеПоле" Тогда
			НастройкаВарианта.ПолеКД				= ЭлементКД.Поле;
			НастройкаВарианта.ДоступнаяНастройкаКД	= УзелКД.ДоступныеПоляВыбора.НайтиПоле(ЭлементКД.Поле);
			Если НастройкаВарианта.ДоступнаяНастройкаКД = Неопределено Тогда
				НастройкаВарианта.Состояние = "ПометкаУдаления";
			КонецЕсли;
		Иначе
			НастройкаВарианта.Идентификатор			= ЭлементКД.ИдентификаторПользовательскойНастройки;
		КонецЕсли;

		Если НастройкаВарианта.Тип = "ВыбранныеПоля"
			Или НастройкаВарианта.Тип = "Порядок"
			Или НастройкаВарианта.Тип = "КоллекцияЭлементовСтруктурыТаблицы"
			Или НастройкаВарианта.Тип = "КоллекцияЭлементовСтруктурыДиаграммы"
			Или НастройкаВарианта.Тип = "Отбор"
			Или НастройкаВарианта.Тип = "УсловноеОформление"
			Или НастройкаВарианта.Тип = "СтруктураНастроек" Тогда

			НастройкаВарианта.ВыводитьФлажок = Ложь;
		КонецЕсли;

		Если НастройкаВарианта.Тип = "ЭлементОтбора" Или НастройкаВарианта.Тип = "ЗначениеПараметраНастроек" Тогда
			ЗарегистрироватьПоле(Информация, УзелКД, ЭлементКД, НастройкаВарианта);
			ЗарегистрироватьТипыИСвязи(Информация, НастройкаВарианта);
		КонецЕсли;

		СвойстваНастройки = Неопределено;
		Если ТипЗнч(НастройкаВарианта.Идентификатор) = Тип("Строка") И Не ПустаяСтрока(НастройкаВарианта.Идентификатор) Тогда
			СвойстваНастройки = Информация.Поиск.ПользовательскиеНастройки.Получить(НастройкаВарианта.Идентификатор);
		КонецЕсли;
		Если СвойстваНастройки <> Неопределено Тогда
			НастройкаВарианта.ПользовательскаяНастройка = СвойстваНастройки;
			ЗарегистрироватьПользовательскуюНастройку(Информация, СвойстваНастройки, Неопределено, НастройкаВарианта);
			Если Информация.ТолькоПользовательские Тогда
				НастройкаВарианта.ВыводРазрешен = СвойстваНастройки.ВыводРазрешен;
				НастройкаВарианта.Значение      = СвойстваНастройки.Значение;
				НастройкаВарианта.ВидСравнения  = СвойстваНастройки.ВидСравнения;
			КонецЕсли;
		КонецЕсли;

		Если НастройкаВарианта.ВыводРазрешен Тогда
			ЗаполнитьПредставлениеИСостояниеНастройки(НастройкаВарианта, НастройкаВарианта.ЭлементКД, Неопределено, НастройкаВарианта.ДоступнаяНастройкаКД);
			Если НастройкаВарианта.Состояние = "ПометкаУдаления" Тогда
				Информация.ЕстьНесуществующиеПоля = Истина;
				НастройкаВарианта.ВыводРазрешен = Ложь;
			ИначеЕсли НастройкаВарианта.Тип = "ЭлементОтбора" Или НастройкаВарианта.Тип = "ЗначениеПараметраНастроек" Тогда
				ПриОпределенииПараметровВыбора(Информация, НастройкаВарианта);
			КонецЕсли;
		КонецЕсли;

		Если НастройкаВарианта.Тип = "ГруппаЭлементовОтбора" Тогда
			НастройкаВарианта.Значение = ЭлементКД.ТипГруппы;
			ЗарегистрироватьЭлементыНастроек(Информация, УзелКД, ЭлементКД.Элементы, Владелец, НастройкаВарианта);
		ИначеЕсли НастройкаВарианта.Тип = "ГруппаВыбранныхПолей" Тогда
			НастройкаВарианта.Значение = ЭлементКД.Расположение;
			ЗарегистрироватьЭлементыНастроек(Информация, УзелКД, ЭлементКД.Элементы, Владелец, НастройкаВарианта);
		ИначеЕсли НастройкаВарианта.Тип = "ЗначениеПараметраНастроек" Тогда
			ЗарегистрироватьЭлементыНастроек(Информация, УзелКД, ЭлементКД.ЗначенияВложенныхПараметров, Владелец, НастройкаВарианта);
		КонецЕсли;

		Если СвойстваНастройки <> Неопределено Тогда
			СвойстваНастройки.ЗначенияДляВыбора = НастройкаВарианта.ЗначенияДляВыбора;
			СвойстваНастройки.ПараметрыВыбора   = НастройкаВарианта.ПараметрыВыбора;
			СвойстваНастройки.БыстрыйВыбор      = НастройкаВарианта.БыстрыйВыбор;
			СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = НастройкаВарианта.ОграничиватьВыборУказаннымиЗначениями;
		КонецЕсли;

		Если НастройкаВарианта.Состояние = "ПометкаУдаления" Тогда
			Информация.ЕстьНесуществующиеПоля = Истина;
			ЕстьПомеченные = Истина;
		Иначе
			ЕстьНеПомеченные = Истина;
		КонецЕсли;
	КонецЦикла;

	Если ЕстьПомеченные И Не ЕстьНеПомеченные И Родитель <> Владелец Тогда
		Родитель.Состояние = "ПометкаУдаления";
	КонецЕсли;
КонецПроцедуры

Функция ЗарегистрироватьПользовательскуюНастройку(Информация, СвойстваНастройки, СтрокаДерева, НастройкаВарианта)
	ПользовательскаяНастройкаКД = СвойстваНастройки.ПользовательскаяНастройкаКД;

	РежимОтображения = ПользовательскаяНастройкаКД.РежимОтображения;
	Если РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный Тогда
		Возврат СвойстваНастройки;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СвойстваНастройки.Идентификатор) Тогда
		Возврат СвойстваНастройки;
	КонецЕсли;
	СвойстваНастройки.ИдентификаторЭлемента = СтрЗаменить(СтрЗаменить(Строка(СвойстваНастройки.Идентификатор), "-", ""), ".", "_");

	Если НастройкаВарианта <> Неопределено Тогда
		Если НастройкаВарианта.Владелец <> Неопределено Тогда
			СвойстваНастройки.УзелКД = НастройкаВарианта.Владелец.ЭлементКД;
		КонецЕсли;
		СвойстваНастройки.СтрокаДерева         = НастройкаВарианта.СтрокаДерева;
		СвойстваНастройки.НастройкаВариантаКД  = НастройкаВарианта.ЭлементКД;
		СвойстваНастройки.НастройкаВарианта    = НастройкаВарианта;
		СвойстваНастройки.Подтип               = НастройкаВарианта.Подтип;
		СвойстваНастройки.ПолеКД               = НастройкаВарианта.ПолеКД;
		СвойстваНастройки.ДоступнаяНастройкаКД = НастройкаВарианта.ДоступнаяНастройкаКД;
		СвойстваНастройки.ИнформацияОТипах     = НастройкаВарианта.ИнформацияОТипах;
		СвойстваНастройки.ОписаниеТипов        = НастройкаВарианта.ОписаниеТипов;
		Если РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто Тогда
			РежимОтображения = СвойстваНастройки.НастройкаВариантаКД.РежимОтображения;
		КонецЕсли;
	Иначе
		СвойстваНастройки.УзелКД              = СтрокаДерева.УзелКД;
		СвойстваНастройки.СтрокаДерева        = СтрокаДерева;
		СвойстваНастройки.Тип                 = СтрокаДерева.Тип;
		СвойстваНастройки.Подтип              = СтрокаДерева.Подтип;
		СвойстваНастройки.НастройкаВариантаКД = СвойстваНастройки.УзелКД;
		Если РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто Тогда
			РежимОтображения = СвойстваНастройки.УзелКД.РежимОтображения;
		КонецЕсли;
	КонецЕсли;

	Если РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ Тогда
		СвойстваНастройки.Быстрая = Истина;
		Информация.ЕстьБыстрыеНастройки = Истина;
	ИначеЕсли РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный Тогда
		СвойстваНастройки.Обычная = Истина;
		Информация.ЕстьОбычныеНастройки = Истина;
	ИначеЕсли Информация.ТолькоПользовательские Тогда
		Возврат СвойстваНастройки;
	КонецЕсли;

	// Определение доступной настройки.
	Если СвойстваНастройки.Тип = "НастройкиВложенногоОбъекта" Тогда
		СвойстваНастройки.ДоступнаяНастройкаКД = Информация.НастройкиКД.ДоступныеОбъекты.Элементы.Найти(СвойстваНастройки.СтрокаДерева.УзелКД.ИдентификаторОбъекта);
	КонецЕсли;

	Если Информация.ТолькоПользовательские Тогда
		Если Информация.ТолькоБыстрые Тогда
			СвойстваНастройки.ВыводРазрешен = СвойстваНастройки.Быстрая;
		Иначе
			СвойстваНастройки.ВыводРазрешен = Истина;
		КонецЕсли;
	КонецЕсли;

	СвойстваНастройки.ВыводитьФлажок = Истина;
	СвойстваНастройки.ВыводитьТолькоФлажок = Ложь;

	ЗаполнитьПредставлениеИСостояниеНастройки(СвойстваНастройки, СвойстваНастройки.НастройкаВариантаКД, СвойстваНастройки.ПользовательскаяНастройкаКД, СвойстваНастройки.ДоступнаяНастройкаКД);

	Если СвойстваНастройки.Состояние = "ПометкаУдаления" Тогда
		Информация.ЕстьНесуществующиеПоля = Истина;
		СвойстваНастройки.ВыводРазрешен = Ложь;
	КонецЕсли;

	Если СвойстваНастройки.Тип = "ГруппаЭлементовОтбора"
		Или СвойстваНастройки.Тип = "НастройкиВложенногоОбъекта"
		Или СвойстваНастройки.Тип = "Группировка"
		Или СвойстваНастройки.Тип = "Таблица"
		Или СвойстваНастройки.Тип = "ГруппировкаТаблицы"
		Или СвойстваНастройки.Тип = "Диаграмма"
		Или СвойстваНастройки.Тип = "ГруппировкаДиаграммы"
		Или СвойстваНастройки.Тип = "ЭлементУсловногоОформления" Тогда

		СвойстваНастройки.ВыводитьТолькоФлажок = Истина;
	ИначеЕсли СвойстваНастройки.Тип = "ЗначениеПараметраНастроек" Или СвойстваНастройки.Тип = "ЭлементОтбора" Тогда
		Если СвойстваНастройки.Тип = "ЗначениеПараметраНастроек" Тогда
			СвойстваНастройки.Значение = ПользовательскаяНастройкаКД.Значение;
		Иначе
			СвойстваНастройки.Значение = ПользовательскаяНастройкаКД.ПравоеЗначение;
		КонецЕсли;

		// Определение типа значения настройки.
		Если СвойстваНастройки.Тип = "ЗначениеПараметраНастроек" Тогда
			Если СвойстваНастройки.ДоступнаяНастройкаКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда Тогда
				СвойстваНастройки.ВыводитьФлажок			= Ложь;
				ПользовательскаяНастройкаКД.Использование	= Истина;
			КонецЕсли;
			Если СвойстваНастройки.ДоступнаяНастройкаКД.ДоступенСписокЗначений Тогда
				СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;
		ИначеЕсли СвойстваНастройки.Тип = "ЭлементОтбора" Тогда
			СвойстваНастройки.ВидСравнения = ПользовательскаяНастройкаКД.ВидСравнения;
		КонецЕсли;

		Если СвойстваНастройки.ИнформацияОТипах.СодержитТипПериод И СвойстваНастройки.ИнформацияОТипах.КоличествоТипов = 1 Тогда
			СвойстваНастройки.ТипЭлементов = "СтандартныйПериод";
		ИначеЕсли Не СвойстваНастройки.ВыводитьФлажок
			И СвойстваНастройки.ИнформацияОТипах.СодержитТипБулево
			И СвойстваНастройки.ИнформацияОТипах.КоличествоТипов = 1 Тогда

			СвойстваНастройки.ТипЭлементов = "ТолькоФлажокЗначения";

		ИначеЕсли СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено
			Или СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда

			СвойстваНастройки.ТипЭлементов = "УсловиеВРежимеПросмотра";
		ИначеЕсли СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
			Или СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
			Или СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
			Или СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда

			СвойстваНастройки.ВводСписком			= Истина;
			СвойстваНастройки.ТипЭлементов			= "СписокСПодбором";
			СвойстваНастройки.ВыборГруппИЭлементов	= ГруппыИЭлементы.ГруппыИЭлементы;
		Иначе
			СвойстваНастройки.ТипЭлементов = "СвязьСКомпоновщиком";
			Если СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии
				Или СвойстваНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда

				СвойстваНастройки.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
			КонецЕсли;
		КонецЕсли;

		Если СвойстваНастройки.ВыборГруппИЭлементов = Неопределено Тогда
			СвойстваНастройки.ВыборГруппИЭлементов = НастройкаВарианта.ВыборГруппИЭлементов;
		КонецЕсли;
	ИначеЕсли СвойстваНастройки.Тип = "ВыбранныеПоля"
		Или СвойстваНастройки.Тип = "Порядок"
		Или СвойстваНастройки.Тип = "КоллекцияЭлементовСтруктурыТаблицы"
		Или СвойстваНастройки.Тип = "КоллекцияЭлементовСтруктурыДиаграммы"
		Или СвойстваНастройки.Тип = "Отбор"
		Или СвойстваНастройки.Тип = "УсловноеОформление"
		Или СвойстваНастройки.Тип = "СтруктураНастроек" Тогда

		СвойстваНастройки.ТипЭлементов = "СвязьСКомпоновщиком";
		СвойстваНастройки.ВыводитьФлажок = Ложь;
	Иначе
		СвойстваНастройки.ТипЭлементов = "СвязьСКомпоновщиком";
	КонецЕсли;

	Если СвойстваНастройки.ВыводитьТолькоФлажок Тогда
		СвойстваНастройки.ТипЭлементов = "";
	ИначеЕсли СвойстваНастройки.Быстрая И СвойстваНастройки.ТипЭлементов = "СписокСПодбором" Тогда
		СвойстваНастройки.ТипЭлементов = "СвязьСКомпоновщиком";
	КонецЕсли;

	Возврат СвойстваНастройки;
КонецФункции

Процедура ЗарегистрироватьПоле(Информация, УзелКД, ЭлементКД, НастройкаВарианта)
	Если ПустаяСтрока(НастройкаВарианта.Идентификатор) Тогда
		Идентификатор = Строка(НастройкаВарианта.СтрокаДерева.ИдентификаторКД);
		Если Не ПустаяСтрока(Идентификатор) Тогда
			Идентификатор = Идентификатор + "_";
		КонецЕсли;
		НастройкаВарианта.Идентификатор = Идентификатор + НастройкаВарианта.ИмяКоллекции + "_" + Строка(НастройкаВарианта.ИдентификаторКД);
	КонецЕсли;
	НастройкаВарианта.ИдентификаторЭлемента = СтрЗаменить(СтрЗаменить(Строка(НастройкаВарианта.Идентификатор), "-", ""), ".", "_");

	Если НастройкаВарианта.Тип = "ЗначениеПараметраНастроек" Тогда
		НастройкаВарианта.ПолеКД = Новый ПолеКомпоновкиДанных("ПараметрыДанных." + Строка(ЭлементКД.Параметр));
		ДоступныеПараметры = УзелКД.ДоступныеПараметры;
		Если ДоступныеПараметры = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДоступнаяНастройкаКД = ДоступныеПараметры.НайтиПараметр(ЭлементКД.Параметр);
		Если ДоступнаяНастройкаКД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// ДоступнаяНастройкаКД имеет тип ДоступныйПараметрКомпоновкиДанных:
		//   Видимость - Булево - Видимость параметра при редактировании значений.
		//   Параметр - ПараметрКомпоновкиДанных - Имя параметра.
		//   Значение - Произвольный - Начальное значение.
		//   ДоступенСписокЗначений - Булево - Можно ли указывать несколько значений.
		//   ДоступныеЗначения - СписокЗначений, Неопределено - Значения, доступные для выбора.
		//   БыстрыйВыбор, ВыборГруппИЭлементов, ЗапрещатьНезаполненныеЗначения,
		//   Использование, Маска, СвязьПоТипу, ФормаВыбора, ФорматРедактирования.
		Если Не ДоступнаяНастройкаКД.Видимость Тогда
			НастройкаВарианта.ВыводРазрешен = Ложь;
		КонецЕсли;
		НастройкаВарианта.ДоступнаяНастройкаКД	= ДоступнаяНастройкаКД;
		НастройкаВарианта.Значение				= ЭлементКД.Значение;
		Если ДоступнаяНастройкаКД.ДоступенСписокЗначений Тогда
			НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Иначе
			НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		Если ДоступнаяНастройкаКД.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда Тогда
			НастройкаВарианта.ВыводитьФлажок = Ложь;
		КонецЕсли;
	Иначе
		НастройкаВарианта.ПолеКД       = ЭлементКД.ЛевоеЗначение;
		НастройкаВарианта.Значение     = ЭлементКД.ПравоеЗначение;
		НастройкаВарианта.ВидСравнения = ЭлементКД.ВидСравнения;
		ДоступныеПоляОтбора = УзелКД.ДоступныеПоляОтбора;
		Если ДоступныеПоляОтбора = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДоступнаяНастройкаКД = ДоступныеПоляОтбора.НайтиПоле(ЭлементКД.ЛевоеЗначение);
		Если ДоступнаяНастройкаКД = Неопределено Тогда
			Возврат;
		КонецЕсли;
		// ДоступнаяНастройкаКД имеет тип ДоступноеПолеОтбораКомпоновкиДанных.
		НастройкаВарианта.ДоступнаяНастройкаКД = ДоступнаяНастройкаКД;
	КонецЕсли;

	Если НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
		Или НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии
		Или НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
		Или НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда

		НастройкаВарианта.ВводСписком			= Истина;
		НастройкаВарианта.ВыборГруппИЭлементов	= ГруппыИЭлементы.ГруппыИЭлементы;
	ИначеЕсли НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии Или НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии Тогда
		НастройкаВарианта.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		НастройкаВарианта.ВыборГруппИЭлементов = ВариантыОтчетовКлиентСервер.ПривестиЗначениеКТипуГруппыИЭлементы(ДоступнаяНастройкаКД.ВыборГруппИЭлементов);
	КонецЕсли;

	НастройкаВарианта.ОписаниеТипов = ДоступнаяНастройкаКД.ТипЗначения;
	НастройкаВарианта.ФормаВыбора   = ДоступнаяНастройкаКД.ФормаВыбора;
	НастройкаВарианта.БыстрыйВыбор  = ДоступнаяНастройкаКД.БыстрыйВыбор;

	Если Информация.Поиск.НастройкиВариантаПоПолюКД.Получить(НастройкаВарианта.ПолеКД) = Неопределено Тогда
		Информация.Поиск.НастройкиВариантаПоПолюКД.Вставить(НастройкаВарианта.ПолеКД, НастройкаВарианта);
	КонецЕсли;
КонецПроцедуры

Процедура ЗарегистрироватьТипыИСвязи(Информация, НастройкаВарианта)
	НастройкаВарианта.СвязиПоМетаданным     = Новый Массив;
	НастройкаВарианта.СвязиПараметровВыбора = Новый Массив;
	НастройкаВарианта.ПараметрыВыбора       = Новый Массив;

	Если НастройкаВарианта.ВводСписком Тогда
		НастройкаВарианта.ОтмеченныеЗначения = БазоваяПодсистемаКлиентСервер.ЗначенияСписком(НастройкаВарианта.Значение);
	КонецЕсли;
	НастройкаВарианта.ЗапросЗначенийВыбора	= Новый Запрос;
	НастройкаВарианта.ЗначенияДляВыбора		= Новый СписокЗначений;

	ИнформацияОТипах		= БазоваяПодсистемаКлиентСервер.АнализТипов(НастройкаВарианта.ОписаниеТипов, Истина);
	ИнформацияОТипах.Вставить("СодержитСсылочныеТипы", Ложь);
	ИнформацияОТипах.Вставить("КоличествоСБыстрымВыбором", 0);
	ВсеТипыСБыстрымВыбором	= ИнформацияОТипах.КоличествоТипов < 10 И (ИнформацияОТипах.КоличествоТипов = ИнформацияОТипах.ОбъектныеТипы.Количество());

	Для Каждого Тип Из ИнформацияОТипах.ОбъектныеТипы Цикл
		ОбъектМетаданных	= Метаданные.НайтиПоТипу(Тип);
		ПолноеИмя			= Информация.СоответствиеИменОбъектовМетаданных.Получить(Тип);
		Если ПолноеИмя = Неопределено Тогда // Регистрация имени объекта метаданных.
			Если ОбъектМетаданных = Неопределено Тогда
				ПолноеИмя = -1;
			Иначе
				ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
			КонецЕсли;
			Информация.СоответствиеИменОбъектовМетаданных.Вставить(Тип, ПолноеИмя);
		КонецЕсли;
		Если ПолноеИмя = -1 Тогда
			ВсеТипыСБыстрымВыбором = Ложь;

			Продолжить;
		КонецЕсли;

		ИнформацияОТипах.СодержитСсылочныеТипы = Истина;

		Если ВсеТипыСБыстрымВыбором Тогда
			Вид = ВРег(СтрРазделить(ПолноеИмя, ".")[0]);
			Если Вид <> "ПЕРЕЧИСЛЕНИЕ" Тогда
				Если Вид = "СПРАВОЧНИК" Или Вид = "ПЛАНВИДОВРАСЧЕТА" Или Вид = "ПЛАНВИДОВХАРАКТЕРИСТИК" Или Вид = "ПЛАНОБМЕНА" Или Вид = "ПЛАНСЧЕТОВ" Тогда
					Если ОбъектМетаданных.СпособВыбора <> Метаданные.СвойстваОбъектов.СпособВыбора.БыстрыйВыбор Тогда
						ВсеТипыСБыстрымВыбором = Ложь;
					КонецЕсли;
				Иначе
					ВсеТипыСБыстрымВыбором = Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		// Поиск типа в глобальных связях среди подчиненных.
		Найденные = Информация.Связи.ОбъектовМетаданных.НайтиСтроки(Новый Структура("ПодчиненныйТип", Тип));
		Для Каждого СвязьПоМетаданным Из Найденные Цикл // Регистрация настройки как подчиненной.
			СвязьПоМетаданным.ЕстьПодчиненные = Истина;
			СвязьПоМетаданным.Подчиненные.Добавить(НастройкаВарианта);
		КонецЦикла;

		// Поиск типа в глобальных связях среди ведущих.
		Если НастройкаВарианта.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			// Поле может быть ведущим если имеет вид сравнения "Равно".
			Найденные = Информация.Связи.ОбъектовМетаданных.НайтиСтроки(Новый Структура("ВедущийТип", Тип));
			Для Каждого СвязьПоМетаданным Из Найденные Цикл // Регистрация настройки как ведущей.
				СвязьПоМетаданным.ЕстьВедущие = Истина;
				СвязьПоМетаданным.Ведущие.Добавить(НастройкаВарианта);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	// Только перечисления или типы с быстрым выбором.
	Если ВсеТипыСБыстрымВыбором И ИнформацияОТипах.ОбъектныеТипы.Количество() = ИнформацияОТипах.КоличествоТипов Тогда
		НастройкаВарианта.БыстрыйВыбор = Истина;
	КонецЕсли;

	НастройкаВарианта.ИнформацияОТипах	= ИнформацияОТипах;
	НастройкаВарианта.ОписаниеТипов		= ИнформацияОТипах.ОписаниеТиповДляФормы;

	///////////////////////////////////////////////////////////////////
	// Информация о связях и параметрах выбора.

	ДоступнаяНастройкаКД = НастройкаВарианта.ДоступнаяНастройкаКД;
	Если ДоступнаяНастройкаКД = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДоступнаяНастройкаКД.СвязьПоТипу) Тогда
		СтрокаСвязи							= Информация.Связи.ПоТипу.Добавить();
		СтрокаСвязи.Подчиненный				= НастройкаВарианта;
		СтрокаСвязи.ВедущийПолеКД			= ДоступнаяНастройкаКД.СвязьПоТипу.Поле;
		СтрокаСвязи.ПодчиненныйИмяПараметра = ДоступнаяНастройкаКД.СвязьПоТипу.ЭлементСвязи;
	КонецЕсли;

	Для Каждого СтрокаСвязи Из ДоступнаяНастройкаКД.ПолучитьСвязиПараметровВыбора() Цикл
		Если ПустаяСтрока(Строка(СтрокаСвязи.Поле)) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаСвязиПараметров							= Информация.Связи.ПараметровВыбора.Добавить();
		СтрокаСвязиПараметров.Подчиненный				= НастройкаВарианта;
		СтрокаСвязиПараметров.ПодчиненныйИмяПараметра	= СтрокаСвязи.Имя;
		СтрокаСвязиПараметров.ВедущийПолеКД				= СтрокаСвязи.Поле;
		СтрокаСвязиПараметров.Действие					= СтрокаСвязи.ИзменениеЗначения;
	КонецЦикла;

	Для Каждого ПараметрВыбораКД Из ДоступнаяНастройкаКД.ПолучитьПараметрыВыбора() Цикл
		НастройкаВарианта.ПараметрыВыбора.Добавить(Новый ПараметрВыбора(ПараметрВыбораКД.Имя, ПараметрВыбораКД.Значение));
	КонецЦикла;

	///////////////////////////////////////////////////////////////////
	// Список значений.

	Если ТипЗнч(ДоступнаяНастройкаКД.ДоступныеЗначения) = Тип("СписокЗначений") Тогда
		НастройкаВарианта.ЗначенияДляВыбора						= ДоступнаяНастройкаКД.ДоступныеЗначения;
		НастройкаВарианта.ОграничиватьВыборУказаннымиЗначениями = НастройкаВарианта.ЗначенияДляВыбора.Количество() > 0;
	Иначе
		НастройкиСохраненныеРанее	= Информация.ДополнительныеНастройкиЭлементов[НастройкаВарианта.ИдентификаторЭлемента];
		Ограничивать				= БазоваяПодсистемаКлиентСервер.СвойствоСтруктуры(НастройкиСохраненныеРанее, "ОграничиватьВыборУказаннымиЗначениями");
		Если НастройкиСохраненныеРанее <> Неопределено И Ограничивать = Ложь Тогда
			СтарыеЗначенияДляВыбора = БазоваяПодсистемаКлиентСервер.СвойствоСтруктуры(НастройкиСохраненныеРанее, "ЗначенияДляВыбора");
			Если ТипЗнч(СтарыеЗначенияДляВыбора) = Тип("СписокЗначений") Тогда
				НастройкаВарианта.ЗначенияДляВыбора.ТипЗначения = НастройкаВарианта.ОписаниеТипов;
				Для Каждого СтарыйЭлементСписка Из СтарыеЗначенияДляВыбора Цикл
					Если Не НастройкаВарианта.ОписаниеТипов.СодержитТип(ТипЗнч(СтарыйЭлементСписка.Значение)) Тогда
						Продолжить;
					КонецЕсли;
					Если НастройкаВарианта.ЗначенияДляВыбора.НайтиПоЗначению(СтарыйЭлементСписка.Значение) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					ЭлементПриемник				= НастройкаВарианта.ЗначенияДляВыбора.Добавить();
					ЭлементПриемник.Значение	= СтарыйЭлементСписка.Значение;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПредставлениеИСостояниеНастройки(СвойстваНастройки, НастройкаВариантаКД, ПользовательскаяНастройкаКД, ДоступнаяНастройкаКД)
	Если ПользовательскаяНастройкаКД = Неопределено Тогда
		ПользовательскаяНастройкаКД = НастройкаВариантаКД;
	КонецЕсли;

	СтруктураПредставлений = Новый Структура("Представление, ПредставлениеПользовательскойНастройки", "", "");
	ЗаполнитьЗначенияСвойств(СтруктураПредставлений, НастройкаВариантаКД);

	СвойстваНастройки.ВыводитьТолькоФлажок = ЗначениеЗаполнено(СтруктураПредставлений.Представление);

	Если ЗначениеЗаполнено(СтруктураПредставлений.ПредставлениеПользовательскойНастройки) Тогда
		Представление = СтруктураПредставлений.ПредставлениеПользовательскойНастройки;
	ИначеЕсли ЗначениеЗаполнено(СтруктураПредставлений.Представление) И СтруктураПредставлений.Представление <> "1" Тогда
		Представление = СтруктураПредставлений.Представление;
	Иначе
		Представление = "";
	КонецЕсли;
	СвойстваНастройки.Представление = СокрЛП(Представление);

	// Представление "По умолчанию".
	Если ДоступнаяНастройкаКД <> Неопределено И ЗначениеЗаполнено(ДоступнаяНастройкаКД.Заголовок) Тогда
		ПредставлениеПоУмолчанию = ДоступнаяНастройкаКД.Заголовок;
	ИначеЕсли ЗначениеЗаполнено(СвойстваНастройки.Подтип) Тогда
		Если СвойстваНастройки.Подтип = "ДиаграммаСерии" Тогда
			ПредставлениеПоУмолчанию = "Серии";
		ИначеЕсли СвойстваНастройки.Подтип = "ДиаграммаТочки" Тогда
			ПредставлениеПоУмолчанию = "Точки";
		ИначеЕсли СвойстваНастройки.Подтип = "ТаблицаСтроки" Тогда
			ПредставлениеПоУмолчанию = "Строки";
		ИначеЕсли СвойстваНастройки.Подтип = "ТаблицаКолонки" Тогда
			ПредставлениеПоУмолчанию = "Колонки";
		ИначеЕсли СвойстваНастройки.Подтип = "Отчет" Тогда
			ПредставлениеПоУмолчанию = "Отчет";
		Иначе
			ПредставлениеПоУмолчанию = Строка(СвойстваНастройки.Подтип);
		КонецЕсли;

	// Параметры и отборы.
	ИначеЕсли СвойстваНастройки.Тип = "Отбор" Тогда
		ПредставлениеПоУмолчанию = "Отбор";
	ИначеЕсли СвойстваНастройки.Тип = "ГруппаЭлементовОтбора" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.ТипГруппы);
	ИначеЕсли СвойстваНастройки.Тип = "ЭлементОтбора" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.ЛевоеЗначение);
	ИначеЕсли СвойстваНастройки.Тип = "ЗначениеПараметраНастроек" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.Параметр);

	// Сортировки.
	ИначеЕсли СвойстваНастройки.Тип = "Порядок" Тогда
		ПредставлениеПоУмолчанию = "Сортировка";
	ИначеЕсли СвойстваНастройки.Тип = "АвтоЭлементПорядка" Тогда
		ПредставлениеПоУмолчанию = "Авто (сортировки родителя)";
	ИначеЕсли СвойстваНастройки.Тип = "ЭлементПорядка" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.Поле);

	// Выбранные поля.
	ИначеЕсли СвойстваНастройки.Тип = "ВыбранныеПоля" Тогда
		ПредставлениеПоУмолчанию = "Поля";
	ИначеЕсли СвойстваНастройки.Тип = "ВыбранноеПоле" Тогда
		ПредставлениеПоУмолчанию = Строка(НастройкаВариантаКД.Поле);
	ИначеЕсли СвойстваНастройки.Тип = "АвтоВыбранноеПоле" Тогда
		ПредставлениеПоУмолчанию = "Авто (поля родителя)";
	ИначеЕсли СвойстваНастройки.Тип = "ГруппаВыбранныхПолей" Тогда
		ПредставлениеПоУмолчанию = НастройкаВариантаКД.Заголовок;
		Если НастройкаВариантаКД.Расположение <> РасположениеПоляКомпоновкиДанных.Авто Тогда
			ПредставлениеПоУмолчанию = ПредставлениеПоУмолчанию + " (" + Строка(НастройкаВариантаКД.Расположение) + ")";
		КонецЕсли;

	// Оформление.
	ИначеЕсли СвойстваНастройки.Тип = "УсловноеОформление" Тогда
		ПредставлениеПоУмолчанию = "Оформление";
	ИначеЕсли СвойстваНастройки.Тип = "ЭлементУсловногоОформления" Тогда
		ПредставлениеПоУмолчанию = БазоваяПодсистемаКлиентСервер.ПредставлениеЭлементаУсловногоОформления(ПользовательскаяНастройкаКД, НастройкаВариантаКД, СвойстваНастройки.Состояние);

	// Структура.
	ИначеЕсли СвойстваНастройки.Тип = "Группировка"
		Или СвойстваНастройки.Тип = "ГруппировкаТаблицы"
		Или СвойстваНастройки.Тип = "ГруппировкаДиаграммы" Тогда
		ПредставлениеПоУмолчанию = СокрЛП(Строка(НастройкаВариантаКД.ПоляГруппировки));
		Если ПустаяСтрока(ПредставлениеПоУмолчанию) Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = '<Детальные записи>'");
		Иначе
			ДоступныеПоляКД = НастройкаВариантаКД.ПоляГруппировки.ДоступныеПоляПолейГруппировок;
			Для Каждого ПолеГруппировкиКД Из НастройкаВариантаКД.ПоляГруппировки.Элементы Цикл
				Если ТипЗнч(ПолеГруппировкиКД) = Тип("ПолеГруппировкиКомпоновкиДанных")
					И ДоступныеПоляКД.НайтиПоле(ПолеГруппировкиКД.Поле) = Неопределено Тогда
					СвойстваНастройки.Состояние = "ПометкаУдаления";
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли СвойстваНастройки.Тип = "Таблица" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Таблица'");
	ИначеЕсли СвойстваНастройки.Тип = "Диаграмма" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Диаграмма'");
	ИначеЕсли СвойстваНастройки.Тип = "НастройкиВложенногоОбъекта" Тогда
		ПредставлениеПоУмолчанию = Строка(ПользовательскаяНастройкаКД);
		Если ПустаяСтрока(ПредставлениеПоУмолчанию) Тогда
			ПредставлениеПоУмолчанию = НСтр("ru = 'Вложенная группировка'");
		КонецЕсли;
	ИначеЕсли СвойстваНастройки.Тип = "СтруктураНастроек" Тогда
		ПредставлениеПоУмолчанию = НСтр("ru = 'Структура'");
	Иначе
		ПредставлениеПоУмолчанию = Строка(СвойстваНастройки.Тип);
	КонецЕсли;
	СвойстваНастройки.ПредставлениеПоУмолчанию = СокрЛП(ПредставлениеПоУмолчанию);

	Если СвойстваНастройки.ДоступнаяНастройкаКД = Неопределено
		И (СвойстваНастройки.Тип = "ЭлементОтбора"
			Или СвойстваНастройки.Тип = "ЗначениеПараметраНастроек"
			Или СвойстваНастройки.Тип = "ЭлементПорядка"
			Или СвойстваНастройки.Тип = "ВыбранноеПоле")Тогда
		СвойстваНастройки.Состояние = "ПометкаУдаления";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СвойстваНастройки.Представление) Тогда
		СвойстваНастройки.Представление = СвойстваНастройки.ПредставлениеПоУмолчанию;
	КонецЕсли;
КонецПроцедуры

Функция ЗаголовокИзПараметровВывода(ПараметрыВывода)
	ВыводитьЗаголовокКД = ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьЗаголовок"));
	Если ВыводитьЗаголовокКД = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Если ВыводитьЗаголовокКД.Использование = Истина
		И ВыводитьЗаголовокКД.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить Тогда
		Возврат "";
	КонецЕсли;
	// В значении Авто считается что заголовок выводится.
	// Когда параметр ВыводитьЗаголовок отключен это эквивалент значения Авто.
	ЗаголовокКД = ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок"));
	Если ЗаголовокКД = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат ЗаголовокКД.Значение;
КонецФункции

Процедура ПриОпределенииПараметровВыбора(Информация, НастройкаВарианта)
	ПредставлениеДо	= Строка(НастройкаВарианта.ЗначенияДляВыбора);
	КоличествоДо	= НастройкаВарианта.ЗначенияДляВыбора.Количество();

	// Механизмы расширения.
	// Локальное переопределение для отчета.
	Если Информация.НастройкиОтчета.События.ПриОпределенииПараметровВыбора Тогда
		ОтчетОбъект(Информация.ОтчетОбъектИлиПолноеИмя).ПриОпределенииПараметровВыбора(Неопределено, НастройкаВарианта);
	КонецЕсли;

	// Автоматическое заполнение.
	Если НастройкаВарианта.ЗапросЗначенийВыбора.Текст <> "" Тогда
		ДобавляемыеЗначения = НастройкаВарианта.ЗапросЗначенийВыбора.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
		Для Каждого ЗначениеВФорме Из ДобавляемыеЗначения Цикл
			БазоваяПодсистемаКлиентСервер.ДобавитьУникальноеЗначениеВСписок(НастройкаВарианта.ЗначенияДляВыбора, ЗначениеВФорме, Неопределено, Ложь);
		КонецЦикла;
		НастройкаВарианта.ЗначенияДляВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	КонецЕсли;

	// Удаление значений, выбор которых запрещен.
	Если НастройкаВарианта.ВводСписком
		И НастройкаВарианта.ОграничиватьВыборУказаннымиЗначениями
		И ТипЗнч(НастройкаВарианта.Значение) = Тип("СписокЗначений")
		И ТипЗнч(НастройкаВарианта.ЗначенияДляВыбора) = Тип("СписокЗначений") Тогда
		Список = НастройкаВарианта.Значение;
		Количество = Список.Количество();
		Для Номер = 1 По Количество Цикл
			ОбратныйИндекс	= Количество - Номер;
			Значение		= Список[ОбратныйИндекс].Значение;
			Если НастройкаВарианта.ЗначенияДляВыбора.НайтиПоЗначению(Значение) = Неопределено Тогда
				Список.Удалить(ОбратныйИндекс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если КоличествоДо <> НастройкаВарианта.ЗначенияДляВыбора.Количество() Или ПредставлениеДо <> Строка(НастройкаВарианта.ЗначенияДляВыбора) Тогда
		НастройкаВарианта.СписокЗначенийПереопределен = Истина;
	КонецЕсли;
КонецПроцедуры

Функция ОтчетОбъект(ОтчетОбъектИлиПолноеИмя) Экспорт
	Если ТипЗнч(ОтчетОбъектИлиПолноеИмя) = Тип("Строка") Тогда
		ОтчетОбъектИлиПолноеИмя = БазоваяПодсистемаСервер.ОбъектПоПолномуИмени(ОтчетОбъектИлиПолноеИмя);
	КонецЕсли;

	Возврат ОтчетОбъектИлиПолноеИмя;
КонецФункции

#КонецОбласти
