
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Если Не ДополнительныеСвойства.Свойство("ПропуститьОбновлениеВерсииДатЗапретаИзменения") Тогда
			ОбновитьВерсиюДатЗапретаИзмененияПриЗагрузкеДанных();
		КонецЕсли;

		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

Процедура ОбновитьВерсиюДатЗапретаИзмененияПриЗагрузкеДанных()
// зарезервировано для новых подсистем
КонецПроцедуры

#КонецЕсли

