#Область ОписаниеПеременных

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "ПодсистемыБиблиотек.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["ПодсистемыБиблиотек.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["ПодсистемыБиблиотек.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	БазоваяПодсистемаКлиент.ПередНачаломРаботыСистемы();	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	БазоваяПодсистемаКлиент.ПриНачалеРаботыСистемы();
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения)
	БазоваяПодсистемаКлиент.ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения);
КонецПроцедуры

#КонецОбласти
