
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ТолькоПросмотр = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВозможностьРедактирования(Команда)
	ТолькоПросмотр = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеРегистра(Команда)
	ЕстьИзменения = Ложь;

	ОбновитьДанныеРегистраНаСервере(ЕстьИзменения);

	Если ЕстьИзменения Тогда
		Текст = "Обновление выполнено успешно.";
	Иначе
		Текст = "Обновление не требуется.";
	КонецЕсли;

	ПоказатьПредупреждение(, Текст);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьДанныеРегистраНаСервере(ЕстьИзменения)
	РегистрыСведений.СоставыГруппПользователей.ОбновитьДанныеРегистра(ЕстьИзменения);

	Элементы.Список.Обновить();
КонецПроцедуры

