////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление информационной базы"
//
////////////////////////////////////////////////////////////////////////////////

// Проверяет статус отложенного обновления. Если обновление завершилось
// с ошибками - информирует об этом пользователя и администратора.
//
Процедура ПроверитьСтатусОтложенногоОбновления() Экспорт
	ПараметрыКлиента = БазоваяПодсистемаКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске();

	Если ПараметрыКлиента.Свойство("ПоказатьСообщениеОбОшибочныхОбработчиках") Тогда
		ОткрытьФорму("Обработка.РезультатыОбновленияПрограммы.Форма.ИндикацияХодаОтложенногоОбновленияИБ");
	Иначе
		ОбновлениеИБКлиент.ОповеститьОтложенныеОбработчикиНеВыполнены();
	КонецЕсли;
КонецПроцедуры