#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	НастройкиВарианта			= ВариантыОтчетовСервер.ОписаниеВарианта(Настройки, НастройкиОтчета, "СведенияОПользователяхИВнешнихПользователях");
	НастройкиВарианта.Описание	= "Выводит подробные сведения о всех пользователях, включая настройки для входа (если указаны).";
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьВнешнихПользователей");

	НастройкиВарианта			= ВариантыОтчетовСервер.ОписаниеВарианта(Настройки, НастройкиОтчета, "СведенияОПользователях");
	НастройкиВарианта.Описание	= "Выводит подробные сведения о пользователях, включая настройки для входа (если указаны).";

	НастройкиВарианта			= ВариантыОтчетовСервер.ОписаниеВарианта(Настройки, НастройкиОтчета, "СведенияОВнешнихПользователях");
	НастройкиВарианта.Описание	= "Выводит подробные сведения о внешних пользователях, включая настройки для входа (если указаны).";
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьВнешнихПользователей");
КонецПроцедуры

#КонецЕсли