
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	Обработчики.Вставить("ВыполняетсяОбновлениеИБ",			"ОбновлениеИБСервер.УстановкаПараметровСеанса");
	Обработчики.Вставить("ПараметрыОбработчикаОбновления",	"ОбновлениеИБСервер.УстановкаПараметровСеанса");

	// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

// Доопределяет действия при создании администратора в подсистеме Пользователи.
//
// Параметры:
//  Администратор - СправочникСсылка.Пользователи (изменение объекта запрещено).
//  Уточнение     - Строка - поясняет при каких условиях был создан администратор.
//
Процедура ПриСозданииАдминистратора(Администратор, Уточнение) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеЗаписиАдминистратораПриАвторизации(Комментарий) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииНастроек(Настройки) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриПолученииПрочихНастроек(СведенияОПользователе, Настройки) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриСохраненииПрочихНастроек(СведенияОПользователе, Настройки) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеОбновленияСоставовГруппПользователей(УчастникиИзменений, ИзмененныеГруппы) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеДобавленияИзмененияПользователяИлиГруппы(Ссылка, ЭтоНовый) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры
