#Область ОбновлениеИнформационнойБазы

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
//
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   * Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   * ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                    Обработчики обновления таких библиотек должны быть вызваны ранее
//                                    обработчиков обновления данной библиотеки.
//                                    При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                    порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                    в процедуре ПриДобавленииПодсистем общего модуля
//                                    ПодсистемыКонфигурацииСервер.
//   * РежимВыполненияОтложенныхОбработчиков - Строка - "Последовательно" - отложенные обработчики обновления выполняются
//                                    последовательно в интервале от номера версии информационной базы до номера
//                                    версии конфигурации включительно или "Параллельно" - отложенный обработчик после
//                                    обработки первой порции данных передает управление следующему обработчику, а после
//                                    выполнения последнего обработчика цикл повторяется заново.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	Описание.Имя										= "СтандартныеПодсистемы";
	Описание.Версия										= "2.4.1.54";
	Описание.РежимВыполненияОтложенныхОбработчиков		= "Параллельно";
	Описание.ПараллельноеОтложенноеОбновлениеСВерсии	= "2.3.3.0";
КонецПроцедуры

#КонецОбласти

Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	Обработчики.Вставить("ВыполняетсяОбновлениеИБ",			"ОбновлениеИБСервер.УстановкаПараметровСеанса");
	Обработчики.Вставить("ПараметрыОбработчикаОбновления",	"ОбновлениеИБСервер.УстановкаПараметровСеанса");

	// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт
	// зарезервировано для новых подсистем

	Параметры.Вставить("ЭтоПолноправныйПользователь", ПользователиСервер.ЭтоПолноправныйПользователь());

	// зарезервировано для новых подсистем

	БазоваяПодсистемаСервер.ДобавитьПараметрыРаботыКлиента(Параметры);

	// зарезервировано для новых подсистем
КонецПроцедуры

// Доопределяет действия при создании администратора в подсистеме Пользователи.
//
// Параметры:
//  Администратор - СправочникСсылка.Пользователи (изменение объекта запрещено).
//  Уточнение     - Строка - поясняет при каких условиях был создан администратор.
//
Процедура ПриСозданииАдминистратора(Администратор, Уточнение) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеЗаписиАдминистратораПриАвторизации(Комментарий) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриОпределенииНастроек(Настройки) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриПолученииПрочихНастроек(СведенияОПользователе, Настройки) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПриСохраненииПрочихНастроек(СведенияОПользователе, Настройки) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеОбновленияСоставовГруппПользователей(УчастникиИзменений, ИзмененныеГруппы) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры

Процедура ПослеДобавленияИзмененияПользователяИлиГруппы(Ссылка, ЭтоНовый) Экспорт
// зарезервировано для новых подсистем
КонецПроцедуры
