// Определяет список модулей библиотек и конфигурации, которые предоставляют
// основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и конфигурации.
//
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	МодулиПодсистем.Добавить("ПодсистемыКонфигурацииСервер");
КонецПроцедуры

Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	Описание.Имя										= "УправлениеАвтосалоном";
	Описание.Версия										= "1.0.0.1";
	Описание.РежимВыполненияОтложенныхОбработчиков		= "Параллельно";
	Описание.ПараллельноеОтложенноеОбновлениеСВерсии	= "1.0.0.1";

	Описание.ТребуемыеПодсистемы.Добавить("СтандартныеПодсистемы");
КонецПроцедуры